编号	内容_S
1001	今天的秘册任务已经全部完成
1002	恭喜你！你获得了月儿岛秘径图，月儿岛现世时间有限，请尽快完成！
1003	秘册任务不可组队战斗
1004	这位仙友，我算出有秘册与你有缘，只是已落在他人手中
1005	哼，这秘册还是与我比较有缘
1006	*3*这秘册我好不容易才找到，可恶……
1007	*3*你、你、你给我等着瞧！
1008	*3*…………（阴森森地看着你）
1009	*3*好、好，你们正道夺人财物的借口还真是一样的
1010	*3*有什么是与你们没缘的吗？！
2001	有缘人，我赠你月儿岛#C04珍宝#n一件，请有缘人切勿贪心，以免遭受不测
	#C04继续寻宝#n
	取宝就走
2002	有缘人，你实力确实不错，然而我连山却也出身蜀山正宗这样吧，拿一件#C04稀宝#n便回去，如何？
	#C04继续寻宝#n
	取宝就走
2003	我月儿岛#C04秘宝#n就赐予你吧，有缘人，切勿过于贪婪啊！
	#C04继续寻宝#n
	取宝就走
2004	呵呵呵，果然是我月儿岛#C04秘宝#n有缘人，那就赐予你吧
2005	唔，难道真是人定胜天？我连山的#C04镇山之宝#n，只能赐予你了
2006	哼！月儿岛只容有缘人进去，你怎么能呼朋引伴而来？！\n#C04（该任务不得组队进行）#n
2007	受到教训了吧？所以说切勿贪心，你还是选择拿#C04珍宝#n走吧
2008	受到教训了吧？所以说切勿贪心，你还是选择拿#C04稀宝#n走吧
2009	受到教训了吧？所以说切勿贪心，你还是选择拿#C04秘宝#n走吧
8001	领到秘册任务，快去完成吧！
8002	已领取月儿岛取宝任务！
8003	#C01$roleName#n在探索月儿岛第二关时，幸运地获得了$lnkProps
8004	#C01$roleName#n在探索月儿岛第三关时，幸运地获得了$lnkProps
8005	秘册消息只与你有缘，请你勿把消息告诉给其他人。\n#C04（该任务不得组队进行）#n
