# -*- coding: utf-8 -*-
from task.defines import *
from task.object import Task as customTask

#导表开始
class Task(customTask):
	parentId = 1
	targetType = TASK_TARGET_TYPE_NPC
	icon = 0
	title = '''测试寻人'''
	intro = '''传话给$target'''
	detail = '''替师父为$target传话，切莫耽误'''
	rewardDesc = ''''''
	goAheadScript = ''''''
	initScript = '''N1001,E(1001,1001)'''

	npcInfo = {
		1001:{"名称":"旁门散人","造型":"1111(1,1,1,1,1)","位置":"1130,50,50,0","动作":5,"称谓":"百晓副本"},
		1002:{"名称":"店小二","造型":"1111(1,1,1,1,1)","位置":"1010,50,77,1"},
		5001:{"名称":"地痞","造型":"4502(0,1,0,0,0)","位置":"1130,50,50,6"},
		5002:{"名称":"围观群众","造型":"4502(0,1,0,0,0)","位置":"1030,88,51,8"},
	}

	eventInfo = {
		1001:{"点击":"STORY50001"},
		1002:{"点击":"STORY40011"},
		1003:{"点击":"TAKE","成功":"DONE,R1002,D1004","失败":"D1002"},
		1004:{"点击":"POPI","成功":"DONE,R1002,D1004","失败":"D1002"},
		5001:{"点击":"STORY40000","回复":"1:D5003;2:D5004"},
		5002:{"点击":"D5002"},
		5003:{"点击":"STORY40011"},
	}

	rewardInfo = {
		1001:{"经验":"LV*5+100","宠物经验":"PLV*2+100","银币":"999","物品":"1001"},
		1002:{"经验":"LV*5+100","宠物经验":"PLV*2+100","银币":"999","物品":"1001,1002"},
		2002:{"物品":"1002"},
		2003:{"物品":"1002"},
	}

	rewardPropsInfo = {
		1001:(
			{"权重":50,"物品":"202021","数量":"5","绑定":0},
			{"权重":25,"物品":"202022","数量":"3","绑定":1,"传闻":1001},
			{"权重":25,"物品":"202023","数量":"1","绑定":0},
		),
		1002:(
			{"权重":50,"物品":"202001","数量":"5","绑定":1},
			{"权重":25,"物品":"202002","数量":"3","绑定":0},
			{"权重":25,"物品":"202003","数量":"1","绑定":0},
		),
	}

	groupInfo = {
		9001:(202001,202002,202003,202004,202005,),
		9002:(20101,20102,20103,20201,),
		9003:(1130,1040,),
		9004:(202001,202002,202003,202004,202005,),
		9005:(202001,202002,202003,202004,202005,),
		9006:(202001,202002,202003,202004,202005,),
		9007:(1001,1002,1003,),
	}

	chatInfo = {
		1001:'''嗯，此事我已经明了，请先回去吧。''',
		1002:'''少侠没有带来所需物品''',
		1003:'''东西已经拿到了，回去吧。''',
		1004:'''很好很好，为师急需这个。''',
		1111:'''今天已完成了20环师门任务，继续做的师门经验会大幅减少，是否继续接任务？\nQ是\nQ否#20''',
		5001:'''污妖王，俺是主NPC，来打俺呀，打呀打呀~~\nQ不敢打#20\nQ打不羸''',
		5002:'''我就一围观群众，别打到我哟，要不我不客气。''',
		5003:'''就知道你没胆''',
		5004:'''知道自己打不羸是乖宝宝''',
		5005:'''污妖王，俺是主NPC，来打俺呀''',
	}

	branchInfo = {
		1001:(
			{"条件":0,"脚本":"L(9004,2)"},
			{"条件":10,"脚本":"L(9005,1)"},
			{"条件":20,"脚本":"L(9006,1)"},
		),
	}

	fightInfo = {
		1001:(
			{"类型":1,"名称":"$npc","造型":"1111","染色":"0,0,0,0,0","能力编号":"1001","数量":"1","技能":(1111,1112,),"阵法编号":1001},
			{"类型":0,"名称":"绑匪","造型":"1122","染色":"0,2,0,0,0","能力编号":"1002","数量":"1","技能":(5401,)},
			{"类型":0,"名称":"杀手","造型":"1111","染色":"0,0,0,0,0","能力编号":"1002","数量":"2","技能":(5401,)},
		),
		1002:(
			{"类型":1,"名称":"$npc","造型":"1111","染色":"0,0,0,0,0","能力编号":"1001","数量":"1","技能":(1111,1112,),"阵法编号":1003},
			{"类型":0,"名称":"绑匪","造型":"1122","染色":"0,0,0,0,0","能力编号":"1002","数量":"1","技能":(5401,)},
			{"类型":0,"名称":"杀手","造型":"1111","染色":"0,0,0,0,0","能力编号":"1002","数量":"2","技能":(5401,)},
			{"类型":0,"名称":"凑热闹的","造型":"1111","染色":"0,0,0,0,0","能力编号":"1001","数量":"2","技能":(5401,)},
		),
		1003:(
			{"类型":1,"名称":"男少侠","造型":"1111","染色":"0,0,0,0,0","能力编号":"1003","数量":"1","技能":(1111,),"阵法编号":1002},
			{"类型":0,"名称":"女少侠","造型":"1122","染色":"0,0,0,0,0","能力编号":"1003","数量":"1","技能":(5401,)},
		),
	}

	ableInfo = {
		1001:{"等级":"LV","生命":"B*1","真气":"B*1","物理伤害":"B*0.5","法术伤害":"B*0.5","物理防御":"B*0.4","法术防御":"B*0.4","速度":"B*0.4","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1002:{"等级":"LV+1","生命":"B*1","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.6","物理防御":"B*0.5","法术防御":"B*0.5","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1003:{"等级":"LV+2","生命":"B*1","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.6","物理防御":"B*0.5","法术防御":"B*0.5","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
	}

	lineupInfo = {
		1001:{"阵法":1,"等级":3,"阵眼":1,"被动技能":(5801,5802,5803,)},
		1002:{"阵法":2,"等级":4,"阵眼":2,"被动技能":(5801,5802,5803,)},
		1003:{"阵法":3,"等级":5},
	}

	configInfo = {
		"生成路径":"test",
	}
#导表结束

	def getBranchCondition(self, who, npcObj, branchIdx, flag):
		if flag == "lv":
			lst = [info["条件"] for info in self.getBranchInfo(branchIdx)]
			lst.sort(reverse=True)
			for lv in lst:
				if who.level >= lv:
					return lv
			
		return customTask.getBranchCondition(self, who, npcObj, branchIdx, flag)
