# -*- coding: utf-8 -*-
# import template
from activity.object import Activity as customActivity
#导表开始
class cAnswerBase(customActivity):

	rewardInfo = {
		1001:{"银币":lambda LV:4800+LV*60},
		1002:{"银币":lambda LV:8000+LV*100},
		1003:{"银币":lambda :10000},
		1004:{"物品":[1002]},
		2001:{"经验":lambda LV,N:8000+(30+N*8)*LV,"宠物经验":lambda PLV:PLV*100,"银币":lambda LV,N:500+(3+N)*LV},
		2002:{"经验":lambda LV:5600+LV*26.6,"宠物经验":lambda PLV:PLV*70,"银币":lambda LV:350+LV*2.8},
		2003:{"物品":[2001]},
		3001:{"经验":lambda LV,N:LV*(N*7+14)+4900,"宠物经验":lambda PLV:PLV*100,"银币":lambda LV,N:LV*(N*3+2)+700,"物品":[4001]},
		3002:{"物品":[3002]},
		3003:{"物品":[3003]},
		3004:{"经验":lambda LV,N:3500+(10+N*5)*LV,"宠物经验":lambda PLV:PLV*70,"银币":lambda LV,N:250+(3+N)*LV,"物品":[4001]},
		4001:{"经验":lambda LV,X:LV*49+1400+X,"宠物经验":lambda PLV,X:PLV*100+X,"银币":lambda LV,X:LV*7+1000+X,"物品":[4002]},
		4002:{"物品":[5001]},
		4003:{"物品":[5002]},
		4004:{"物品":[5003]},
		4005:{"物品":[5004]},
		4006:{"经验":lambda LV,X:LV*35+980+X,"宠物经验":lambda PLV,X:PLV*70+X,"银币":lambda LV,X:LV*5+700+X,"物品":[4002]},
	}

	rewardPropsInfo = {
		1002:(
			{"权重":100,"物品":"202024","数量":"1","绑定":0},
		),
		2001:(
			{"权重":10,"物品":"230101","数量":"1","绑定":0},
			{"权重":10,"物品":"230102","数量":"1","绑定":0},
			{"权重":10,"物品":"202024","数量":"1","绑定":0},
			{"权重":10,"物品":"202025","数量":"1","绑定":0},
			{"权重":10,"物品":"246051","数量":"1","绑定":0},
			{"权重":10,"物品":"245001","数量":"1","绑定":0},
		),
		3002:(
			{"权重":100,"物品":"203031","数量":"1","绑定":0},
		),
		3003:(
			{"权重":100,"物品":"203032","数量":"1","绑定":0},
		),
		4001:(
			{"权重":5,"物品":"202001","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202002","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202003","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202004","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202005","数量":"1","绑定":0,"传闻":0},
			{"权重":620,"物品":"202024","数量":"2","绑定":0,"传闻":0},
			{"权重":620,"物品":"202025","数量":"2","绑定":0,"传闻":0},
			{"权重":20,"物品":"202043","数量":"1","绑定":0,"传闻":0},
			{"权重":3,"物品":"202044","数量":"1","绑定":0,"传闻":0},
			{"权重":3,"物品":"202045","数量":"1","绑定":0,"传闻":0},
			{"权重":3,"物品":"230001","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":3,"物品":"202042","数量":"1","绑定":0,"传闻":0},
			{"权重":3,"物品":"202049","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"230103","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234101","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234102","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234103","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234104","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234105","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234106","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234107","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234108","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234109","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234110","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234111","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234112","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234113","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234114","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234115","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234116","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234117","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234118","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234119","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234120","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234121","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234122","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234123","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234124","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234125","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234126","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234127","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234128","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234129","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234130","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234131","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234132","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234133","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234134","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234135","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234136","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234137","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234138","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234139","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234140","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234141","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234142","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234143","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234144","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234145","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234146","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234147","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234148","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234149","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234150","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234151","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":15,"物品":"234152","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":10,"物品":"234153","数量":"1","绑定":0,"传闻":"SM2346"},
			{"权重":700,"物品":"245001","数量":"1","绑定":0,"传闻":0},
			{"权重":700,"物品":"245051","数量":"5","绑定":0,"传闻":0},
			{"权重":700,"物品":"246051","数量":"1","绑定":0,"传闻":0},
			{"权重":6000,"物品":"0","数量":"0","绑定":0,"传闻":0},
		),
		4002:(
			{"权重":5,"物品":"202001","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202002","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202003","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202004","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202005","数量":"1","绑定":0,"传闻":0},
			{"权重":500,"物品":"202024","数量":"2","绑定":0,"传闻":0},
			{"权重":500,"物品":"202025","数量":"2","绑定":0,"传闻":0},
			{"权重":18,"物品":"202043","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202044","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202045","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202042","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"202049","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"230001","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"230103","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234101","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234102","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234103","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234104","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234105","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234106","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234107","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234108","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234109","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234110","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234111","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234112","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234113","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234114","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234115","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234116","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234117","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234118","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234119","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234120","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234121","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234122","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234123","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234124","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234125","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234126","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234127","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234128","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234129","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234130","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234131","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234132","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234133","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234134","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234135","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234136","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234137","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234138","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234139","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234140","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234141","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234142","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234143","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234144","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234145","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234146","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234147","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234148","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234149","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234150","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234151","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234152","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"234153","数量":"1","绑定":0,"传闻":0},
			{"权重":500,"物品":"245001","数量":"1","绑定":0,"传闻":0},
			{"权重":500,"物品":"245051","数量":"5","绑定":0,"传闻":0},
			{"权重":500,"物品":"246051","数量":"1","绑定":0,"传闻":0},
			{"权重":7000,"物品":"0","数量":"0","绑定":0,"传闻":0},
		),
		5001:(
			{"权重":1000,"物品":"200001","数量":"500000","绑定":0,"传闻":0},
		),
		5002:(
			{"权重":1000,"物品":"200001","数量":"300000","绑定":0,"传闻":0},
		),
		5003:(
			{"权重":1000,"物品":"200001","数量":"200000","绑定":0,"传闻":0},
		),
		5004:(
			{"权重":1000,"物品":"200001","数量":"100000","绑定":0,"传闻":0},
		),
	}

	configInfo = {
		1001:10,
		1002:3,
		2001:20,
		2002:20,
		2003:203031,
		2004:203032,
		3001:20,
		3002:20,
	}

	chatInfo = {
		2301:'''限时抢答开始了，请点击抢答按钮参与抢答''',
		2302:'''答案提交成功，倒计时结束后将公布正确答案''',
		2303:'''本次抢答已结束''',
		2304:'''恭喜你回答正确，你将获得大量经验和银币奖励！''',
		2305:'''回答错误，你将获得少量经验和银币作为安慰奖''',
		2306:'''你取得了本次抢答第一名的宝座''',
		2307:'''你被选为本次抢答的幸运玩家，将获得幸运大奖一份''',
		2308:'''回答正确！''',
		2309:'''回答错误！''',
		2310:'''你已答完所有题目，请明天再来''',
		2311:'''每日答题已结束！''',
		2312:'''您今日求助次数已达三次，无法继续求助仙盟''',
		2321:'''初试答题只允许单人进行！''',
		2322:'''答题中不可进行组队操作！''',
		2323:'''目标正在天问答题中，不可邀请组队''',
		2324:'''请选择你擅长的科目类别''',
		2325:'''你选择了#C02$kemu#n作为初试科目，天问初试正式开始！''',
		2326:'''本周的天问初试答题已结束，请下周继续努力！''',
		2327:'''你已经完成#C02第$number题#n的初试答题，目前共耗时#C02$time#n，排名为#C02$rank#n，请前往下一名考官处继续答题吧！''',
		2328:'''你已完成本周天问初试的所有答题，目前共耗时#C02$time#n，排名为#C02$rank#n，请关注#C0220:00#n的#C02金章之试#n名单公布！''',
		2329:'''你已完成本周天问初试的所有答题，由于已过名单截取时间您无法获取金章之试资格，请下周继续努力！''',
		2330:'''回答错误，耗时增加#C0220秒#n''',
		2331:'''回答正确！''',
		2332:'''战斗胜利，本次答题视为回答正确！''',
		2333:'''战斗失败，本次答题视为回答错误，耗时增加#C0220秒#n，请重新作答！''',
		2334:'''你已连续答对五道题目，获得了一个#C02$lnkProps#n''',
		2335:'''使用#C02$item#n成功，战斗胜利将通过该题目。''',
		2336:'''使用#C02$item#n成功，已随机去掉一个错误选项''',
		2337:'''你已连续答对十道题目，获得了一个#C02$lnkProps#n''',
		2338:'''金章之试已开始，请尽快答题争取好名次！''',
		2339:'''回答正确！''',
		2340:'''回答错误，计时增加#C0220秒#n！''',
		2341:'''你已回答完所有的金章之试题目，耗时#C02$time#n，请关注#C0222:30#n的结果公布''',
		2342:'''你未在#C0222:00#n之前完成所有的金章之试答题，耗时#C02$time#n，请关注#C0222:30#n的结果公布''',
		2343:'''金章之试答题已结束！''',
		2344:'''你成功的对#C01$roleName#n献出#C02$number#n朵鲜花''',
		2345:'''你对#C01$roleName#n献花已达#C0499朵#n，无法继续献花''',
		2346:'''#C01$roleName#n在#L1<14,17>*[天问初试]*02#n答题中文思敏捷，获得了考官赠予的$lnkProps''',
		2347:'''#C02$item#n每题只能使用一次''',
		2348:'''金章之试献花时间为#C02周六20:00-21:00#n，当前不是献花时间''',
		2349:'''对同一名玩家献花累计不可超过#C0499朵#n，你成功的对#C01$roleName#n献出了#C02$number朵#n献花''',
		2350:'''#L1<14,18>*[金章之试]*02#n名单已出炉，入试者将会通过#C04邮件#n告知#42''',
		2351:'''你已经完成#C02第$number题#n的初试答题，请前往下一名考官处继续答题吧''',
	}

	questionTypeInfo = {
		"类型":"类型名称",
		1:"天文地理",
		2:"文学典故",
		3:"茶酒药膳",
		4:"宗教神话",
		5:"四方杂学",
		6:"仙踪风物",
	}

	npcInfo = {
		1001:{"名称":"考官一","造型":"4006(0,1,0,0,0,0,0)","位置":"1030,95,53,4","称谓":"天问初试考官"},
		1002:{"名称":"考官二","造型":"4006(0,1,0,0,0,0,0)","位置":"1030,98,27,8","称谓":"天问初试考官"},
		1003:{"名称":"考官三","造型":"4006(0,1,0,0,0,0,0)","位置":"1030,47,35,2","称谓":"天问初试考官"},
		1004:{"名称":"考官四","造型":"4006(0,1,0,0,0,0,0)","位置":"2040,22,29,4","称谓":"天问初试考官"},
		1005:{"名称":"考官五","造型":"4006(0,1,0,0,0,0,0)","位置":"2040,58,19,6","称谓":"天问初试考官"},
		1006:{"名称":"考官六","造型":"4006(0,1,0,0,0,0,0)","位置":"2040,94,53,6","称谓":"天问初试考官"},
		1007:{"名称":"考官七","造型":"4006(0,1,0,0,0,0,0)","位置":"2030,15,84,6","称谓":"天问初试考官"},
		1008:{"名称":"考官八","造型":"4006(0,1,0,0,0,0,0)","位置":"2030,66,73,8","称谓":"天问初试考官"},
		1009:{"名称":"考官九","造型":"4006(0,1,0,0,0,0,0)","位置":"2030,12,30,2","称谓":"天问初试考官"},
		1010:{"名称":"考官十","造型":"4006(0,1,0,0,0,0,0)","位置":"1140,16,64,4","称谓":"天问初试考官"},
		1011:{"名称":"考官十一","造型":"4006(0,1,0,0,0,0,0)","位置":"1140,53,8,2","称谓":"天问初试考官"},
		1012:{"名称":"考官十二","造型":"4006(0,1,0,0,0,0,0)","位置":"1140,60,64,6","称谓":"天问初试考官"},
		1013:{"名称":"考官十三","造型":"4006(0,1,0,0,0,0,0)","位置":"1040,39,19,6","称谓":"天问初试考官"},
		1014:{"名称":"考官十四","造型":"4006(0,1,0,0,0,0,0)","位置":"1040,12,30,6","称谓":"天问初试考官"},
		1015:{"名称":"考官十五","造型":"4006(0,1,0,0,0,0,0)","位置":"1040,66,36,6","称谓":"天问初试考官"},
		1016:{"名称":"考官十六","造型":"4006(0,1,0,0,0,0,0)","位置":"1060,53,14,8","称谓":"天问初试考官"},
		1017:{"名称":"考官十七","造型":"4006(0,1,0,0,0,0,0)","位置":"1060,32,27,6","称谓":"天问初试考官"},
		1018:{"名称":"考官十八","造型":"4006(0,1,0,0,0,0,0)","位置":"1060,73,45,4","称谓":"天问初试考官"},
		1019:{"名称":"考官十九","造型":"4006(0,1,0,0,0,0,0)","位置":"1130,158,71,4","称谓":"天问初试考官"},
		1020:{"名称":"考官二十","造型":"4006(0,1,0,0,0,0,0)","位置":"1130,49,90,4","称谓":"天问初试考官"},
		1021:{"名称":"谢山","造型":"4504(0,1,0,0,0,0,0)","位置":"1030,103,49,8","称谓":"金章之试考官"},
	}
#导表结束

	# def __init__(self, name):
	# 	template.Template.__init__(self)
	# 	self._name = name

	def answerLog(self, sDir="answer", sLog=""):
		log.log("answer/{}".format(sDir), sLog)
		# print sLog

	def getQuestionConfig(self, iNo, sKey='', default=None):
		if iNo not in QuestionData.gdData:
			raise Exception,"答题题库{}编号问题不存在".format(iNo)
		if not sKey:
			return QuestionData.gdData[iNo]
		return QuestionData.gdData[iNo].get(sKey, default)

	# @property
	# def logName(self):
	# 	return "answer/%s"%self._name

	# @property
	# def name(self):
	# 	return self._name

	def rightAnswer(self, iNo):
		return self.getQuestionConfig(iNo, "正确答案", "")

	def isRightAnswer(self, iNo, sResult):
		'''是否为正解答案
		'''
		return self.rightAnswer(iNo) == sResult

	# def newWeekAnswerNpcByIdx(self, npcIdx, who=None):
	# 	'''周答题的固定NPC
	# 	'''
	# 	info = copy.deepcopy(self.getNpcInfo(npcIdx))
	# 	if not info:
	# 		raise Exception, "周答题找不到编号为{}的固定npc".format(npcIdx)

	# 	info = self.transNpcInfo(npcIdx, info, who)
	# 	name = info["名称"]
	# 	shape = info["造型"]
	# 	shapeParts = info["造型部位"]

	# 	npcObj = self.newNpc(npcIdx, name, shape, who)
	# 	npcObj.idx = npcIdx
	# 	npcObj.name = name
	# 	shape, shapeParts = template.transShapeStr(info["造型"])
	# 	npcObj.shape = shape
	# 	npcObj.shapeParts = shapeParts
	# 	if info.get("染色"):
	# 		colors = template.transColorsStr(info["染色"])
	# 		npcObj.colors = colors
	# 	npcObj.title = info.get("称号", "")
	# 	if info.get("职业"):
	# 		npcObj.school = info["职业"]
	# 	if info.get("动作"):
	# 		npcObj.action = info["动作"]

	# 	sceneId, x, y, d = info["位置"]
	# 	npcObj.sceneId = self.transSceneId(sceneId)
	# 	if x == 0 or y == 0:
	# 		x, y = scene.randSpace(sceneId)
	# 	if d == 0:
	# 		d = template.NpcDirList[rand(len(template.NpcDirList))]
	# 	npcObj.x = x
	# 	npcObj.y = y
	# 	npcObj.d = d
	# 	return npcObj

	def onLogin(self, who, bRelogin):
		self.setEndAnswer(who)

	def setStartAnswer(self, who):
		'''开始答题，作标志不能组队
		'''
		if getattr(who, "answerExam", False):
			return
		who.answerExam = True
		#取消匹配
		team.platformservice.cancelAutoMatch(who)

		#设置不能组队
		who.denyTeam["answerExam"] = "答题"

	def setEndAnswer(self, who):
		who.answerExam = False
		who.denyTeam.pop("answerExam", None)


from common import *
from answer.defines import *
import QuestionData
import log
import scene
import copy
import team.platformservice