编号	内容_S
1001	少侠们，有僵尸啊！快救救我！
1002	呜~ 嘶~ 嗷~ 呱~
	救下村民
1003	妖物速速受死！
1004	哇……（僵尸灰飞烟灭）\t*A*nA**SS*$S2S$我们调查僵尸们来的足迹应该能有所收获
1005	啊……（村民晕倒）\t*A*nA**SS*$S2S$哎呀，村民被我们误伤晕倒了。
1006	你们为什么在这里？你们为什么打伤我大爷？！\t*A*nA**SS*$S2S$不是的，我们是来救他的，你们误会了\t*A愤怒的村民A**S1111S*$S1S$这些外来人肯定不是什么好人，抓他们去官府
1007	你们还想反抗吗？
	冷静一下
1008	他们好强！\t*A*nA**SS*$S2S$你们听我们解释吧，是我们不小心伤到的。治疗一下应该没什么大碍了，是我们疏忽了。\t*A村民A**S1111S*$S1S$麻烦诸位少侠了，是我们鲁莽了。\t*A*nA**SS*$S2S$我们调查僵尸们来的足迹应该能有所收获
1009	呵呵，居然有羊自己跑上门来的
	你才是羊
1010	你们竟敢破坏师尊的计划，是不是活得不耐烦了
1011	可恶的多管闲事之人，你们会付出代价的。
	开打
1012	别打了，我告诉你们师尊在哪里。！\t*A*nA**SS*$S2S$赶紧带路，饶你狗命！（走到桥头）\t*A赤尸童子A**S1111S*$S1S$师傅！快救我，他们威胁我来找你。\t*A*nA**SS*$S2S$你就是幕后黑手？\t*A赤尸神君A**S1111S*$S1S$你们很大胆，不过你们居然能找到这里来，很不错
1013	你们居然能找到这里来，不错
1014	不过你们敢打乱老夫的计划，你们死到临头了
	开打
1015	你们打伤了大爷，不要跑
1016	居然被黄毛小儿重伤，真是丢脸，先暂时撤退吧。我会再回来的！
6003	#C01$roleName#n为村民们除去了#L1<14,16>*[竹林妖魔]*02#n，获得了村民们赠予的$lnkProps
2001	狂暴
2002	血炼大法
