#-*-coding:utf-8-*-
#作者:马昭@曹县闫店楼镇
def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'不存在编号为{}的门'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)

#导表开始
gdData={
	10101:{"造型":1001,"场景编号":1010,"传送点x":10,"传送点y":112,"感应点":(14,108,),"目标场景编号":1040,"目标x":21,"目标y":13,"面向":1,"目标场景名称":"青螺竹林"},
	10102:{"造型":1001,"场景编号":1010,"传送点x":9,"传送点y":10,"感应点":(13,14,),"目标场景编号":1070,"目标x":45,"目标y":23,"面向":1,"目标场景名称":"凝碧崖"},
	10103:{"造型":1001,"场景编号":1010,"传送点x":84,"传送点y":74,"感应点":(81,76,),"目标场景编号":2020,"目标x":37,"目标y":76,"面向":1,"目标场景名称":"太元洞"},
	10201:{"造型":1001,"场景编号":1020,"传送点x":8,"传送点y":13,"感应点":(11,16,),"目标场景编号":1060,"目标x":85,"目标y":6,"面向":1,"目标场景名称":"锁妖塔外"},
	10301:{"造型":1001,"场景编号":1030,"传送点x":10,"传送点y":7,"感应点":(13,10,),"目标场景编号":1070,"目标x":45,"目标y":23,"面向":6,"目标场景名称":"凝碧崖"},
	10302:{"造型":1001,"场景编号":1030,"传送点x":114,"传送点y":24,"感应点":(110,27,),"目标场景编号":2040,"目标x":18,"目标y":65,"面向":4,"目标场景名称":"莽苍山"},
	10303:{"造型":1001,"场景编号":1030,"传送点x":111,"传送点y":60,"感应点":(107,56,),"目标场景编号":1130,"目标x":11,"目标y":16,"面向":2,"目标场景名称":"天墉城"},
	10401:{"造型":1001,"场景编号":1040,"传送点x":77,"传送点y":43,"感应点":(75,41,),"目标场景编号":1140,"目标x":25,"目标y":5,"面向":4,"目标场景名称":"峨眉山"},
	10501:{"造型":1001,"场景编号":1050,"传送点x":10,"传送点y":112,"感应点":(14,108,),"目标场景编号":1040,"目标x":21,"目标y":13,"面向":1,"目标场景名称":"青螺竹林"},
	10502:{"造型":1001,"场景编号":1050,"传送点x":9,"传送点y":10,"感应点":(13,14,),"目标场景编号":1070,"目标x":45,"目标y":23,"面向":1,"目标场景名称":"凝碧崖"},
	10503:{"造型":1001,"场景编号":1050,"传送点x":84,"传送点y":74,"感应点":(81,76,),"目标场景编号":2020,"目标x":37,"目标y":76,"面向":1,"目标场景名称":"太元洞"},
	10601:{"造型":1001,"场景编号":1060,"传送点x":89,"传送点y":4,"感应点":(85,6,),"目标场景编号":1140,"目标x":14,"目标y":68,"面向":2,"目标场景名称":"峨眉山"},
	10602:{"造型":1001,"场景编号":1060,"传送点x":25,"传送点y":32,"感应点":(30,29,),"目标场景编号":2010,"目标x":109,"目标y":17,"面向":8,"目标场景名称":"锁妖塔内"},
	10701:{"造型":1001,"场景编号":1070,"传送点x":49,"传送点y":23,"感应点":(45,23,),"目标场景编号":1030,"目标x":13,"目标y":10,"面向":2,"目标场景名称":"云顶村"},
	10801:{"造型":1001,"场景编号":1080,"传送点x":10,"传送点y":112,"感应点":(14,108,),"目标场景编号":1040,"目标x":21,"目标y":13,"面向":1,"目标场景名称":"青螺竹林"},
	10802:{"造型":1001,"场景编号":1080,"传送点x":9,"传送点y":10,"感应点":(13,14,),"目标场景编号":1070,"目标x":45,"目标y":23,"面向":1,"目标场景名称":"凝碧崖"},
	10803:{"造型":1001,"场景编号":1080,"传送点x":84,"传送点y":74,"感应点":(81,76,),"目标场景编号":2020,"目标x":37,"目标y":76,"面向":1,"目标场景名称":"太元洞"},
	10901:{"造型":1001,"场景编号":1090,"传送点x":10,"传送点y":112,"感应点":(14,108,),"目标场景编号":1040,"目标x":21,"目标y":13,"面向":1,"目标场景名称":"青螺竹林"},
	10902:{"造型":1001,"场景编号":1090,"传送点x":9,"传送点y":10,"感应点":(13,14,),"目标场景编号":1070,"目标x":45,"目标y":23,"面向":1,"目标场景名称":"凝碧崖"},
	10903:{"造型":1001,"场景编号":1090,"传送点x":84,"传送点y":74,"感应点":(81,76,),"目标场景编号":2020,"目标x":37,"目标y":76,"面向":1,"目标场景名称":"太元洞"},
	11001:{"造型":1001,"场景编号":1100,"传送点x":10,"传送点y":112,"感应点":(14,108,),"目标场景编号":1040,"目标x":21,"目标y":13,"面向":1,"目标场景名称":"青螺竹林"},
	11002:{"造型":1001,"场景编号":1100,"传送点x":9,"传送点y":10,"感应点":(13,14,),"目标场景编号":1070,"目标x":45,"目标y":23,"面向":1,"目标场景名称":"凝碧崖"},
	11003:{"造型":1001,"场景编号":1100,"传送点x":84,"传送点y":74,"感应点":(81,76,),"目标场景编号":2020,"目标x":37,"目标y":76,"面向":1,"目标场景名称":"太元洞"},
	11101:{"造型":1001,"场景编号":1110,"传送点x":10,"传送点y":112,"感应点":(14,108,),"目标场景编号":1040,"目标x":21,"目标y":13,"面向":1,"目标场景名称":"青螺竹林"},
	11102:{"造型":1001,"场景编号":1110,"传送点x":9,"传送点y":10,"感应点":(13,14,),"目标场景编号":1070,"目标x":45,"目标y":23,"面向":1,"目标场景名称":"凝碧崖"},
	11103:{"造型":1001,"场景编号":1110,"传送点x":84,"传送点y":74,"感应点":(81,76,),"目标场景编号":2020,"目标x":37,"目标y":76,"面向":1,"目标场景名称":"太元洞"},
	11201:{"造型":1001,"场景编号":1120,"传送点x":10,"传送点y":112,"感应点":(14,108,),"目标场景编号":1040,"目标x":21,"目标y":13,"面向":1,"目标场景名称":"青螺竹林"},
	11202:{"造型":1001,"场景编号":1120,"传送点x":9,"传送点y":10,"感应点":(13,14,),"目标场景编号":1070,"目标x":45,"目标y":23,"面向":1,"目标场景名称":"凝碧崖"},
	11203:{"造型":1001,"场景编号":1120,"传送点x":84,"传送点y":74,"感应点":(81,76,),"目标场景编号":2020,"目标x":37,"目标y":76,"面向":1,"目标场景名称":"太元洞"},
	11301:{"造型":1001,"场景编号":1130,"传送点x":3,"传送点y":110,"感应点":(12,106,),"目标场景编号":1140,"目标x":64,"目标y":65,"面向":7,"目标场景名称":"峨眉山"},
	11302:{"造型":1001,"场景编号":1130,"传送点x":8,"传送点y":13,"感应点":(11,16,),"目标场景编号":1030,"目标x":107,"目标y":56,"面向":6,"目标场景名称":"云顶村"},
	11303:{"造型":1001,"场景编号":1130,"传送点x":188,"传送点y":19,"感应点":(184,21,),"目标场景编号":1150,"目标x":9,"目标y":63,"面向":4,"目标场景名称":"姑苏"},
	11401:{"造型":1001,"场景编号":1140,"传送点x":10,"传送点y":70,"感应点":(14,68,),"目标场景编号":1060,"目标x":85,"目标y":6,"面向":8,"目标场景名称":"锁妖塔外"},
	11402:{"造型":1001,"场景编号":1140,"传送点x":68,"传送点y":66,"感应点":(64,65,),"目标场景编号":1130,"目标x":12,"目标y":106,"面向":4,"目标场景名称":"天墉城"},
	11403:{"造型":1001,"场景编号":1140,"传送点x":21,"传送点y":3,"感应点":(25,5,),"目标场景编号":1040,"目标x":75,"目标y":41,"面向":6,"目标场景名称":"青螺竹林"},
	11501:{"造型":1001,"场景编号":1150,"传送点x":8,"传送点y":64,"感应点":(10,66,),"目标场景编号":1130,"目标x":185,"目标y":20,"面向":8,"目标场景名称":"天墉城"},
	11502:{"造型":1001,"场景编号":1150,"传送点x":58,"传送点y":3,"感应点":(60,5,),"目标场景编号":2030,"目标x":81,"目标y":16,"面向":8,"目标场景名称":"凌云大佛"},
	20101:{"造型":1001,"场景编号":2010,"传送点x":114,"传送点y":14,"感应点":(109,17,),"目标场景编号":1060,"目标x":30,"目标y":29,"面向":4,"目标场景名称":"锁妖塔外"},
	20102:{"造型":1001,"场景编号":2010,"传送点x":16,"传送点y":64,"感应点":(22,59,),"目标场景编号":2011,"目标x":109,"目标y":17,"面向":8,"目标场景名称":"锁妖塔一层"},
	20111:{"造型":1001,"场景编号":2011,"传送点x":114,"传送点y":14,"感应点":(109,17,),"目标场景编号":2010,"目标x":22,"目标y":59,"面向":4,"目标场景名称":"锁妖塔内"},
	20201:{"造型":1001,"场景编号":2020,"传送点x":31,"传送点y":79,"感应点":(37,76,),"目标场景编号":1040,"目标x":21,"目标y":13,"面向":1,"目标场景名称":"青螺竹林"},
	20202:{"造型":1001,"场景编号":2020,"传送点x":78,"传送点y":83,"感应点":(75,81,),"目标场景编号":1130,"目标x":14,"目标y":108,"面向":1,"目标场景名称":"天墉城"},
	20203:{"造型":1001,"场景编号":2020,"传送点x":104,"传送点y":68,"感应点":(101,66,),"目标场景编号":2040,"目标x":18,"目标y":65,"面向":1,"目标场景名称":"莽苍山"},
	20301:{"造型":1001,"场景编号":2030,"传送点x":7,"传送点y":108,"感应点":(13,105,),"目标场景编号":1130,"目标x":163,"目标y":110,"面向":4,"目标场景名称":"天墉城"},
	20302:{"造型":1001,"场景编号":2030,"传送点x":83,"传送点y":16,"感应点":(77,19,),"目标场景编号":1150,"目标x":60,"目标y":4,"面向":2,"目标场景名称":"姑苏"},
	20401:{"造型":1001,"场景编号":2040,"传送点x":14,"传送点y":69,"感应点":(18,65,),"目标场景编号":1030,"目标x":110,"目标y":27,"面向":8,"目标场景名称":"云顶村"},
}
#导表结束

import u
import door

def afterHotUpdate():
	door.init()#重新建立编号与模块的映射关系