# -*- coding: utf-8 -*-

def getLineupData(lineupId):
	if lineupId not in lineupList:
		raise PlannerError("找不到编号为%s的阵法" % lineupId)
	return lineupList[lineupId]

def getExpNext(level):
	'''下级经验
	'''
	return upgradeList[level]["经验"]

def getExpByProps(lineupId, propsNo):
	'''道具对应的经验
	''' 
	if propsNo in expPropsList:
		if propsNo == lineupList[lineupId]["学习道具"]:
			return expPropsList[propsNo]["同名经验"]
		return expPropsList[propsNo]["经验"]
	return 0

def getEffectList(lineupId, pos):
	'''阵法位置对应的效果
	'''
	posName = "位置%s" % pos
	return effectList[lineupId].get(posName, {})

def getEffectRatio(level):
	'''获取效果系数
	'''
	return effectRatioList[level]["系数"]

def getLineupEyeData(eyeNo):
	'''阵眼数据
	'''
	return lineupEyeList[eyeNo]

def getSkillList(sKey):
	return skillList[sKey]

#导表开始
lineupList={
	1:{"名称":"甲木微尘阵","学习道具":224001},
	2:{"名称":"乙木奇门阵","学习道具":224009},
	3:{"名称":"丙火都天阵","学习道具":224002},
	4:{"名称":"丁火化血阵","学习道具":224005},
	5:{"名称":"戊土九宫阵","学习道具":224008},
	6:{"名称":"己土元磁阵","学习道具":224004},
	7:{"名称":"庚金天地阵","学习道具":224003},
	8:{"名称":"辛金伏魔阵","学习道具":224010},
	9:{"名称":"壬水八卦阵","学习道具":224007},
	10:{"名称":"癸水天魔阵","学习道具":224006},
}

effectList={
	1:{"位置1":{"被物理伤害结果加成":-15,"被法术伤害结果加成":-15,},"位置2":{"速度加成":15,},"位置3":{"速度加成":15,},"位置4":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,},"位置5":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,}},
	2:{"位置1":{"速度加成":15,},"位置2":{"速度加成":15,},"位置3":{"速度加成":15,},"位置4":{"速度加成":15,},"位置5":{"速度加成":15,}},
	3:{"位置1":{"物理伤害结果加成":20,"法术伤害结果加成":20,"治疗结果加成":20,},"位置2":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,},"位置3":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,},"位置4":{"速度加成":10,},"位置5":{"速度加成":10,}},
	4:{"位置1":{"物理伤害结果加成":20,"法术伤害结果加成":20,"治疗结果加成":20,"速度加成":-20,},"位置2":{"物理伤害结果加成":20,"法术伤害结果加成":20,"治疗结果加成":20,"速度加成":-20,},"位置3":{"物理伤害结果加成":20,"法术伤害结果加成":20,"治疗结果加成":20,"速度加成":-20,},"位置4":{"物理伤害结果加成":20,"法术伤害结果加成":20,"治疗结果加成":20,"速度加成":-20,},"位置5":{"物理伤害结果加成":20,"法术伤害结果加成":20,"治疗结果加成":20,"速度加成":-20,}},
	5:{"位置1":{"被法术伤害结果加成":-20,},"位置2":{"被法术伤害结果加成":-20,},"位置3":{"被法术伤害结果加成":-20,},"位置4":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,},"位置5":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,}},
	6:{"位置1":{"被物理伤害结果加成":-15,"被法术伤害结果加成":-15,},"位置2":{"被物理伤害结果加成":-15,"被法术伤害结果加成":-15,},"位置3":{"被物理伤害结果加成":-15,"被法术伤害结果加成":-15,},"位置4":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,},"位置5":{"速度加成":15,}},
	7:{"位置1":{"抵抗封印":15,},"位置2":{"抵抗封印":15,},"位置3":{"抵抗封印":15,},"位置4":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,},"位置5":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,}},
	8:{"位置1":{"被物理伤害结果加成":-40,"被法术伤害结果加成":-40,"速度加成":-30,},"位置2":{"物理伤害结果加成":15,"法术伤害结果加成":15,"治疗结果加成":15,},"位置3":{"物理伤害结果加成":15,"法术伤害结果加成":15,"治疗结果加成":15,},"位置4":{"速度加成":10,},"位置5":{"速度加成":10,}},
	9:{"位置1":{"物理伤害结果加成":25,"法术伤害结果加成":25,"治疗结果加成":25,},"位置2":{"被物理伤害结果加成":-10,"被法术伤害结果加成":-10,},"位置3":{"被物理伤害结果加成":-10,"被法术伤害结果加成":-10,},"位置4":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,},"位置5":{"物理伤害结果加成":10,"法术伤害结果加成":10,"治疗结果加成":10,}},
	10:{"位置1":{"被法术伤害结果加成":-20,},"位置2":{"速度加成":15,},"位置3":{"法术伤害结果加成":30,"速度加成":-30,},"位置4":{"物理伤害结果加成":20,},"位置5":{"被物理伤害结果加成":-20,}},
}

effectRatioList={
	1:{"系数":0.6},
	2:{"系数":0.7},
	3:{"系数":0.8},
	4:{"系数":0.9},
	5:{"系数":1},
}

lineupEyeList={
	1:{"名称":"甲木微尘阵眼","阵眼图标":1001,"造型":"7002(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224104:3,224108:1},"主动技编号":5718,"被动技编号":(5801,),"物品":200020},
	2:{"名称":"乙木奇门阵眼","阵眼图标":1002,"造型":"7002(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224104:3,224108:1},"主动技编号":5720,"被动技编号":(5802,),"物品":200021},
	3:{"名称":"丙火都天阵眼","阵眼图标":1003,"造型":"7003(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224106:3,224108:1},"主动技编号":5717,"被动技编号":(5803,),"物品":200022},
	4:{"名称":"丁火化血阵眼","阵眼图标":1004,"造型":"7003(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224106:3,224108:1},"主动技编号":5701,"被动技编号":(5804,),"物品":200023},
	5:{"名称":"戊土九宫阵眼","阵眼图标":1005,"造型":"7002(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224107:3,224108:1},"主动技编号":5710,"被动技编号":(5805,),"物品":200024},
	6:{"名称":"己土元磁阵眼","阵眼图标":1001,"造型":"7002(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224107:3,224108:1},"主动技编号":5707,"被动技编号":(5806,),"物品":200025},
	7:{"名称":"庚金天地阵眼","阵眼图标":1002,"造型":"7002(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224103:3,224108:1},"主动技编号":5708,"被动技编号":(5807,),"物品":200026},
	8:{"名称":"辛金伏魔阵眼","阵眼图标":1003,"造型":"7002(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224103:3,224108:1},"主动技编号":5716,"被动技编号":(5808,),"物品":200027},
	9:{"名称":"壬水八卦阵眼","阵眼图标":1004,"造型":"7001(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224105:3,224108:1},"主动技编号":5719,"被动技编号":(5809,),"物品":200028},
	10:{"名称":"癸水天魔阵眼","阵眼图标":1005,"造型":"7001(0,1,0,0,0,0,0)","染色":(0,0,0,0,0,0),"初始速度系数":63,"刷新道具":{224105:3,224108:1},"主动技编号":5709,"被动技编号":(5810,),"物品":200029},
}

upgradeList={
	1:{"经验":1000},
	2:{"经验":1000},
	3:{"经验":4000},
	4:{"经验":15000},
	5:{"经验":30000},
}

expPropsList={
	224001:{"经验":600,"同名经验":1000},
	224002:{"经验":600,"同名经验":1000},
	224003:{"经验":600,"同名经验":1000},
	224004:{"经验":600,"同名经验":1000},
	224005:{"经验":600,"同名经验":1000},
	224006:{"经验":600,"同名经验":1000},
	224007:{"经验":600,"同名经验":1000},
	224008:{"经验":600,"同名经验":1000},
	224009:{"经验":600,"同名经验":1000},
	224010:{"经验":600,"同名经验":1000},
	224101:{"经验":120,"同名经验":0},
}

skillList={
	"普通被动技库":[5801,5802,5803,5804,5805,5806,5807,5808,5809,5810,5811,5812,5813,5814,5815,5816,5817,5818,5819,5820,5821,5822,5823,5824,5825,5841,5842,5843,5844,5845,5846,5847,5848,5849,5850,5851,5852,5853,5854,5855,5856,5857,5858,5859,5860,5861,5862,5863,5864,5865],
	"变星被动技库":[5881,5882,5883,5884,5885,5886,5887,5888,5889,5890,5891],
}
#导表结束