#-*-coding:utf-8-*-
#作者:马昭@曹县闫店楼镇
#导表开始
gdData={
	1:{"商品id":202061,"商品名称":"银币袋子","权重":117,"种类":1,"每周限购":-1,"原价":100,"折扣":100},
	2:{"商品id":202062,"商品名称":"元宝袋子","权重":116,"种类":1,"每周限购":-1,"原价":100,"折扣":100},
	3:{"商品id":234904,"商品名称":"秘籍·拓本","权重":115,"种类":1,"每周限购":20,"原价":108,"折扣":100},
	4:{"商品id":224102,"商品名称":"阵法秘籍","权重":114,"种类":1,"每周限购":10,"原价":100,"折扣":100},
	5:{"商品id":202001,"商品名称":"青龙珠","权重":113,"种类":1,"每周限购":-1,"原价":80,"折扣":100},
	6:{"商品id":202002,"商品名称":"赤龙珠","权重":112,"种类":1,"每周限购":-1,"原价":80,"折扣":100},
	7:{"商品id":202003,"商品名称":"金龙珠","权重":111,"种类":1,"每周限购":-1,"原价":80,"折扣":100},
	8:{"商品id":202004,"商品名称":"黑龙珠","权重":110,"种类":1,"每周限购":-1,"原价":80,"折扣":100},
	9:{"商品id":202005,"商品名称":"黄龙珠","权重":109,"种类":1,"每周限购":-1,"原价":80,"折扣":100,"生效日期":(2016,9,20)},
	10:{"商品id":202011,"商品名称":"六御涤魂丹","权重":108,"种类":1,"每周限购":-1,"原价":6000,"折扣":100},
	11:{"商品id":202012,"商品名称":"昊天锻体丹","权重":107,"种类":1,"每周限购":-1,"原价":25,"折扣":100},
	12:{"商品id":202013,"商品名称":"后土承坤丹","权重":106,"种类":1,"每周限购":-1,"原价":25,"折扣":100},
	13:{"商品id":202014,"商品名称":"青玄益气丹","权重":105,"种类":1,"每周限购":-1,"原价":25,"折扣":100},
	14:{"商品id":202015,"商品名称":"勾陈蕴灵丹","权重":104,"种类":1,"每周限购":-1,"原价":25,"折扣":100},
	15:{"商品id":202016,"商品名称":"长生洞幽丹","权重":103,"种类":1,"每周限购":-1,"原价":25,"折扣":100},
	16:{"商品id":202017,"商品名称":"紫薇御风丹","权重":102,"种类":1,"每周限购":-1,"原价":25,"折扣":100,"生效日期":(2016,9,22),"失效日期":(2016,10,1)},
	17:{"商品id":230201,"商品名称":"天璇灵甲","权重":101,"种类":1,"每周限购":-1,"原价":1000,"折扣":100},
	18:{"商品id":202031,"商品名称":"玫瑰花","权重":209,"种类":2,"每周限购":-1,"原价":100,"折扣":100},
	19:{"商品id":202032,"商品名称":"金兰花","权重":208,"种类":2,"每周限购":-1,"原价":100,"折扣":100},
	20:{"商品id":202033,"商品名称":"同心结","权重":207,"种类":2,"每周限购":-1,"原价":50,"折扣":100},
	22:{"商品id":202044,"商品名称":"虹彩珠","权重":205,"种类":2,"每周限购":-1,"原价":50,"折扣":100},
	23:{"商品id":202045,"商品名称":"彩云晶","权重":204,"种类":2,"每周限购":-1,"原价":50,"折扣":100},
	24:{"商品id":202042,"商品名称":"云来石","权重":203,"种类":2,"每周限购":-1,"原价":50,"折扣":100},
	25:{"商品id":202049,"商品名称":"幻武丹","权重":202,"种类":2,"每周限购":-1,"原价":50,"折扣":100},
	26:{"商品id":202041,"商品名称":"易名符","权重":201,"种类":2,"每周限购":-1,"原价":600,"折扣":100},
	27:{"商品id":202061,"商品名称":"银币袋子","权重":303,"种类":3,"每周限购":1,"原价":100,"折扣":80},
	28:{"商品id":202062,"商品名称":"元宝袋子","权重":302,"种类":3,"每周限购":1,"原价":100,"折扣":80},
	29:{"商品id":234904,"商品名称":"秘籍·拓本","权重":301,"种类":3,"每周限购":1,"原价":108,"折扣":80},
}
#导表结束

def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'没有编号为{}的商城道具'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)

def afterHotUpdate():
	import shop.mall
	shop.mall.init()
