#-*-coding:utf-8-*-
#作者:马昭@曹县闫店楼镇
#导表开始
gdData={
	200004:(
		{"积分名称":"门派","商品序号":10101,"商品编号":230001,"商品名称":"固元灵胶","出现等级":0,"商品价格":400,"每周限购":-1,"购买绑定":1},
		{"商品序号":10102,"商品编号":230101,"商品名称":"脱胎散","出现等级":0,"商品价格":40,"每周限购":-1,"购买绑定":1},
		{"商品序号":10103,"商品编号":230102,"商品名称":"锁骨丹","出现等级":0,"商品价格":20,"每周限购":-1,"购买绑定":1},
		{"商品序号":10104,"商品编号":230103,"商品名称":"洗髓液","出现等级":0,"商品价格":200,"每周限购":-1,"购买绑定":1},
		{"商品序号":10105,"商品编号":246051,"商品名称":"宝石袋·小","出现等级":0,"商品价格":20,"每周限购":-1,"购买绑定":1},
	),
	200005:(
		{"积分名称":"降魔","商品序号":10201,"商品编号":224001,"商品名称":"甲木微尘阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10202,"商品编号":224002,"商品名称":"丙火都天阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10203,"商品编号":224003,"商品名称":"庚金天地阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10204,"商品编号":224004,"商品名称":"己土元磁阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10205,"商品编号":224005,"商品名称":"丁火化血阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10206,"商品编号":224006,"商品名称":"癸水天魔阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10207,"商品编号":224007,"商品名称":"壬水八卦阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10208,"商品编号":224008,"商品名称":"戊土九宫阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10209,"商品编号":224009,"商品名称":"乙木奇门阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
		{"商品序号":10210,"商品编号":224010,"商品名称":"辛金伏魔阵","出现等级":0,"商品价格":250,"每周限购":-1,"购买绑定":1},
	),
	200006:(
		{"积分名称":"侠义","商品序号":10301,"商品编号":224103,"商品名称":"金魄","出现等级":45,"商品价格":26,"每周限购":-1,"购买绑定":1},
		{"商品序号":10302,"商品编号":224104,"商品名称":"木魄","出现等级":45,"商品价格":26,"每周限购":-1,"购买绑定":1},
		{"商品序号":10303,"商品编号":224105,"商品名称":"水魄","出现等级":45,"商品价格":26,"每周限购":-1,"购买绑定":1},
		{"商品序号":10304,"商品编号":224106,"商品名称":"火魄","出现等级":45,"商品价格":26,"每周限购":-1,"购买绑定":1},
		{"商品序号":10305,"商品编号":224107,"商品名称":"土魄","出现等级":45,"商品价格":26,"每周限购":-1,"购买绑定":1},
		{"商品序号":10306,"商品编号":224108,"商品名称":"天地灵气","出现等级":45,"商品价格":173,"每周限购":-1,"购买绑定":1},
		{"商品序号":10307,"商品编号":230012,"商品名称":"小瓶九转灵液","出现等级":0,"商品价格":10,"每周限购":-1,"购买绑定":1},
		{"商品序号":10308,"商品编号":230021,"商品名称":"锦云叶","出现等级":0,"商品价格":21,"每周限购":-1,"购买绑定":1},
	),
	200007:(
		{"积分名称":"武勋","商品序号":10401,"商品编号":225001,"商品名称":"沈胜男元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10402,"商品编号":225002,"商品名称":"铁血捕快元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10403,"商品编号":225003,"商品名称":"唐缺元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10404,"商品编号":225004,"商品名称":"易静元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10405,"商品编号":225005,"商品名称":"朱文元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10406,"商品编号":225006,"商品名称":"笑和尚元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10407,"商品编号":225007,"商品名称":"齐金蝉元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10408,"商品编号":225008,"商品名称":"铁姝元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10409,"商品编号":225009,"商品名称":"崔盈元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
		{"商品序号":10410,"商品编号":225010,"商品名称":"哈哈老祖元神","出现等级":0,"商品价格":75,"每周限购":-1,"购买绑定":1},
	),
	200010:(
		{"积分名称":"献花积分","商品序号":10501,"商品编号":202043,"商品名称":"浣形丹","出现等级":0,"商品价格":500,"每周限购":-1,"购买绑定":1},
		{"商品序号":10502,"商品编号":202044,"商品名称":"虹彩珠","出现等级":0,"商品价格":5000,"每周限购":-1,"购买绑定":1},
		{"商品序号":10503,"商品编号":202045,"商品名称":"彩云晶","出现等级":0,"商品价格":5000,"每周限购":-1,"购买绑定":1},
		{"商品序号":10504,"商品编号":202042,"商品名称":"云来石","出现等级":0,"商品价格":5000,"每周限购":-1,"购买绑定":1},
		{"商品序号":10505,"商品编号":202049,"商品名称":"幻武丹","出现等级":0,"商品价格":5000,"每周限购":-1,"购买绑定":1},
	),
}
#导表结束

def getConfig(iNo):
	if iNo not in gdData:
		raise PlannerError,'没有编号为{}的积分商品'.format(iNo)
	return gdData[iNo]

def hasConfig(iNo):
	'''判断是否有指定的配置
	'''
	return gdData.get(iNo)

def getPropsByPointID(iNo):
	'''根据积分类型获取对应的商品
	'''
	if not gdData.get(iNo):
		return None
	dRet = {}
	for cfg in gdData[iNo]:
		iPropsId = cfg.get("商品编号")
		dRet.update({iPropsId:cfg})
	return dRet

pointHandler = {
	200004: {"get":"getSchoolPoint", "add":"addSchoolPoint"},
	200005: {"get":"getDemonPoint", "add":"addDemonPoint"},
	200006: {"get":"getHelpPoint", "add":"addHelpPoint"},
	200007: {"get":"getPKPoint", "add":"addPKPoint"},
	200010: {"get":"getFlowerPoint", "add":"addFlowerPoint"},
}
