#-*-coding:utf-8-*-

def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'不存在编号为{}的职业技能'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)

def getOpenSchSkill(school, level):
	'''可开启职业技能
	'''
	skillList = []
	for skillId, info in gdData.iteritems():
		if info["职业"] != school:
			continue
		if info["开启等级"] > level:
			continue
		skillList.append((info["开启等级"], skillId))
	
	skillList.sort()
	return [skillId for level,skillId in skillList]

def getSkillListBySchool(school):
	'''获取职业对应的技能
	'''
	skillList = []
	for skillId, info in gdData.iteritems():
		if info["职业"] == school:
			skillList.append(skillId)
	return skillList
			

#导表开始
gdData={
	1111:{"名称":"御剑术","类型":"物理近攻","职业":11,"开启等级":0,"法术":(1111,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1+20,"符能回复":lambda :20,"速率":100},
	1112:{"名称":"百剑绕指","类型":"物理远攻","职业":11,"开启等级":15,"法术":(1112,),"作用目标":"敌方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":5,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :5,"速率":100},
	1113:{"名称":"万剑归一","类型":"物理远攻","职业":11,"开启等级":30,"法术":(1113,),"作用目标":"敌方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":5,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+40,"符能消耗":lambda :40,"速率":100},
	1121:{"名称":"神通符法","类型":"物理近攻","职业":11,"开启等级":5,"法术":(1121,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :10,"速率":100,"配置数据":"概率:50"},
	1122:{"名称":"五雷符法","类型":"物理远攻","职业":11,"开启等级":20,"法术":(1122,),"作用目标":"敌方","作用人数":lambda LV:LV/35+3,"最大作用人数":5,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+5,"最大持续回合":5,"伤害":lambda SLV:SLV*2+20,"威力":100,"真气消耗":lambda SLV:SLV*1.2+30,"符能消耗":lambda :30,"buff":122,"速率":100},
	1123:{"名称":"天师符法","类型":"物理远攻","职业":11,"开启等级":35,"法术":(1123,),"作用目标":"敌方","作用人数":lambda LV:LV/35+3,"最大作用人数":5,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+40,"符能消耗":lambda :40,"速率":100},
	1131:{"名称":"纯阳无极诀","类型":"增益","职业":11,"开启等级":10,"法术":(1131,),"作用目标":"己方","作用人数":lambda :5,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+5,"最大持续回合":5,"真气消耗":lambda SLV:SLV*1+20,"符能回复":lambda :10,"buff":101,"速率":100},
	1132:{"名称":"混元一气诀","类型":"物理远攻","职业":11,"开启等级":25,"法术":(1132,),"作用目标":"敌方","作用人数":lambda :5,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1+30,"符能消耗":lambda :30,"速率":100},
	1133:{"名称":"先天正气诀","类型":"物理近攻","职业":11,"开启等级":40,"法术":(1133,),"作用目标":"敌方","作用人数":lambda :1,"最大作用人数":5,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1+40,"符能消耗":lambda :50,"速率":100},
	1191:{"名称":"身剑合一","类型":"物理远攻","职业":11,"开启等级":80,"法术":(1191,),"作用目标":"敌方","作用人数":lambda :5,"伤害":lambda SLV:SLV*2+20,"威力":120,"愤怒消耗":lambda :120,"速率":100},
	1211:{"名称":"风雷弹","类型":"魔法攻击","职业":12,"开启等级":0,"法术":(1211,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :10,"速率":100,"配置数据":"治疗:SLV*2+20|治疗威力:50|目标数:5"},
	1212:{"名称":"风神枪","类型":"魔法攻击","职业":12,"开启等级":15,"法术":(1212,),"作用目标":"敌方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":5,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :5,"速率":100},
	1213:{"名称":"风龙炮","类型":"魔法攻击","职业":12,"开启等级":30,"法术":(1213,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :15,"速率":100},
	1221:{"名称":"花醉针","类型":"魔法攻击","职业":12,"开启等级":5,"法术":(1221,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda :2,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :15,"buff":102,"速率":100},
	1222:{"名称":"花毒箭","类型":"魔法攻击","职业":12,"开启等级":20,"法术":(1222,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda :2,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :5,"buff":103,"速率":100},
	1223:{"名称":"花葬镖","类型":"魔法攻击","职业":12,"开启等级":35,"法术":(1223,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda :2,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :15,"buff":104,"速率":100},
	1231:{"名称":"雪映晴","类型":"增益","职业":12,"开启等级":10,"法术":(1231,),"作用目标":"己方","作用人数":lambda :5,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+5,"最大持续回合":5,"真气消耗":lambda SLV:SLV*1.2+20,"buff":105,"速率":100},
	1232:{"名称":"雪飘尘","类型":"解封","职业":12,"开启等级":25,"法术":(1232,),"作用目标":"己方","作用人数":lambda :1,"持续回合":lambda :2,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :10,"buff":106,"速率":100},
	1233:{"名称":"雪满山","类型":"增益","职业":12,"开启等级":40,"法术":(1233,),"作用目标":"己方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":5,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+2,"最大持续回合":2,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :40,"buff":107,"速率":100},
	1291:{"名称":"月下独酌","类型":"魔法攻击","职业":12,"开启等级":80,"法术":(1291,),"作用目标":"敌方","作用人数":lambda :5,"伤害":lambda SLV:SLV*2+20,"威力":60,"愤怒消耗":lambda :120,"符能回复":lambda :5,"速率":100},
	1311:{"名称":"落星式","类型":"物理近攻","职业":13,"开启等级":0,"法术":(1311,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1+20,"符能回复":lambda :20,"速率":100},
	1312:{"名称":"断月式","类型":"物理近攻","职业":13,"开启等级":15,"法术":(1312,),"作用目标":"敌方","作用人数":lambda SLV:SLV/60+3,"最大作用人数":4,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :5,"速率":100},
	1313:{"名称":"分阳式","类型":"物理近攻","职业":13,"开启等级":30,"法术":(1313,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":100,"真气消耗":lambda SLV:SLV*1.2+30,"符能消耗":lambda :40,"buff":108,"速率":100},
	1321:{"名称":"势如破竹","类型":"物理近攻","职业":13,"开启等级":5,"法术":(1321,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda :2,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+40,"符能回复":lambda :20,"buff":123,"速率":100},
	1322:{"名称":"乘胜追击","类型":"物理近攻","职业":13,"开启等级":20,"法术":(1322,),"作用目标":"敌方","作用人数":lambda :1,"最大作用人数":3,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+40,"符能消耗":lambda :20,"速率":100},
	1323:{"名称":"横扫千军","类型":"物理近攻","职业":13,"开启等级":35,"法术":(1323,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda :2,"伤害":lambda SLV:SLV*2+20,"威力":50,"真气消耗":lambda SLV:SLV*1.2+50,"符能消耗":lambda :50,"buff":123,"速率":100},
	1331:{"名称":"流星","类型":"物理近攻","职业":13,"开启等级":10,"法术":(1331,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :10,"速率":100},
	1332:{"名称":"燕返","类型":"物理近攻","职业":13,"开启等级":25,"法术":(1332,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :10,"速率":100},
	1333:{"名称":"无畏","类型":"物理近攻","职业":13,"开启等级":40,"法术":(1333,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+40,"符能消耗":lambda :40,"速率":100},
	1411:{"名称":"御蜂术","类型":"魔法攻击","职业":14,"开启等级":0,"法术":(1411,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1+20,"符能回复":lambda :20,"速率":100},
	1412:{"名称":"驱蛛术","类型":"魔法攻击","职业":14,"开启等级":15,"法术":(1412,),"作用目标":"敌方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":5,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :5,"速率":100},
	1413:{"名称":"逐蝎术","类型":"魔法攻击","职业":14,"开启等级":30,"法术":(1413,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :20,"buff":124,"速率":100},
	1421:{"名称":"迷魂咒","类型":"封印","职业":14,"开启等级":5,"法术":(1421,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+4,"最大持续回合":4,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :10,"buff":109,"速率":100,"命中率":lambda SLV,VLV:(SLV-VLV)*2+70},
	1422:{"名称":"破血咒","类型":"封印","职业":14,"开启等级":20,"法术":(1422,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+4,"最大持续回合":4,"真气消耗":lambda SLV:SLV*1.2+30,"符能消耗":lambda :10,"buff":110,"速率":100,"命中率":lambda SLV,VLV:(SLV-VLV)*2+70},
	1423:{"名称":"禁绝咒","类型":"封印","职业":14,"开启等级":35,"法术":(1423,),"作用目标":"敌方","作用人数":lambda :1,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+4,"最大持续回合":4,"真气消耗":lambda SLV:SLV*1.2+40,"符能消耗":lambda :30,"buff":111,"速率":100,"命中率":lambda SLV,VLV:(SLV-VLV)*2+70},
	1431:{"名称":"百足蛊","类型":"增益","职业":14,"开启等级":10,"法术":(1431,),"作用目标":"己方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":5,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+5,"最大持续回合":5,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :10,"buff":112,"速率":100},
	1432:{"名称":"金蚕蛊","类型":"增益","职业":14,"开启等级":25,"法术":(1432,),"作用目标":"己方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":4,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+5,"最大持续回合":5,"真气消耗":lambda SLV:SLV*1.2+30,"符能消耗":lambda :20,"buff":113,"速率":100},
	1433:{"名称":"隐身蛊","类型":"增益","职业":14,"开启等级":40,"法术":(1433,),"作用目标":"自己","作用人数":lambda :1,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+5,"最大持续回合":5,"真气消耗":lambda SLV:SLV*1.2+40,"符能消耗":lambda :40,"buff":114,"速率":100},
	1511:{"名称":"血魔焰","类型":"魔法攻击","职业":15,"开启等级":0,"法术":(1511,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1+20,"符能回复":lambda :20,"速率":100},
	1512:{"名称":"噬骨魔火","类型":"魔法攻击","职业":15,"开启等级":15,"法术":(1512,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+20,"符能消耗":lambda :10,"速率":101,"配置数据":"伤害率:{0:55,1:60}|生命值限制:70"},
	1513:{"名称":"烛天魔焰","类型":"魔法攻击","职业":15,"开启等级":30,"法术":(1513,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+30,"符能消耗":lambda :15,"速率":102,"配置数据":"目标符能:-20"},
	1521:{"名称":"九幽阴风","类型":"增益","职业":15,"开启等级":5,"法术":(1521,),"作用目标":"己方","作用人数":lambda SLV:SLV/30+2,"最大作用人数":4,"持续回合":lambda LV,SLV:(SLV-LV+2)/10+5,"最大持续回合":5,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :10,"buff":115,"速率":103},
	1522:{"名称":"通幽续命","类型":"治疗","职业":15,"开启等级":20,"法术":(1522,),"作用目标":"自己","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":100,"真气消耗":lambda SLV:SLV*1+20,"符能消耗":lambda :20,"速率":104,"配置数据":"恢复真气:200"},
	1523:{"名称":"呼幽唤灵","类型":"增益","职业":15,"开启等级":35,"法术":(1523,),"作用目标":"己方","作用人数":lambda :1,"持续回合":lambda LV,SLV:(SLV-LV+2)/10+6,"最大持续回合":6,"真气消耗":lambda SLV:SLV*1.2+50,"符能消耗":lambda :40,"速率":105,"配置数据":"名称:幽灵|造型:4006(0,1,0,0,0)|染色:(0,0,0,0,0)|技能:(1511,)"},
	1531:{"名称":"血雨腥风","类型":"魔法攻击","职业":15,"开启等级":10,"法术":(1531,),"作用目标":"敌方","作用人数":lambda SLV:SLV/25+3,"最大作用人数":6,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :10,"速率":106},
	1532:{"名称":"祸水滔天","类型":"魔法攻击","职业":15,"开启等级":25,"法术":(1532,),"作用目标":"敌方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":5,"持续回合":lambda LV,SLV:(SLV-LV+2)/10+4,"最大持续回合":4,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+30,"符能消耗":lambda :25,"buff":116,"速率":107,"配置数据":"伤害率:(30,25)"},
	1533:{"名称":"翻江倒海","类型":"魔法攻击","职业":15,"开启等级":40,"法术":(1533,),"作用目标":"敌方","作用人数":lambda :99,"伤害":lambda SLV:SLV*2+20,"威力":25,"真气消耗":lambda SLV:SLV*1.2+30,"符能消耗":lambda :50,"速率":108},
	1611:{"名称":"狮吼功","类型":"魔法攻击","职业":16,"开启等级":0,"法术":(1611,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1+20,"符能回复":lambda :20,"速率":100},
	1612:{"名称":"金刚禅唱","类型":"魔法攻击","职业":16,"开启等级":15,"法术":(1612,),"作用目标":"敌方","作用人数":lambda SLV:SLV/35+3,"最大作用人数":5,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :5,"速率":100},
	1613:{"名称":"索命梵音","类型":"魔法攻击","职业":16,"开启等级":30,"法术":(1613,),"作用目标":"敌方","作用人数":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+30,"符能消耗":lambda :20,"速率":60},
	1621:{"名称":"立地生佛","类型":"治疗","职业":16,"开启等级":5,"法术":(1621,),"作用目标":"己方","作用人数":lambda :2,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+5,"最大持续回合":5,"伤害":lambda SLV:SLV*2+20,"威力":80,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :10,"buff":117,"速率":100},
	1622:{"名称":"枯树生花","类型":"复活","职业":16,"开启等级":20,"法术":(1622,),"作用目标":"己方","作用人数":lambda :1,"持续回合":lambda :1,"伤害":lambda SLV:SLV*2+20,"威力":100,"真气消耗":lambda SLV:SLV*1.2+50,"符能消耗":lambda :20,"速率":100},
	1623:{"名称":"步步生莲","类型":"增益","职业":16,"开启等级":35,"法术":(1623,),"作用目标":"己方","作用人数":lambda :1,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+5,"最大持续回合":5,"伤害":lambda SLV:SLV*2+20,"威力":100,"真气消耗":lambda SLV:SLV*1.2+40,"符能消耗":lambda :30,"buff":118,"速率":100,"配置数据":"次数:5"},
	1631:{"名称":"金刚不坏","类型":"增益","职业":16,"开启等级":10,"法术":(1631,),"作用目标":"己方","作用人数":lambda LV:LV/50+2,"最大作用人数":3,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+4,"最大持续回合":4,"伤害":lambda SLV:SLV*2+20,"威力":60,"真气消耗":lambda SLV:SLV*1.2+20,"符能回复":lambda :10,"buff":119,"速率":120},
	1632:{"名称":"龙象般若","类型":"增益","职业":16,"开启等级":25,"法术":(1632,),"作用目标":"己方","作用人数":lambda :1,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+3,"最大持续回合":3,"符能消耗":lambda :15,"buff":120,"速率":100},
	1633:{"名称":"洗髓易筋","类型":"增益","职业":16,"开启等级":40,"法术":(1633,),"作用目标":"己方","作用人数":lambda :1,"持续回合":lambda SLV,VLV:(SLV-VLV+2)/10+3,"最大持续回合":3,"伤害":lambda SLV:SLV*2+20,"威力":120,"真气消耗":lambda SLV:SLV*1.2+40,"符能消耗":lambda :40,"buff":121,"速率":150},
	1691:{"名称":"金刚伏魔","类型":"魔法攻击","职业":16,"开启等级":80,"法术":(1691,),"作用目标":"敌方","作用人数":lambda :5,"伤害":lambda SLV:SLV*2+20,"威力":120,"愤怒消耗":lambda :120,"速率":100},
}
#导表结束

import u
