#-*-coding:utf-8-*-
#作者:马昭@曹县闫店楼镇

def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'没有编号{}的仓库数据'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)

#导表开始
gdData={
	1:{"仓库名称":"免费仓库1","消耗银币":0},
	2:{"仓库名称":"免费仓库2","消耗银币":0},
	3:{"仓库名称":"仓库3","消耗银币":500000},
	4:{"仓库名称":"仓库4","消耗银币":1500000},
	5:{"仓库名称":"仓库5","消耗银币":2000000},
	6:{"仓库名称":"仓库6","消耗银币":2500000},
	7:{"仓库名称":"仓库7","消耗银币":3000000},
	8:{"仓库名称":"仓库8","消耗银币":4000000},
	9:{"仓库名称":"仓库9","消耗银币":4500000},
}
#导表结束