#-*-coding:utf-8-*-
#作者:马昭@曹县闫店楼镇
def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'没有编号为{}的称号'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)

#导表开始
gdData={
	40301:{"组编号":40301,"组系数":1,"称谓名称":"试炼敬座","有效期":(7,0)},
	40302:{"组编号":40301,"组系数":2,"称谓名称":"试炼次座","有效期":(7,0)},
	40303:{"组编号":40301,"组系数":3,"称谓名称":"试炼魁首","有效期":(7,0)},
	40401:{"组编号":40401,"组系数":1,"称谓名称":"筑基组最强","有效期":(7,0)},
	40402:{"组编号":40401,"组系数":2,"称谓名称":"金丹组最强","有效期":(7,0)},
	40403:{"组编号":40401,"组系数":3,"称谓名称":"元婴组最强","有效期":(7,0)},
	40404:{"组编号":40401,"组系数":4,"称谓名称":"化神组最强","有效期":(7,0)},
	50401:{"组编号":8,"组系数":1,"称谓名称":"天问末座","有效期":(7,0)},
	50402:{"组编号":8,"组系数":2,"称谓名称":"天问敬座","有效期":(7,0)},
	50403:{"组编号":8,"组系数":3,"称谓名称":"天问次座","有效期":(7,0)},
	50404:{"组编号":8,"组系数":4,"称谓名称":"天问魁首","有效期":(7,0)},
	60101:{"组编号":60101,"组系数":1,"称谓名称":"笑傲江湖","有效期":-1},
	60151:{"组编号":60151,"组系数":1,"称谓名称":"腰缠万贯","有效期":-1},
	20101:{"组编号":20101,"组系数":1,"称谓名称":"学徒","有效期":-1},
	20102:{"组编号":20101,"组系数":2,"称谓名称":"盟众","有效期":-1},
	20103:{"组编号":20101,"组系数":3,"称谓名称":"精英","有效期":-1},
	20104:{"组编号":20101,"组系数":4,"称谓名称":"长老","有效期":-1},
	20105:{"组编号":20101,"组系数":5,"称谓名称":"副盟主","有效期":-1},
	20106:{"组编号":20101,"组系数":6,"称谓名称":"盟主","有效期":-1},
}
#导表结束
