编号	内容_S
1001	你愿意前来相助，很好。此次是因为我算出潜修的玄武龟将逢灾劫，但又无暇前去，可否请你走一趟？
1002	此去与魔道交手时需多加小心，避免惹出大事。
1003	多管闲事的家伙，让你尝尝厉害！
	出手教训
	只是路过
1004	可恶……等师父回来……一定会替我报仇……
1005	知道自己分量，胆怯了吧？
1006	魔人虽灭，但潜修处已不安全。与其再找，不如与$SEX1一同上路，互相督促修行吧。如此一来，修行之路虽漫长，却不会寂寞了。
	带异兽走
	考虑一下
1007	给异兽治伤的灵药已所剩无几，麻烦$SEX1替我去找螺旋草，向它要一罐灵药吧。
1008	死缠不放，魔道之人真是恶心。
1009	居然追到这里，那只能和你打一场了！
	先行一战
	先行解释
1010	啊……我还以为$SEX1是来追杀这名坠崖之人的，误会了，真是抱歉。
1011	哼，还以为有多大本事。
1012	啊——！你！你没受伤！
1013	$SEX1，这人急需药物救治。
1014	哼，终于抓到这异兽了，快把所有灵蜜交出，否则给你点颜色瞧瞧！
	与之交手
	稍待片刻
1015	……居然……输了……
1016	哼，自不量力。
1017	异兽亦有善良之心，这是好事；但也容易被邪恶之人趁机利用，以后需多加提防。
1018	淘气的灵猴出走了，有人在城南见过它，$SEX1能替我走一趟吗？
1019	你是仙子派来找我的人？\t*A*nA**SS*$S1S$(为何灵猴像在计划着什么……)\n嗯。仙子说外头危险，让你回去鼎中继续修行。
1020	想让我回去，得先问过我的棍子！
	一试高低
	等等再说
1021	嘿嘿，终于来了个帮手！
1022	要等到什么时候？
1023	其实……是城西有慈云寺的恶徒盘踞，我对付不了他，你刚好来做个帮手！\n除了那恶人，我就跟你回去！\t*A*nA**SS*$S2S$原来是这个打算……不愧是猴子……
1024	多个帮手，就以为能对付我了？
	斩妖除魔
	临阵退缩
1025	我……败给……这等……无名小辈……不服……
1026	不是对手，就赶快滚！
1027	原来是为了保护百姓，而不是淘气玩耍，这次尚可原谅。\t既然你觉得禹鼎中太过苦闷，那就与$SEX1做个伴儿吧。
	带异兽走
	考虑一下
1028	隐居碧凝崖的文雀自从出过门后，就一直闷闷不乐，请$SEX1替我去问问它为何会这样吧。
1029	上次，我看到在天上飞的大鹏，我也想飞，可我太胖了……\t*A*nA**SS*$S2S$因为这个，你才闷闷不乐？\t*A文雀A**S3005S*$S1S$我……我修为太低，又太胖，所以飞不起来……我听说杜仲能轻身健体，$SEX1能替我找来吗？
1030	多谢$SEX1！
1031	$SEX1……杜仲……
1032	文雀只知其一却不知其二，杜仲确能轻身健体，但对异兽来说则不一定。\t你回去看看文雀，确认它是否还安好。\t*A*nA**SS*$S1S$（原来异兽与人有这等分别，快回去看看文雀。）嗯！
1033	这小家伙修为太低，做道下酒菜倒还可以。
	救下文雀
	袖手旁观
1034	哼，今天先不跟你计较！
1035	先掂量好自己的本事！
1036	即使是药，服用对象不同，后果也不同。\t文雀就是个教训。只看到别人成功，自己盲目模仿，未必能像别人一样成功。
	带异兽走
	考虑一下
1037	我在城南感受到了云狐一脉的气息，应是有云狐被抓来了。\n请$SEX1前去救出那可怜的孩子，送它回山吧。\t*A*nA**SS*$S2S$是，我这就去。
1038	可恶的人类！
	打败云狐
	试图解释
1039	人类杀了我的父母，还剥下了他们的皮……我一定要报仇！
1040	人类说的每一个字每一句话，我都不会听！
1041	既然输给你，要杀就杀，别啰嗦！\t*A*nA**SS*$S2S$喂，我不是……\t*A云狐A**S3008S*$S1S$不用多说了！\t*A*nA**SS*$S2S$（它什么都听不进，还是先给它找来治伤药物吧。）你留在这，我稍后就送你回山。
1042	别以为一点小恩小惠我就会原谅人类！
1043	不就是想要毛皮吗，何必故弄玄虚？
1044	你真的要放我回去？\t*A*nA**SS*$S2S$我又没必要骗你，快走吧。\t*A云狐A**S3008S*$S1S$……哼，就算你放了我，我也绝对不会原谅人类。\t*A*nA**SS*$S2S$嗯，我能理解你，回去吧。\n别再让人类抓到了。
1045	云狐一脉本身并无过错，只是由于人的贪婪才使它们遭受劫难。\t希望云狐一脉能延续下去，不致于被捕杀净尽吧。
	带异兽走
	考虑一下
1046	恭喜获得异兽·#C05玄武龟#n
1047	恭喜获得异兽·#C05灵猴#n
1048	恭喜获得异兽·#C05螺旋草#n
1049	恭喜获得异兽·#C05文雀#n
1050	恭喜获得异兽·#C05云狐#n
1051	你来得正好，最近城中有不少小孩无故失踪，史镖头家的小女儿一个时辰前也被怪物掳走,请你赶快前去寻找那孩子。\t*A*nA**SS*$S2S$好，只是不知道那怪物长什么样，向哪个方向逃了？\t*A齐霞儿A**S4508S*$S1S$据史夫人所说，那怪物高大魁梧，力气极大，一路往西逃跑了。\t*A*nA**SS*$S2S$好，我这就前去！
1052	好、好可怕……救命啊！怪、怪物！\t*A*nA**SS*$S2S$这么害怕，你看到了什么？\t*A惊惶的书生A**S2005S*$S1S$我、我刚才看到一条好大的蛇和一只巨熊在搏、搏斗……\n我差点就被它们弄死……好不容易才逃掉……\t*A*nA**SS*$S2S$（蛇？还有熊？怎么回事？）\n我知道了，你这书生赶快回去休息吧。
1053	咝咝——咝咝——（巨蛇吐着信子，死死盯着你）
	收拾巨蛇
	休整片刻
1054	（巨蛇横尸就地，毒涎流到的地方草木焦枯）
1055	咝咝——咝咝——（巨蛇流着毒涎看着你）
1056	呜呜呜，你是个好人，大熊为了保护我受了伤，你能不能帮我找来给大熊治伤的药？\t*A*nA**SS*$S2S$（这只巨熊确实伤势不轻，先替它找来伤药吧）好，你在这里等我。\t*A史家小女儿A**S3010S*$S1S$好，我在这里等你，你一定要回来啊。
1057	谢谢好心$SEX1！
1058	呜呜……大熊流了好多血……大熊不能死……呜呜……
1059	呜呜……我在家附近玩的时候，被这蛇叼走了，大熊为了保护我，就和这蛇打架……后面……也不知道怎么来到这里了——\t听大熊说，那蛇是赤、赤身教的人变成的，专门抓小孩子……\t*A*nA**SS*$S2S$嗯？赤身教？\n（之前玄武龟也是他们……这回……）\t看来这个赤身教不是什么好东西，得回去跟仙子说一下才行。\t小姑娘，我送你回家吧。\t*A史家小女儿A**S3010S*$S1S$好……谢谢好心$SEX1！
1060	你说这是赤身教徒所为？这是苗疆教派，一贯行事诡秘，教主鸠盘婆脾气乖僻，但未听闻有什么恶行。\t此事……我抽空向父亲汇报一下吧，你日后遇见赤身教徒的话，行事也需小心。\t那史家姑娘与巨熊身具仙缘，可与你一起修行，你愿意把他们带上吗？
	带异兽走
	考虑一下
1061	恭喜获得异兽·#C05傀儡熊#n
1062	金鹏被妖人的毒焰灼伤，到现在还没有好转，$SEX1麻烦你帮我走一趟蜀山，问问我父亲妙一真人该如何医治吧。\t*A*nA**SS*$S2S$好，我这就去！
1063	不必多礼。找我何事？\t*A*nA**SS*$S1S$金鹏被妖人毒焰灼伤，一直不见好转，霞儿仙子让我来问要如何医治。\t*A齐漱溟A**S4502S*$S2S$原来如此。\n要医治并不难，但所需的药只有怪妖谜独行有，然而它在锁妖塔中……塔中妖物众多，入内需万分小心。\t*A*nA**SS*$S1S$怪妖？\t*A齐漱溟A**S4502S*$S2S$这妖脾气古怪又无比吝啬，喜欢给人出谜语，所以称为怪妖。\t*A*nA*SS*$S1S$多谢前辈指点，晚辈这就入塔找那怪妖去！
1064	嘘——别吵！老妖我正在想谜语！\t*A*nA**SS*$S2S$(这家伙……看来要想想办法)\n自己给自己出谜语，是怕太简单被别人解答出来，所以不敢让别人听到吧？\t*A谜独行A**S4005S*$S1S$胡说八道！老妖我的谜语肯定没几个人能解出来！\t*A*nA**SS*$S2S$（嘿嘿，果然行得通）\n你把你的谜语说出来，我一定能猜到！不过要是我猜出你的谜语，你要把身上的灵药给我，敢不敢？\t*A谜独行A**S4005S*$S1S$哼！有什么不敢的！
1065	哼——听好了！我的谜语是：一阴一暗，一短一长，一昼一夜，一热一凉。猜一个字，你说是什么字吧——
	二
	明
1066	我、我的题目就这样被解开了？……药给你，滚！我要想更多的谜语了！
1067	哼，只会说大话的愚蠢之辈，滚吧！
1068	哈，终于等到你了！\n我是血神教圣女明珠，把怪妖的灵药交出，可免你一死，否则别怪我下手无情！
	与之交手
	再等片刻
1069	你……你修为这么低，怎么能够打败我？
1070	呵，怕了就赶快把药交出来！
1071	交出灵药，不然我、我就杀了你！\t*A*nA**SS*$S2S$等等——！你先说为什么要这药？说不定我能想个办法。\t*A明珠A**S4508S*$S1S$真的？骗我的话，我也会杀了你哟。\t*A*nA**SS*$S2S$（这血神教的圣女……怎么老把杀挂在嘴边……）\n不骗你，你说吧。\t*A明珠A**S4508S*$S1S$我……听说神貅角能治所有的伤，所以想把我哥坐骑的角锯下来……\t没想到神貅被割了角之后，就、就一直流血，停不下来……\t*A*nA**SS*$S2S$这……我回去谜独行那，看他能不能再给一份灵药？
1072	你怎么又回来了？快滚！\t*A*nA**SS*$S2S$喂喂喂，别这么急着赶人，我再答一道你的谜语，你再给我一份灵药，怎么样？\t*A谜独行A**S4005S*$S1S$(谜独行瞪眼看着你)\n你……你！\t*A*nA**SS*$S2S$咦，你怎么头发竖起来了？\t*A谜独行A**S4005S*$S1S$你！！欺妖太甚！找死！
1073	谁敢再动我的灵药，我就吃掉谁！
	动手教训
	迟疑片刻
1074	滚！你们连老妖怪的东西都抢！什么名门正道！
1075	老妖我一定要吃掉你！说什么也晚了！
1076	嘻嘻，谢谢你啦，这家伙实在不好对付，这回终于拿到药了。\n以后遇到修罗宫的人，你就说你是我的朋友，这样他们就不会为难你了。\t*A*nA**SS*$S2S$朋友……你可是血神教的圣女……\t*A明珠A**S4508S*$S1S$难道血神教圣女就一定是阴险毒辣，连个朋友都不能交吗？\t*A*nA**SS*$S2S$这……倒也不是。\t*A明珠A**S4508S*$S1S$那就这样说好了，做个朋友吧——我先回宫给神貅上药，日后有机会再见！
1077	嗯？这就是从怪妖那取得的灵药？这药见效好快，金鹏的伤已经好了大半。\t感谢你为金鹏奔波劳碌，如今它也恢复得差不多了，就让它在你身边做个帮手吧。
	带异兽走
	考虑一下
1078	恭喜获得异兽·#C05金鹏#n
1079	在凌云大佛那潜修的毕方，羽毛无故消失了许多，修为也倒退大半，麻烦你帮我查探其中内情，看看到底是怎么回事。\t*A*nA**SS*$S2S$好，我这就去！
1080	是仙子让你来找我的？\t*A*nA**SS*$S2S$是，仙子很担心你，所以让我来问问是怎么回事。\t*A毕方A**S3010S*$S2S$请你回报仙子，我什么事都没有，请她不要担心。\t*A*nA**SS*$S1S$这……好吧。
1081	嗯——毕方不说也在我意料之内。\t不过我发现唐百草那有毕方羽毛制成的羽衣出售，想来是毕方自愿送给她的，请你帮我问问唐百草，这到底是怎么回事吧。\t*A*nA**SS*$S1S$毕方羽毛做的羽衣？好，我去问问。
1082	$SEX1想要这件羽衣吗？\t*A*nA**SS*$S2S$不，我只是觉得这羽衣巧夺天工，想知道来源而已。\t*A唐百草A**S2004S*$S1S$这衣服？这衣服是我义女织的，只是她现在……现在……唉，我也不知道她去哪了……\t嗯？糟了，那、那不是城里有名的地痞头子吗？\t肯定是他们想来抢这羽衣，这，$SEX1能不能帮帮老太婆，教训他们一顿？
1083	老子想要什么，你们就得乖乖交上！不然让你们好看！
	痛揍一顿
	路过而已
1084	哎哟——今天大爷不舒服，下、下次再给你好看！
1085	嘿嘿，怕了的话就乖乖交上羽衣！
1086	你去过我义母那了？唉，既然你知道了，那就告诉你吧。\t我上次变成人形偷溜出去，不小心遇到暴风雪，是她救了我，我想报答她，就做了她的义女。\t但后面我修为损耗太多，在她眼前现出兽形，就慌忙逃走了……\t*A*nA**SS*$S2S$那你为什么不说出来？\t*A毕方A**S3013S*$S1S$我……我怕吓到她，所以就不敢说出来……\t既然你知道了，你帮我去问问，是否有吓着她吧。
1087	嫌恶？唉……老太婆活了这么久，什么人没见过？坏起来的人，能比野兽更凶狠十倍！\t请$SEX1转告她，只要是好的，管她是人是兽，老太婆我根本就不在意啊。\t*A*nA**SS*$S1S$嗯，我这就回去告诉她！
1088	你就是那个教训了我门下弟子的家伙？哼，虽然他们作了恶，但也轮不到你这些外人来替我清理门户！\t能击败我的分神的话，暂且饶你一命，否则便马上将你拘回苗疆发落！
	冒险一试
	犹豫片刻
1089	哼，实力勉强可以。\n这是告诫，苗疆有自己的规矩，无需外人插手！
1090	哼，原来是草包一个。
1091	是人是兽，都在于一颗心而已。毕方能解开心结，实在幸运。\t只是它修为损耗太过，我无法照顾它，不知$SEX1你是否愿意把它带在身边？
	带异兽走
	考虑一下
1092	恭喜获得异兽·#C05毕方#n
1093	你来了。如今已是春天，但依然冰封三尺，严寒迫人，我们都束手无策。\t听闻苗疆人信奉女娲大神，或能从他们大族长那得知为何春天不来的原因。\t*A*nA**SS*$S2S$是，我这就前往苗疆。
1094	春天不来？哼，女娲大神的旨意也不是随便能告诉你们这些人的，否则岂不是亵渎了大神？你回去吧！\t*A*nA**SS*$S2S$这……好吧。
1095	喂——过来过来。师父让我告诉你，应该是春神被人用邪术拘禁了，所以才会一直冬天。\t*A*nA**SS*$S2S$师父？但是……\t*A金姝A**S4008S*$S1S$哎呀，师父是为了立威而已啦，不然随随便便就把神旨告诉外人，其他苗疆理老很容易不服的。\t师父还说，春神应该是被拘在锁妖塔里了，你前去时要多加小心。\t*A*nA**SS*$S2S$好，我知道了！
1096	恶、恶徒……还我法器！可恶！一定要惩治你这种恶徒才行！受死！
	制服句芒
	稍待片刻
1097	你……你不是那些修罗宫的恶人？
1098	恶人！受死！
1099	头好痛……你、你不是那些修罗宫的恶人？\t*A*nA*SS*$S2S$我是来找你的，你一直没有出现，现在春天已到，却还是冬天的样子。\t*A句芒A**S3009S*$S1S$春天已到？！等等……糟了！快逃！这是个陷阱！\t*A*nA*SS*$S2S$陷阱？！\t*A句芒A**S3009S*$S1S$这是修罗宫的人设下的陷阱！
1100	想逃？已经晚了！\n本来以为能引来三英二云，没想到来的只是个无名小卒！\t哼，也罢，如今所需的法器已经到手，就让你死得痛快点！
	与之交手
	犹豫再三
1101	本尊倒是小看了你。
1102	如此无用的家伙，实在令人恶心。
1103	想到哪去？你的对手是姥姥我！留下来吧！
	击败红花
	犹豫片刻
1104	你……果然不能小视！
1105	看来能逃过宫主攻击，也只是靠运气而已。
1106	那些恶人把我的法器抢走了，也不知道他们在谋划什么……\t如今状况，我只能长驻人间，等找到法器再回去吧。\t*A*nA**SS*$S1S$那我带你去见异兽仙子，相信她会安排好你的。
1107	修罗宫……他们到底在谋划什么呢？春神的话……请她与你作伴吧。\t毕竟修罗宫的人与你已有过节，日后相遇时伺机抢回法器，也不是不可能的事。
	带异兽走
	考虑一下
1108	恭喜获得异兽·#C05句芒#n
1109	$SEX1，最近云顶村发生不少怪事，麻烦你走一趟，看看到底是怎么回事吧。\t*A*nA**SS*$S1S$怪事？\t*A齐霞儿A**S4508S*$S2S$嗯。但具体什么情况我还不清楚，只能请你前往了。\t*A*nA**SS*$S1S$好，我这就动身前去。
1110	哇——！$SEX1你回来了！\t*A*nA**SS*$S1S$嗯，听说村里最近发生不少怪事，我特地回来的。\n你能告诉我，最近村里都发生过什么怪事吗？\t*A小虎儿A**S2006S*$S2S$怪事啊？等我想想……\t噢，最近村子里多了好多蜇人的蝎子，好多人被蛰了，娘亲都不让我和小翠儿出来玩了。\t*A*nA**SS*$S1S$(奇怪，这不是蝎子活动的季节啊？)\n那……小虎儿你知道哪里的蝎子最多吗？\t*A小虎儿A**S2006S*$S2S$知道啊！从莽苍山那条路过来，密密麻麻都是蝎子呢！
1111	嘎！人类！吃了这个人类！！孩儿们，为了抢回洞府，把这个人吃了！\t*A*nA**SS*$S1S$这群蝎子——糟糕！得小心它们的毒！
1112	据说人心最毒，为了抢回洞府，把这个人吃了！
	打败蝎王
	落荒而逃
1113	嘎……这个人类我们吃不了……
1114	孩儿们！别让这人跑了！
1115	为什么要吃人？嘎，因为一个毒尸霸占了我们的洞府，我们的毒性拼不过它，嘎，所以被赶出来了……\t听说人心最毒，嘎，所以我们要变得更毒，抢回洞府！\t*A*nA**SS*$S2S$这……你们不明白，人心的毒和你们的毒不是同一种意思。\t*A阎王蝎A**S3004S*$S1S$嘎？什么意思？嘎，不明白……反正、反正你想让我们不吃人的话，就帮我们把洞府抢回来！
1116	想帮那些傻蝎子？哈哈哈哈——就看看你有多少本事吧！
	除去毒尸
	休整片刻
1117	不……不可能！我是不生不死的毒尸，怎么、怎么会败……
1118	胆怯？心虚？哈哈哈哈，晚了！
1119	云顶村的怪事原来是阎王蝎所为，如今平息了就好。但阎王蝎本身带有戾气，如果不加修炼，则容易落入邪道，你是否愿意把它带在身边，与它一同修行？
	带异兽走
	考虑一下
1120	恭喜获得异兽·#C05阎王蝎#n
