编号	内容_S
1001	老朽我以八门阵法组成了一个迷宫，一共15层，看你们能不能破此迷宫寻得宝物
	进入迷宫
	规则说明
1002	进入迷宫需要等级≥20
1003	你不是此仙盟成员，无法进入迷宫
1004	迷宫只能单人进入，请先离开队伍
1005	休、生、伤、杜、景、死、惊、开，八门八变，只有生门能进入下一层。我是其中一个门接引人，你要从我这里进入下一层吗？
	进入此门
1006	你进入了休门，被强制休息15秒，不能和接引人沟通
1007	你进入了生门，成功进入下一层
1008	你进入了伤门，触动了守门卫士
1009	很遗憾你战败了，被传送回了第1层
1010	你进入了杜门，被传送回了第$floor层
1011	你进入了景门，被传送回了第$floor层
1012	你进入了死门，被传送回了第$floor层
1013	你进入了惊门，随机传送到了第$floor层
1014	你进入了开门，被传送回了第$floor层
1015	恭喜少侠通过考验。需要离开迷宫吗？
	离开迷宫
	再等等
1016	1.玩家等级≥#C0220级#n，只能单人进入\n2.迷宫一共#C0215层#n，每层只有#C02生门#n能进入下一层\n3.迷宫第#C025、10、15层#n各有一个宝箱，大家齐心协力才能更快地通过迷宫
6001	#L1<14,28>*[仙盟迷宫]*02#n将在#C0212:00#n准时开始，请各位仙友做好准备，前往等待活动开始
6002	#L1<14,28>*[仙盟迷宫]*02#n已经开始，请准备好的仙友快进入迷宫，寻找迷宫内的宝物
6003	$roleName在#L1<14,28>*[仙盟迷宫]*02#n中开启了大宝箱，获得了$lnkProps