编号	名称	描述	链接类型	链接目的	npc	任务编号	活动日期类型	是否需要仙盟	活动日期	活动时间	条件类型	活动等级
101	商城	使用龙纹玉购买商品	1	10			1	0	0	0,2400	1	5
102	邪道煞星	每到整点，邪道煞星会出现在#C03天墉城#n、#C03峨眉山#n、#C03莽苍山#n、#C03封妖塔外#n、#C03云顶村#n五个地图上，当所有五行煞星都被击杀后，会出现顶级首领#C02天罗子#n	2	1130			2	0	2	1000,2400	1	30
103	竹林除妖	击杀赤血神君，拯救村民	3	NPC	10212		1	0	0	0,2400	1	45
104	幻波池	击杀玉娘子崔盈，通过幻波池试练	3	NPC	10212		1	0	0	0,2400	1	55
105	天问初试	依次完成20名考官的试练	3	NPC	90001		2	0	6	1200,2200	1	20
106	秘册任务	击杀盗匪获得#C02小衍藏宝秘册#n	3	NPC	10402	50201	1	0	0	0,2400	1	25
107	兑换	使用#C02青龙珠#n、#C02赤龙珠#n、#C02金龙珠#n、#C02黑龙珠#n、#C02黄龙珠#n兑换1张#C02大衍藏宝秘册#n	3	NPC	10601		1	0	0	0,2400	1	5
108	炼丹	消耗灵气获得物品，灵气在#C02乘骑坐骑#n时获得	1	17			1	0	0	0,2400	1	20
109	每日答题	连答10道题目获得奖励，连续答对题数越多，获得奖励越高	3	NPC	10301		1	0	0	1200,2400	1	20
110	幻境试炼	挑战关卡，连续挑战，关卡数越高，难度越大，奖励越多	3	NPC	10901		1	0	0	0,2400	1	40
111	大衍藏宝秘册	到特定地点使用秘册获得丰厚奖励，大衍藏宝秘册可由#C02五色龙珠#n合成	3	NPC	10601		1	0	0	0,2400	1	5
112	鲜花商店	使用鲜花积分购买商品，鲜花积分可在每周六的#C02金章之试#n活动中投注成功后获得	1	54			1	0	0	0,2400	1	20
113	杂货店	使用银币购买商品	1	20			1	0	0	0,2400	1	1
114	降魔商店	使用降魔积分购买商品，击杀#C02厉魔#n、#C02天魔#n可获得降魔积分	1	51			1	0	0	0,2400	1	20
115	侠义商店	使用侠义值购买商品，带低10级的新手玩家进行降魔任务、协助其他玩家通过入世修行的战斗、每天击杀第4个及之后的邪道煞星、协助其他玩家通过主线剧情战斗等，都可获得侠义值	1	52			1	0	0	0,2400	1	20
116	武勋商店	使用武勋值购买商品，参加每周六#C02竞技场#n活动可获得武勋值	1	53			1	0	0	0,2400	1	20
117	门派商店	使用门派积分购买商品，完成每天师门任务可获得门派积分	1	50			1	0	0	0,2400	1	15
118	挑战厉魔	使用#C02厉魔录#n可进入厉魔挑战，每#C02120环#n降魔任务达成时有一定几率获得#C02厉魔录#n	3	NPC	10401		1	0	0	0,2400	1	20
119	挑战天魔	使用#C02天魔录#n可进入天魔挑战，每#C02600环#n降魔任务达成时有一定几率获得#C02天魔录#n	3	NPC	10401		1	0	0	0,2400	1	20
120	门派试练	连续挑战各门派精英高手，每一轮都可获得奖励，坚持轮数越多，获得奖励越丰厚	3	NPC	10301		1	0	0	2000,2200	1	40
121	幸运探宝	投骰子移动，步步惊喜	3	NPC	10211		1	0	0	0,2400	1	20
122	单人竞技场	武无第二，胜者为王	3	NPC	10207		2	0	6	2000,2200	1	20
123	仙盟大战	仙盟对抗，精英组决胜败，普通组定荣耀，胜败皆可获得奖励	3	NPC	10301		2	1	2,4	2000,2200	1	15
124	魔教入侵	击杀潜入仙盟的血神教弟子和血神教护法，可在本盟击杀，也可协助其他仙盟	3	NPC	10301		2	1	1,3,5	1200,1400	1	15
125	月儿岛秘径图	使用#C02月儿岛秘径图#n挑战3个珍宝守护者，每天完成第10次#C02秘册任务#n时有一定几率获得#C02月儿岛秘径图#n	3	NPC	10402		1	0	0	0,2400	1	25
126	入世修行	200环连续任务，可获得大量经验及装备材料	3	NPC	10215	30601	1	0	0	0,2400	1	50
127	小衍藏宝秘册	到特定地点使用秘册获得奖励，每天完成#C02秘册任务#n可获得小衍藏宝秘册	3	NPC	10402		1	0	0	0,2400	1	25
128	副本	通关任一副本皆可获得此物品	3	NPC	10212		1	0	0	0,2400	1	45
129	银币商店	使用银币购买商品	1	21			1	0	0	0,2400	1	1
130	元宝商店	使用元宝购买商品	1	22			1	0	0	0,2400	1	1
131	烹饪	使用活力制作食品	1	23			1	1	0	0,2400	1	1
132	炼丹术	使用活力制作丹药	1	24			1	1	0	0,2400	1	1
133	打造技巧	使用活力制作打造符	1	25			1	1	0	0,2400	1	1
134	裁缝技巧	使用活力制作裁缝符	1	26			1	1	0	0,2400	1	1
135	炼金技巧	使用活力制作炼金符	1	27			1	1	0	0,2400	1	1
136	药店	使用银币购买药品	1	19			1	0	0	0,2400	1	1
137	降魔任务	获得大量经验，完成一定环数可额外获得#C02厉魔录#n和#C02天魔录#n	3	NPC	10401	30101	1	0	0	0,2400	1	20
138	装备打造	消耗材料打造装备，一定几率可获得珍品装备	1	3			1	0	0	0,2400	1	40
139	金章之试	连答20道题目获得奖励，耗时越少奖励越丰富	3	NPC	90021		2	0	6	2100,2200	1	20
140	组队竞技场	组队竞技，协同制敌	3	NPC	96725		2	0	6	2000,2200	1	30
141	五岳帝君	组队挑战5名帝君	3	NPC	10301		2	0	6	0,2400	1	30
142	北斗七星	七星汇聚，单人挑战	3	NPC	10301		2	0	7	0,2400	1	30