编号	名称	类型	法术_T	评分	五行	作用目标	作用人数_E	最大作用人数	持续回合_E	最大持续回合	伤害_E	威力	真气消耗_E	愤怒消耗_E	符能消耗_E	符能回复_E	buff	技能效果_S	法术效果_S	配置数据_S
3301	舍身	无	3301	30														phyDamRatio:3|magDamRatio:3|phyDefRatio:-2|magDefRatio:-2		
3302	白刃	无	3302	30														phyCrit:1		
3303	霜剑	无	3303	30														magCrit:1		
3304	封禁	无	3304	30																
3305	暗香	无	3305	30																
3201	灵药	无	3201	30																
3202	生死意	无	3202	30																
3203	妙手	无	3203	30																
3204	流霜	无	3204	30																
3205	惠赠	无	3205	30																
3206	浩然气	无	3206	30																
3101	盈袖	无	3101	30																概率:15
3102	持身	无	3102	30																真气:50
3103	怒目	无	3103	30																
3104	防御	无	3104	30																
3105	风鸣	无	3105	30																
3501	提携	无	3501	30					8								219			
3502	碧水流	无	3502	30															愤怒消耗:-20%	
3503	千堆雪	无	3503	30																
3504	横剑	无	3504	30																
3505	怒气	无	3505	30																
3601	形影	无	3601	30																
3602	移形	无	3602	30																
3603	绕指柔	无	3603	30														phyReCrit:1|magReCrit:1		
3604	疏雨	无	3604	30																
3401	不著	无	3401	30																
3402	真力	无	3402	30																
3403	同尘	无	3403	30														hpMax:100+LV*2		
3404	坚志	无	3404	30																概率:3
3405	拂衣	无	3405	30																概率:3
3901	朔气	无	3901	30																
3902	玉壶冰	无	3902	30																
4001	仰聆玉章	治疗	4001	30		己方	1							60						
4002	折节死生	治疗	4002	30		己方	1							90						
4003	清风入松	治疗	4003	30		自己	1							60						
4004	一蓑风雨	治疗	4004	30		自己	1							130						
4005	钟鼓馔玉	治疗	4005	30		己方	99							90						
4006	绿蚁红泥	治疗	4006	30		己方	99							135						
4007	金灶仙桃	复活	4007	30		己方	1							60						
4008	洗尽尘缘	复活	4008	30		己方	1							90						
4009	风起鹤归	复活	4009	30		己方	1							120						
4010	海上明月	复活	4010	30		己方	99							120						
4011	青松翠叶	复活	4011	30		己方	99							150						
4012	俯仰自得	增益	4012	30		自己	1							60						真气:mpMax*10/100+150
4013	万世不竭	增益	4013	30		自己	1							90						真气:mpMax*15/100+250
4014	碧山孤月	减益	4014	30		任意	99							100						
4015	清溪水色	增益	4015	30		己方	1							50						
4016	白鹿青崖	增益	4016	30		己方	1							100						生命:hpMaxV*25/100|上限:VLV*12
4017	松月夜凉	增益	4017	30		己方	99							125						
4018	荷风竹露	增益	4018	30		己方	99							150						生命:hpMaxV*15/100|上限:VLV*12
4019	青莲净心	减益	4019	30		敌方	1							45						愤怒:55
4020	霜凄万木	减益	4020	30		敌方	4		3			100		100			201			
4021	挥刃弯弓	物理近攻	4021	30		敌方	1					100		80						伤害系数:1.2|真气:mpV*20/100
4022	摧眉折腰	减益	4022	30		敌方	1					100		40						符能:60
4023	远树寒烟	减益	4023	30		敌方	1		3			100		60			202			概率:70
4024	净扫胡尘	增益	4024	30		己方	1		99			100		40			203			
4025	吴钩霜雪	增益	4025	30		己方	99		99			100		70			204			
4026	江海凝光	增益	4026	30		己方	1		99			100		40			205			
4027	长风破浪	增益	4027	30		己方	99		99			100		80			206			
4028	秋水流光	增益	4028	30		己方	1		99			100		40			207			
4029	振衣千仞	增益	4029	30		己方	99		99			100		70			208			
4030	金铃绿章	增益	4030	30		己方	1		99			100		40			209			
4031	百胜金甲	增益	4031	30		己方	99		99			100		80			210			
4032	放下屠刀	减益	4032	30		敌方	1		99			100		30			211			
4033	剑覆秋霜	减益	4033	30		敌方	99		99			100		100			212			
4034	落木萧萧	减益	4034	30		敌方	1		99			100		35			213			
4035	铁衣难着	减益	4035	30		敌方	99		99			100		80			214			
4036	沾衣欲湿	减益	4036	30		敌方	1		99			100		30			215			
4037	四座无言	减益	4037	30		敌方	99		99			100		100			216			
4038	天寒日暮	减益	4038	30		敌方	1		99			100		35			217			
4039	满堂花醉	减益	4039	30		敌方	99		99			100		80			218			
