#-*-coding:utf-8-*-
#作者:叶伟龙@龙川县赤光镇
def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'没有编号为{}的食品'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)
#导表开始
gdData={
	220001:{"名称":"乌麻饼","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":0,"叠加上限":1,"效果":{"生命":"2000"},"使用1":1},
	220002:{"名称":"罗汉上素","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":10,"叠加上限":1,"效果":{"生命":"PL*60+2000"},"服务端描述":"[功效]生命恢复=$hp","使用1":1},
	220003:{"名称":"黄精炖蛋","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":10,"叠加上限":1,"效果":{"真气":"PL*60+2000"},"服务端描述":"[功效]真气回复=$mp","使用1":1},
	220004:{"名称":"冰糖仙莲","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":10,"叠加上限":1,"效果":{"寿命":"PL*0.5+10"},"服务端描述":"[功效]增加异兽寿命=$life","使用1":1},
	220005:{"名称":"枸杞巴戟酒","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":10,"叠加上限":1,"效果":{"愤怒1":"PL*0.4+10","愤怒2":"PL*0.6+10"},"服务端描述":"[功效]战斗内愤怒恢复=$sp1，战斗外愤怒恢复=$sp2","使用1":1,"使用2":1},
	220006:{"名称":"八珍玉食","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":10,"叠加上限":1,"效果":{"生命":"PL*0.4+10","真气":"PL*32+1000"},"服务端描述":"[功效]生命恢复=$hp，真气恢复$mp","使用1":1},
	220007:{"名称":"牛奶茯苓霜","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":10,"叠加上限":1,"效果":{"寿命":"PL*2+50"},"服务端描述":"[功效]增加异兽寿命=$life","使用1":1},
	220008:{"名称":"玉液琼浆","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":10,"叠加上限":1,"效果":{"愤怒1":"PL*1"},"服务端描述":"[功效]战斗内恢复愤怒=$sp1，并降低3-4回合物法防御力","使用2":1},
	220009:{"名称":"帝王浆","绑定":0,"出售价格":0,"回收价格":0,"炼化灵气":10,"叠加上限":1,"效果":{"符能":"PL*0.6+10"},"服务端描述":"[功效]战斗内符能恢复=$fn","使用2":1},
}
#导表结束

def afterHotUpdate():
	props.load.initModule()#重新建立编号与模块的映射关系

import props.load