# -*- coding: utf-8 -*-
from activity.object import Activity as customActivity

#导表开始
class Activity(customActivity):

	npcInfo = {
		1001:{"名称":"深山肥鸡","造型":"3005(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,105,60,8"},
		1002:{"名称":"深山菜花","造型":"3006(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,88,64,8"},
		1003:{"名称":"深山小狐","造型":"3008(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,111,48,8"},
		1004:{"名称":"无辜海龟","造型":"3004(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,84,46,8"},
		1005:{"名称":"迷路山猫","造型":"3007(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,75,23,8"},
		1006:{"名称":"成精麻雀","造型":"3005(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,86,15,8"},
		1007:{"名称":"野菜妹妹","造型":"3006(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,88,7,8"},
		1008:{"名称":"红顶仙鹤","造型":"3013(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,74,14,8"},
		1009:{"名称":"山贼","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,59,19,8"},
		1010:{"名称":"下凡仙子","造型":"3009(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,46,17,8"},
		1011:{"名称":"悬崖苍鹰","造型":"3011(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,31,19,8"},
		1012:{"名称":"巨型灵猿","造型":"3014(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,24,26,8"},
		1013:{"名称":"百年毒蟒","造型":"3012(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,25,34,8"},
		1014:{"名称":"山贼老大","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,26,40,8"},
		1015:{"名称":"毒公子","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,47,40,8"},
		1016:{"名称":"燕娘子","造型":"4007(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,25,51,8"},
		1017:{"名称":"糊涂大侠","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,20,63,8"},
		1018:{"名称":"胡闹和尚","造型":"4004(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,35,40,8"},
		1019:{"名称":"荒唐少爷","造型":"4504(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,56,19,8"},
		1020:{"名称":"红莲妖童","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,75,20,8"},
		1021:{"名称":"大刀队长","造型":"4003(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,83,13,8"},
		1022:{"名称":"大力金刚","造型":"4005(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,85,48,8"},
		1023:{"名称":"大姐","造型":"4508(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,93,53,8"},
		1024:{"名称":"深渊蛇王","造型":"3012(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,105,44,8"},
		1025:{"名称":"浪剑客","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"4020,86,70,8"},
	}

	eventInfo = {
		1001:{"回复":"F1001","成功":"R2001,DONE"},
		1002:{"回复":"F1002","成功":"R2002,DONE"},
		1003:{"回复":"F1003","成功":"R2003,DONE"},
		1004:{"回复":"F1004","成功":"R2004,DONE"},
		1005:{"回复":"F1005","成功":"R2005,DONE"},
		1006:{"回复":"F1006","成功":"R2006,DONE"},
		1007:{"回复":"F1007","成功":"R2007,DONE"},
		1008:{"回复":"F1008","成功":"R2008,DONE"},
		1009:{"回复":"F1009","成功":"R2009,DONE"},
		1010:{"回复":"F1010","成功":"R2010,DONE,BOX3001"},
		1011:{"回复":"F1011","成功":"R2011,DONE"},
		1012:{"回复":"F1012","成功":"R2012,DONE"},
		1013:{"回复":"F1013","成功":"R2013,DONE"},
		1014:{"回复":"F1014","成功":"R2014,DONE"},
		1015:{"回复":"F1015","成功":"R2015,DONE,BOX3002"},
		1016:{"回复":"F1016","成功":"R2016,DONE"},
		1017:{"回复":"F1017","成功":"R2017,DONE"},
		1018:{"回复":"F1018","成功":"R2018,DONE"},
		1019:{"回复":"F1019","成功":"R2019,DONE"},
		1020:{"回复":"F1020","成功":"R2020,DONE,BOX3002"},
		1021:{"回复":"F1021","成功":"R2021,DONE"},
		1022:{"回复":"F1022","成功":"R2022,DONE"},
		1023:{"回复":"F1023","成功":"R2023,DONE"},
		1024:{"回复":"F1024","成功":"R2024,DONE"},
		1025:{"回复":"F1025","成功":"R2025,DONE,BOX3003"},
	}

	rewardInfo = {
		2001:{"经验":lambda :17000,"宠物经验":lambda :25500,"银币":lambda :3330,"物品":[4001]},
		2002:{"经验":lambda :18405,"宠物经验":lambda :27607,"银币":lambda :3387,"物品":[4001]},
		2003:{"经验":lambda :19870,"宠物经验":lambda :29805,"银币":lambda :3444,"物品":[4001]},
		2004:{"经验":lambda :21395,"宠物经验":lambda :32092,"银币":lambda :3501,"物品":[4001]},
		2005:{"经验":lambda :22980,"宠物经验":lambda :34470,"银币":lambda :3558,"物品":[4001]},
		2006:{"经验":lambda :24625,"宠物经验":lambda :36937,"银币":lambda :3615,"物品":[4001]},
		2007:{"经验":lambda :26330,"宠物经验":lambda :39495,"银币":lambda :3672,"物品":[4001]},
		2008:{"经验":lambda :28095,"宠物经验":lambda :42142,"银币":lambda :3729,"物品":[4001]},
		2009:{"经验":lambda :29920,"宠物经验":lambda :44880,"银币":lambda :3786,"物品":[4001]},
		2010:{"经验":lambda :31805,"宠物经验":lambda :47707,"银币":lambda :3843},
		2011:{"经验":lambda :33750,"宠物经验":lambda :50625,"银币":lambda :3900,"物品":[4001]},
		2012:{"经验":lambda :35755,"宠物经验":lambda :53632,"银币":lambda :3957,"物品":[4001]},
		2013:{"经验":lambda :37820,"宠物经验":lambda :56730,"银币":lambda :4014,"物品":[4001]},
		2014:{"经验":lambda :39945,"宠物经验":lambda :59917,"银币":lambda :4071,"物品":[4001]},
		2015:{"经验":lambda :42130,"宠物经验":lambda :63195,"银币":lambda :4128},
		2016:{"经验":lambda :44375,"宠物经验":lambda :66562,"银币":lambda :4185,"物品":[4001]},
		2017:{"经验":lambda :46680,"宠物经验":lambda :70020,"银币":lambda :4242,"物品":[4001]},
		2018:{"经验":lambda :49045,"宠物经验":lambda :73567,"银币":lambda :4299,"物品":[4001]},
		2019:{"经验":lambda :51470,"宠物经验":lambda :77205,"银币":lambda :4356,"物品":[4001]},
		2020:{"经验":lambda :54700,"宠物经验":lambda :82050,"银币":lambda :4420},
		2021:{"经验":lambda :58050,"宠物经验":lambda :87075,"银币":lambda :4484,"物品":[4001]},
		2022:{"经验":lambda :61520,"宠物经验":lambda :92280,"银币":lambda :4548,"物品":[4001]},
		2023:{"经验":lambda :65110,"宠物经验":lambda :97665,"银币":lambda :4612,"物品":[4001]},
		2024:{"经验":lambda :68820,"宠物经验":lambda :103230,"银币":lambda :4676,"物品":[4001]},
		2025:{"经验":lambda :72650,"宠物经验":lambda :108975,"银币":lambda :4740},
	}

	rewardPropsInfo = {
		3001:(
			{"权重":100,"物品":"202024","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"202025","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246001","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246002","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246003","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246004","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246005","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246006","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246007","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246008","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246009","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246010","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"221401","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"221403","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"230011","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"230012","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224103","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224104","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224105","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224106","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224107","数量":"2","绑定":0,"传闻":0},
		),
		3002:(
			{"权重":20,"物品":"202043","数量":"1","绑定":0,"传闻":0},
			{"权重":40,"物品":"202044","数量":"1","绑定":0,"传闻":0},
			{"权重":40,"物品":"202045","数量":"1","绑定":0,"传闻":0},
			{"权重":40,"物品":"202042","数量":"1","绑定":0,"传闻":0},
			{"权重":40,"物品":"202049","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"230011","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"230012","数量":"1","绑定":0,"传闻":0},
			{"权重":150,"物品":"224103","数量":"2","绑定":0,"传闻":0},
			{"权重":150,"物品":"224104","数量":"2","绑定":0,"传闻":0},
			{"权重":150,"物品":"224105","数量":"2","绑定":0,"传闻":0},
			{"权重":150,"物品":"224106","数量":"2","绑定":0,"传闻":0},
			{"权重":150,"物品":"224107","数量":"2","绑定":0,"传闻":0},
			{"权重":150,"物品":"224108","数量":"1","绑定":0,"传闻":0},
		),
		3003:(
			{"权重":57,"物品":"224101","数量":"1","绑定":0,"传闻":0},
			{"权重":3,"物品":"224102","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":25,"物品":"230011","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"230012","数量":"2","绑定":0,"传闻":0},
		),
		4001:(
			{"权重":100,"物品":"202024","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"202025","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246001","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246002","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246003","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246004","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246005","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246006","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246007","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246008","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246009","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"246010","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"221401","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"221403","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"230011","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"230012","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224103","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224104","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224105","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224106","数量":"2","绑定":0,"传闻":0},
			{"权重":200,"物品":"224107","数量":"2","绑定":0,"传闻":0},
			{"权重":2600,"物品":"0","数量":"0","绑定":0,"传闻":0},
		),
	}

	groupInfo = {
	}

	chatInfo = {
		4001:'''你今天已经没有挑战次数了，请明天再来！''',
		4002:'''你今天已通关所有关卡，请你明天再来吧！''',
		4003:'''1.试炼幻境，单日首次通关关卡均可获得奖励\n2.每天可在试炼幻境战斗中战败2次\n3.每周试炼幻境排行前十的玩家获得特殊奖励\n4.每日零点重置关卡''',
		4004:'''挑战关卡战败，扣除1次挑战次数''',
		4005:'''挑战次数不足''',
		4006:'''幻境只允许单人挑战，退出组队再来！''',
		4007:'''你的实力不足以进入这里，等你#C04等级≥40级#n再来吧。''',
		4008:'''挑战进度已刷新，请退出重新开始挑战！''',
		5001:'''#C01$roleName#n成功通过#L1<14,15>*[幻境试炼]*02#n，获得$lnkProps，恭喜他#29''',
		7001:'''放心，我会让你们好起来的''',
		7002:'''漫天剧毒你们还能挣扎多久''',
		7003:'''妖莲降世，欲望之火会束缚着你''',
		7004:'''十年磨一剑，霜刃未曾试。今日把示君，谁有不平事？''',
	}

	branchInfo = {
	}

	fightInfo = {
		1001:(
			{"类型":1,"名称":"深山肥鸡","造型":"3005(0,1,0,0,0)","能力编号":"1011","数量":"1","技能":(1122,1123,)},
			{"类型":0,"名称":"小傻龟","造型":"3004(0,1,0,0,0)","能力编号":"1012","数量":"2","技能":(1112,1131,)},
			{"类型":0,"名称":"小帅狐","造型":"3008(0,1,0,0,0)","能力编号":"1013","数量":"2","技能":(5407,5110,)},
		),
		1002:(
			{"类型":1,"名称":"深山菜花","造型":"3006(0,1,0,0,0)","能力编号":"1021","数量":"1","技能":(1212,1233,)},
			{"类型":0,"名称":"老猴剑客","造型":"3007(0,1,0,0,0)","能力编号":"1022","数量":"2","技能":(5119,5217,)},
			{"类型":0,"名称":"变异麻雀","造型":"3005(0,1,0,0,0)","能力编号":"1023","数量":"2","技能":(1312,5101,)},
		),
		1003:(
			{"类型":1,"名称":"深山小狐","造型":"3008(0,1,0,0,0)","能力编号":"1031","数量":"1","技能":(5407,5110,5102,)},
			{"类型":0,"名称":"狐狸小弟","造型":"3008(0,1,0,0,0)","能力编号":"1032","数量":"2","技能":(5407,5110,)},
			{"类型":0,"名称":"麻雀小弟","造型":"3005(0,1,0,0,0)","能力编号":"1033","数量":"2","技能":(1312,5101,)},
		),
		1004:(
			{"类型":1,"名称":"无辜海龟","造型":"3004(0,1,0,0,0)","能力编号":"1041","数量":"1","技能":(5406,5202,)},
			{"类型":0,"名称":"老猴小弟","造型":"3007(0,1,0,0,0)","能力编号":"1042","数量":"2","技能":(5107,5109,)},
			{"类型":0,"名称":"狐狸小弟","造型":"3008(0,1,0,0,0)","能力编号":"1043","数量":"2","技能":(5407,5110,5102,)},
		),
		1005:(
			{"类型":1,"名称":"迷路山猴","造型":"3007(0,1,0,0,0)","能力编号":"1051","数量":"1","技能":(5201,5219,5212,)},
			{"类型":0,"名称":"山猴侍女","造型":"3006(0,1,0,0,0)","能力编号":"1052","数量":"1","技能":(1621,1631,)},
			{"类型":0,"名称":"麻雀小弟","造型":"3005(0,1,0,0,0)","能力编号":"1053","数量":"3","技能":(1312,5101,)},
		),
		1006:(
			{"类型":1,"名称":"成精麻雀","造型":"3005(0,1,0,0,0)","能力编号":"1061","数量":"1","技能":(1122,1123,)},
			{"类型":0,"名称":"成精陆龟","造型":"3004(0,1,0,0,0)","能力编号":"1062","数量":"2","技能":(1312,5101,)},
			{"类型":0,"名称":"成精狐狸","造型":"3008(0,1,0,0,0)","能力编号":"1063","数量":"2","技能":(5407,5110,5102,)},
		),
		1007:(
			{"类型":1,"名称":"野菜妹妹","造型":"3006(0,1,0,0,0)","能力编号":"1071","数量":"1","技能":(1621,1631,)},
			{"类型":0,"名称":"野菜姐姐","造型":"3006(0,1,0,0,0)","能力编号":"1072","数量":"2","技能":(5408,5102,)},
			{"类型":0,"名称":"小乌龟龟","造型":"3004(0,1,0,0,0)","能力编号":"1073","数量":"2","技能":(1512,1523,)},
		),
		1008:(
			{"类型":1,"名称":"红顶仙鹤","造型":"3013(0,1,0,0,0)","能力编号":"1081","数量":"1","技能":(1422,1431,1423,1412,)},
			{"类型":0,"名称":"展翅大鹏","造型":"3011(0,1,0,0,0)","能力编号":"1082","数量":"2","技能":(1531,5213,5102,)},
			{"类型":0,"名称":"山间幼鸟","造型":"3005(0,1,0,0,0)","能力编号":"1083","数量":"1","技能":(1421,5107,1412,)},
			{"类型":0,"名称":"山间肥鸟","造型":"3005(0,1,0,0,0)","能力编号":"1084","数量":"1","技能":(1621,1612,)},
		),
		1009:(
			{"类型":1,"名称":"山贼","造型":"5002(0,1,0,0,0)","能力编号":"1091","数量":"1","技能":(1321,1322,5103,)},
			{"类型":0,"名称":"山贼小弟","造型":"5002(0,1,0,0,0)","能力编号":"1092","数量":"3","技能":(1112,1131,)},
			{"类型":0,"名称":"草灵","造型":"3006(0,1,0,0,0)","能力编号":"1093","数量":"1","技能":(5408,5102,)},
		),
		1010:(
			{"类型":1,"名称":"下凡仙子","造型":"3009(0,1,0,0,0)","能力编号":"1101","数量":"1","技能":(1631,1612,1621,6419,5502,)},
			{"类型":0,"名称":"老猴护卫","造型":"3007(0,1,0,0,0)","能力编号":"1102","数量":"2","技能":(5201,5219,5212,)},
			{"类型":0,"名称":"陆龟护卫","造型":"3004(0,1,0,0,0)","能力编号":"1103","数量":"2","技能":(5406,5202,)},
		),
		1011:(
			{"类型":1,"名称":"悬崖苍鹰","造型":"3011(0,1,0,0,0)","能力编号":"1111","数量":"1","技能":(1532,5213,5102,)},
			{"类型":0,"名称":"悬崖麻雀","造型":"3005(0,1,0,0,0)","能力编号":"1112","数量":"2","技能":(5419,5110,)},
			{"类型":0,"名称":"悬崖妖鹤","造型":"3013(0,1,0,0,0)","能力编号":"1113","数量":"1","技能":(1521,1512,)},
			{"类型":0,"名称":"悬崖仙鹤","造型":"3013(0,1,0,0,0)","能力编号":"1114","数量":"1","技能":(1621,1631,)},
		),
		1012:(
			{"类型":1,"名称":"巨型灵猿","造型":"3014(0,1,0,0,0)","能力编号":"1121","数量":"1","技能":(1512,1532,)},
			{"类型":0,"名称":"大熊","造型":"3010(0,1,0,0,0)","能力编号":"1122","数量":"1","技能":(5420,5201,)},
			{"类型":0,"名称":"二熊","造型":"3010(0,1,0,0,0)","能力编号":"1123","数量":"2","技能":(5415,5201,)},
			{"类型":0,"名称":"灵猿","造型":"3014(0,1,0,0,0)","能力编号":"1124","数量":"1","技能":(1621,1631,)},
		),
		1013:(
			{"类型":1,"名称":"百年毒蟒","造型":"3012(0,1,0,0,0)","能力编号":"1131","数量":"1","技能":(1512,5202,)},
			{"类型":0,"名称":"十年毒蟒","造型":"3012(0,1,0,0,0)","能力编号":"1132","数量":"3","技能":(5210,1532,)},
			{"类型":0,"名称":"毒蟒","造型":"3012(0,1,0,0,0)","能力编号":"1133","数量":"1","技能":(1421,1431,)},
		),
		1014:(
			{"类型":1,"名称":"山贼老大","造型":"5002(0,1,0,0,0)","能力编号":"1141","数量":"1","技能":(1321,5201,5122,)},
			{"类型":0,"名称":"山贼小弟","造型":"5002(0,1,0,0,0)","能力编号":"1142","数量":"2","技能":(1112,1131,)},
			{"类型":0,"名称":"望风山贼","造型":"5002(0,1,0,0,0)","能力编号":"1143","数量":"1","技能":(1621,5108,)},
			{"类型":0,"名称":"山贼师爷","造型":"4504(0,1,0,0,0)","能力编号":"1144","数量":"1","技能":(1421,5107,)},
		),
		1015:(
			{"类型":1,"名称":"毒公子","造型":"4006(0,1,0,0,0)","能力编号":"1151","数量":"1","技能":(1412,1421,5107,6420,5502,)},
			{"类型":0,"名称":"大毒蛇","造型":"3012(0,1,0,0,0)","能力编号":"1152","数量":"2","技能":(1512,5202,)},
			{"类型":0,"名称":"鹤顶红","造型":"3013(0,1,0,0,0)","能力编号":"1153","数量":"1","技能":(1421,1512,)},
			{"类型":0,"名称":"毒蛇","造型":"3012(0,1,0,0,0)","能力编号":"1154","数量":"1","技能":(1621,1531,)},
		),
		1016:(
			{"类型":1,"名称":"燕娘子","造型":"4007(0,1,0,0,0)","能力编号":"1161","数量":"1","技能":(1113,1132,5201,)},
			{"类型":0,"名称":"黑风山贼","造型":"5002(0,1,0,0,0)","能力编号":"1162","数量":"2","技能":(1321,5201,5122,)},
			{"类型":0,"名称":"山贼喽啰","造型":"5002(0,1,0,0,0)","能力编号":"1163","数量":"1","技能":(1521,1512,)},
			{"类型":0,"名称":"山贼师爷","造型":"4504(0,1,0,0,0)","能力编号":"1164","数量":"1","技能":(1421,5107,)},
		),
		1017:(
			{"类型":1,"名称":"糊涂大侠","造型":"4502(0,1,0,0,0)","能力编号":"1171","数量":"1","技能":(1112,1131,5222,)},
			{"类型":0,"名称":"鹤仙人","造型":"3013(0,1,0,0,0)","能力编号":"1172","数量":"2","技能":(5405,5202,)},
			{"类型":0,"名称":"灵猿","造型":"3014(0,1,0,0,0)","能力编号":"1173","数量":"2","技能":(5413,5219,)},
		),
		1018:(
			{"类型":1,"名称":"胡闹和尚","造型":"4004(0,1,0,0,0)","能力编号":"1181","数量":"1","技能":(1621,1631,5208,)},
			{"类型":0,"名称":"感化毒蛇","造型":"3012(0,1,0,0,0)","能力编号":"1182","数量":"1","技能":(1512,5233,5234,)},
			{"类型":0,"名称":"护法金刚","造型":"4005(0,1,0,0,0)","能力编号":"1183","数量":"2","技能":(5412,5235,5233,)},
			{"类型":0,"名称":"金鹏","造型":"3011(0,1,0,0,0)","能力编号":"1184","数量":"1","技能":(1531,5233,5234,)},
		),
		1019:(
			{"类型":1,"名称":"荒唐少爷","造型":"4504(0,1,0,0,0)","能力编号":"1191","数量":"1","技能":(1212,1233,5207,5230,)},
			{"类型":0,"名称":"左擎苍","造型":"3011(0,1,0,0,0)","能力编号":"1192","数量":"2","技能":(1531,5213,5202,)},
			{"类型":0,"名称":"右牵黄","造型":"3010(0,1,0,0,0)","能力编号":"1193","数量":"2","技能":(1312,5201,5209,)},
		),
		1020:(
			{"类型":1,"名称":"红莲妖童","造型":"4001(0,1,0,0,0)","能力编号":"1201","数量":"1","技能":(5407,5213,5202,6421,5502,)},
			{"类型":0,"名称":"大刀护卫","造型":"4003(0,1,0,0,0)","能力编号":"1202","数量":"3","技能":(1321,1323,5201,)},
			{"类型":0,"名称":"侍女","造型":"4506(0,1,0,0,0)","能力编号":"1203","数量":"1","技能":(1421,1431,1432,1412,)},
		),
		1021:(
			{"类型":1,"名称":"大刀队长","造型":"4003(0,1,0,0,0)","能力编号":"1211","数量":"1","技能":(1321,1323,5201,)},
			{"类型":0,"名称":"大刀教官","造型":"4003(0,1,0,0,0)","能力编号":"1212","数量":"2","技能":(1321,1323,5201,)},
			{"类型":0,"名称":"大刀师妹","造型":"4002(0,1,0,0,0)","能力编号":"1213","数量":"2","技能":(1321,1323,5201,)},
		),
		1022:(
			{"类型":1,"名称":"大力金刚","造型":"4005(0,1,0,0,0)","能力编号":"1221","数量":"1","技能":(1321,1323,5201,5208,)},
			{"类型":0,"名称":"大力神","造型":"4005(0,1,0,0,0)","能力编号":"1222","数量":"1","技能":(1313,1312,5201,5208,)},
			{"类型":0,"名称":"守护神","造型":"4005(0,1,0,0,0)","能力编号":"1223","数量":"1","技能":(1612,1621,1631,5208,)},
			{"类型":0,"名称":"飞天虎","造型":"4005(0,1,0,0,0)","能力编号":"1224","数量":"1","技能":(1532,1523,1521,5208,)},
			{"类型":0,"名称":"大无畏","造型":"4005(0,1,0,0,0)","能力编号":"1225","数量":"1","技能":(1531,1512,1522,5208,)},
		),
		1023:(
			{"类型":1,"名称":"大姐","造型":"4508(0,1,0,0,0)","能力编号":"1231","数量":"1","技能":(1621,5205,5252,)},
			{"类型":0,"名称":"二姐","造型":"4509(0,1,0,0,0)","能力编号":"1232","数量":"1","技能":(1321,5239,5240,)},
			{"类型":0,"名称":"三姐","造型":"4506(0,1,0,0,0)","能力编号":"1233","数量":"1","技能":(1122,1132,1131,)},
			{"类型":0,"名称":"四姐","造型":"4007(0,1,0,0,0)","能力编号":"1234","数量":"1","技能":(1213,1221,1223,)},
			{"类型":0,"名称":"五妹","造型":"4008(0,1,0,0,0)","能力编号":"1235","数量":"1","技能":(1621,1613,1631,1623,)},
		),
		1024:(
			{"类型":1,"名称":"深渊蛇王","造型":"3012(0,1,0,0,0)","能力编号":"1241","数量":"1","技能":(1513,1521,5202,)},
			{"类型":0,"名称":"深渊巨蛇","造型":"3012(0,1,0,0,0)","能力编号":"1242","数量":"4","技能":(1533,5202,5210,)},
		),
		1025:(
			{"类型":1,"名称":"浪剑客","造型":"4502(0,1,0,0,0)","能力编号":"1251","数量":"1","技能":(1112,5203,5208,6208,5502,)},
			{"类型":0,"名称":"师妹","造型":"4002(0,1,0,0,0)","能力编号":"1252","数量":"2","技能":(1421,1412,1431,)},
			{"类型":0,"名称":"师弟","造型":"4504(0,1,0,0,0)","能力编号":"1253","数量":"1","技能":(1122,1123,5207,)},
			{"类型":0,"名称":"师弟","造型":"4502(0,1,0,0,0)","能力编号":"1254","数量":"1","技能":(1621,1613,1631,)},
		),
	}

	ableInfo = {
		1011:{"等级":"40","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1012:{"等级":"40","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1013:{"等级":"40","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1021:{"等级":"41","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1022:{"等级":"41","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1023:{"等级":"41","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1031:{"等级":"42","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1032:{"等级":"42","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1033:{"等级":"42","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1041:{"等级":"43","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1042:{"等级":"43","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1043:{"等级":"43","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1051:{"等级":"44","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1052:{"等级":"44","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1053:{"等级":"44","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1061:{"等级":"45","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1062:{"等级":"45","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1063:{"等级":"45","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1071:{"等级":"46","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1072:{"等级":"46","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1073:{"等级":"46","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1081:{"等级":"47","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1082:{"等级":"47","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1083:{"等级":"47","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1084:{"等级":"47","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1091:{"等级":"48","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1092:{"等级":"48","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1093:{"等级":"48","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1101:{"等级":"49","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1102:{"等级":"49","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1103:{"等级":"49","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1111:{"等级":"50","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1112:{"等级":"50","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1113:{"等级":"50","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1114:{"等级":"50","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1121:{"等级":"51","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1122:{"等级":"51","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1123:{"等级":"51","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1124:{"等级":"51","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1131:{"等级":"52","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1132:{"等级":"52","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1133:{"等级":"52","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1141:{"等级":"53","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1142:{"等级":"53","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1143:{"等级":"53","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1144:{"等级":"53","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1151:{"等级":"54","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1152:{"等级":"54","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1153:{"等级":"54","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1154:{"等级":"54","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1161:{"等级":"55","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1162:{"等级":"55","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1163:{"等级":"55","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1164:{"等级":"55","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1171:{"等级":"56","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1172:{"等级":"56","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1173:{"等级":"56","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1181:{"等级":"57","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1182:{"等级":"57","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1183:{"等级":"57","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1184:{"等级":"57","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1191:{"等级":"58","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1192:{"等级":"58","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1193:{"等级":"58","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1201:{"等级":"60","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1202:{"等级":"60","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1203:{"等级":"60","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1211:{"等级":"62","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1212:{"等级":"62","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1213:{"等级":"62","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1221:{"等级":"64","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1222:{"等级":"64","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1223:{"等级":"64","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1224:{"等级":"64","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1225:{"等级":"64","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1231:{"等级":"66","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1232:{"等级":"66","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1233:{"等级":"66","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1234:{"等级":"66","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1235:{"等级":"66","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1241:{"等级":"68","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1242:{"等级":"68","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1251:{"等级":"70","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1252:{"等级":"70","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1253:{"等级":"70","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1254:{"等级":"70","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
	}

	lineupInfo = {
	}

	sceneInfo = {
		4020:{"名称":"幻境","资源":2040,"着陆点x":101,"着陆点y":56},
	}

	configInfo = {
	}

	stageData = {
		1:{"npc":1001,"事件":1001,"跳过关卡":0,"介绍":"我是怪物1","特殊关卡":0},
		2:{"npc":1002,"事件":1002,"跳过关卡":0,"介绍":"我是怪物2","特殊关卡":0},
		3:{"npc":1003,"事件":1003,"跳过关卡":0,"介绍":"我是怪物3","特殊关卡":0},
		4:{"npc":1004,"事件":1004,"跳过关卡":0,"介绍":"我是怪物4","特殊关卡":0},
		5:{"npc":1005,"事件":1005,"跳过关卡":0,"介绍":"我是怪物5","特殊关卡":0},
		6:{"npc":1006,"事件":1006,"跳过关卡":0,"介绍":"我是怪物6","特殊关卡":0},
		7:{"npc":1007,"事件":1007,"跳过关卡":0,"介绍":"我是怪物7","特殊关卡":0},
		8:{"npc":1008,"事件":1008,"跳过关卡":0,"介绍":"我是怪物8","特殊关卡":0},
		9:{"npc":1009,"事件":1009,"跳过关卡":0,"介绍":"我是怪物9","特殊关卡":0},
		10:{"npc":1010,"事件":1010,"跳过关卡":5,"介绍":"我是怪物10","特殊关卡":1},
		11:{"npc":1011,"事件":1011,"跳过关卡":5,"介绍":"我是怪物11","特殊关卡":0},
		12:{"npc":1012,"事件":1012,"跳过关卡":5,"介绍":"我是怪物12","特殊关卡":0},
		13:{"npc":1013,"事件":1013,"跳过关卡":5,"介绍":"我是怪物13","特殊关卡":0},
		14:{"npc":1014,"事件":1014,"跳过关卡":5,"介绍":"我是怪物14","特殊关卡":0},
		15:{"npc":1015,"事件":1015,"跳过关卡":10,"介绍":"我是怪物15","特殊关卡":1},
		16:{"npc":1016,"事件":1016,"跳过关卡":10,"介绍":"我是怪物16","特殊关卡":0},
		17:{"npc":1017,"事件":1017,"跳过关卡":10,"介绍":"我是怪物17","特殊关卡":0},
		18:{"npc":1018,"事件":1018,"跳过关卡":10,"介绍":"我是怪物18","特殊关卡":0},
		19:{"npc":1019,"事件":1019,"跳过关卡":10,"介绍":"我是怪物19","特殊关卡":0},
		20:{"npc":1020,"事件":1020,"跳过关卡":15,"介绍":"我是怪物20","特殊关卡":1},
		21:{"npc":1021,"事件":1021,"跳过关卡":15,"介绍":"我是怪物21","特殊关卡":0},
		22:{"npc":1022,"事件":1022,"跳过关卡":15,"介绍":"我是怪物22","特殊关卡":0},
		23:{"npc":1023,"事件":1023,"跳过关卡":15,"介绍":"我是怪物23","特殊关卡":0},
		24:{"npc":1024,"事件":1024,"跳过关卡":15,"介绍":"我是怪物24","特殊关卡":0},
		25:{"npc":1025,"事件":1025,"跳过关卡":15,"介绍":"我是怪物25","特殊关卡":1},
	}

	rankReward = {
		1:(
			{"物品":224204,"数量":1},
		),
		2:(
			{"物品":230103,"数量":1},
		),
		3:(
			{"物品":224108,"数量":1},
		),
		4:(
			{"物品":224203,"数量":1},
		),
		5:(
			{"物品":224202,"数量":1},
		),
		6:(
			{"物品":230101,"数量":1},
		),
		7:(
			{"物品":224201,"数量":1},
		),
		8:(
			{"物品":230102,"数量":1},
		),
		9:(
			{"物品":245001,"数量":1},
		),
		10:(
			{"物品":246051,"数量":1},
		),
	}
#导表结束

	def __init__(self, _id, name):
		customActivity.__init__(self, _id, name)
		self.boxRewardIdx = {} # 翻牌奖励序号
		self.week = cycleData.cCycWeek(2,self.__dirtyEventHandler)#天变量

	def init(self):
		sceneObj = self.addScene(4020)
		sceneObj.eventOnEnter += self.onEnter
		sceneObj.eventOnLeave += self.onLeave
		self.initNpc()

	def save(self):
		data = customActivity.save(self)
		data["boxRewardIdx"] = self.boxRewardIdx

		dWeek=self.week.save()
		if dWeek:
			data['w']=dWeek
		return data
	
	def load(self, data):
		customActivity.load(self, data)
		self.boxRewardIdx = data.pop("boxRewardIdx",{})
		self.week.load(data.pop('w',{}))

	def maxStage(self):
		'''最大关卡
		'''
		return len(self.stageData)

	def isSpecialStage(self, stageNo):
		'''是否特殊关卡
		'''
		data = self.stageData.get(stageNo)
		if data:
			return data["特殊关卡"]

		return 0

	def isPassAll(self, who):
		'''是否全部通关
		'''
		return who.day.fetch("flStage") >= self.maxStage()

	def isFailAll(self, who):
		'''是否失败次数用完了
		'''
		return who.day.fetch("flFail",1) >= MAX_FIGHT

	def getFastTime(self, stageNo):
		'''最快通关时间
		'''
		data = self.week.fetch("fast")
		if not data or stageNo not in data:
			return 0

		return data[stageNo][0]

	def getFastName(self, stageNo):
		'''最快玩家
		'''
		data = self.week.fetch("fast")
		if not data or stageNo not in data:
			return ""

		return data[stageNo][1]

	def setFastTimeAndName(self, stageNo, time, name):
		'''设置最快时间和玩家
		'''
		fastTimeList = self.week.fetch("fast")
		if not fastTimeList:
			fastTimeList = {}

		fastTimeList[stageNo] = (time,name)
		self.week.set("fast",fastTimeList)

	def updateRoleTime(self, who, stageNo, time):
		'''更新个人时间
		'''
		typeFlag = "flTime%d" % stageNo
		fastTime = who.week.fetch(typeFlag)
		if not fastTime or time < fastTime:
			who.week.set(typeFlag,time)

	def enterScene(self, who):
		'''进入试炼幻境
		'''
		if not who.day.fetch("flenter"):
			who.day.set("flenter",1)
		sceneObj = self.getGameScene()
		if sceneObj:
			x, y = sceneObj.landingPoint()
			self.transfer(who, sceneObj.id, x, y)

	def leaveScene(self, who):
		'''离开试炼幻境
		'''
		sceneId, x, y = who.getLastRealPos()
		self.transfer(who, sceneId, x, y)

	def createScene(self, sceneIdx):
		'''创建虚拟场景
		'''
		info = self.getSceneInfo(sceneIdx)
		sceneObj = scene.new("活动", 0, info["名称"], info["资源"], info.get("小地图资源", 0),landX=info["着陆点x"],landY=info["着陆点y"],broadcastRole=1)
		sceneObj.idx = sceneIdx
		return sceneObj

	def getGameScene(self):
		'''活动场景
		'''
		return self.getSceneByIdx(4020)

	def isInGameScene(self, who):
		'''是否在活动场景
		'''	
		return who.sceneId == self.getGameScene().id

	def sendInfoMsg(self, who):
		'''发送幻境信息
		'''
		msg = packInfoMsg(who)
		who.endPoint.rpcFairylandInfo(**msg)

	def getMsg(self, who, stageNo, timeout):
		'''信息
		'''
		msg =  {}
		msg["iStageNo"] = stageNo
		msg["iFastTime"] = self.getFastTime(stageNo)
		msg["sFastName"] = self.getFastName(stageNo)
		msg["iMyTime"] = who.week.fetch("flTime%d" % stageNo)
		msg["bCanSkip"] = self.canAutoPass(who,stageNo)
		msg["iTimeOut"] = timeout
		return msg

	def canAutoPass(self, who, stageNo):
		'''能否自动跳过
		'''
		if stageNo <= who.day.fetch("flStage"):
			return False
		return stageNo <= self.getAutoPssStage(who)

	def getAutoPssStage(self, who):
		'''获得跳过关卡数
		'''
		stageNo = who.week.fetch("flStage")
		data = self.stageData.get(stageNo)
		if data:
			return data["跳过关卡"]

		return 0

	def autoPass(self, who, stageNo):
		'''自动通过
		'''
		if not who.day.fetch("flpass"):
			who.day.set("flpass",1)

		npcObj = self.getNpcByRole(who)
		if npcObj:
			self.doEventScript(who, npcObj, "成功")

	def getScriptHandler(self, script):
		m = re.match("BOX(\d+)", script)
		if m:
			args = m.groups()
			return boxReward, args
		return customActivity.getScriptHandler(self, script)

	def quest(self, who, stageNo):
		if not self.isInGameScene(who):
			self.enterScene(who)
			return
		npcObj = self.getNpcByRole(who)
		if not npcObj:
			return
		if self.isFailAll(who):
			self.doScript(who, npcObj, "D4005")
			return
		if not who.day.fetch("flenter"):
			self.doScript(who, npcObj, "D4008")
			return
		self.doEventScript(who, npcObj, "回复")

	def addNpc(self, npcIdx, typeFlag="npc", who=None):
		npcObj = template.Template.addNpc(self, npcIdx, typeFlag, who)
		self.getGameScene().addEntity(npcObj, npcObj.x, npcObj.y, npcObj.d)
		return npcObj

	def getNpcByRole(self, who):
		stageNo = who.day.fetch("flStage")
		if stageNo >= self.maxStage():
			return None
		npcIdx = self.stageData[stageNo+1]["npc"]
		return self.getNpcByIdx(npcIdx)

	def goAheadNpc(self, who):
		'''前往npc
		'''
		npcObj = self.getNpcByRole(who)
		if not npcObj:
			return

		if scene.isNearBy(npcObj,who):
			npcObj.doLook(who)
		else:
			scene.walkToEtt(who,npcObj)

	def newNpc(self, npcIdx, name, shape, who=None):
		'''创建Npc
		'''
		return Npc(self)

	def __rpcDelNpc(self, who, npcObj):
		who.endPoint.rpcEttLeave(npcObj.id)

	def __rpcAddNpc(self, who):
		npcObj = self.getNpcByRole(who)
		if npcObj:
			who.endPoint.send(npcObj.getSerialized1())

	def initNpc(self):
		'''初始化npc
		'''
		for stageNo,data in self.stageData.iteritems():
			npcIdx = self.stageData[stageNo]["npc"]
			event = self.stageData[stageNo]["事件"]
			npcObj = self.addNpc(npcIdx)
			npcObj.stageNo = stageNo
			self.bindEvent(npcIdx, event)

	def onWarWin(self, warObj, npcObj, w):
		'''战斗胜利时
		'''
		customActivity.onWarWin(self, warObj, npcObj, w)
		time = warObj.calTime()
		fastTime = self.getFastTime(npcObj.stageNo)
		if not fastTime or time < fastTime:
			self.setFastTimeAndName(npcObj.stageNo,time,w.name)

		who = getRole(w.id)
		if not who:
			return
		self.updateRoleTime(who,npcObj.stageNo,time)
		if who.fetch("flStage") < npcObj.stageNo:
			who.set("flStage",npcObj.stageNo)
		if not who.day.fetch("flpass"):
			time = who.day.add("flTime",time)
			oldStageNo,oldTime = who.week.fetch("flFast",(0,0))
			if npcObj.stageNo < oldStageNo:
				return
			if npcObj.stageNo == oldStageNo and time >= oldTime:
				return
			who.week.set("flFast",(npcObj.stageNo,time))
			rank.updateFairylandPointRank(who)

	def onMissionDone(self, who, npcObj):
		'''完成时
		'''
		stageNo = npcObj.stageNo

		oldStageNo = who.day.fetch("flStage")
		if stageNo > oldStageNo:
			who.day.set("flStage",stageNo)
			rpcChange(who,"stage")

		perPoint = activity.center.getPerActPoint(15)
		who.addActPoint(perPoint)

		oldStageNo = who.week.fetch("flStage")
		if stageNo > oldStageNo:
			who.week.set("flStage",stageNo)

		if not self.isInGameScene(who):
			return

		self.__rpcDelNpc(who,npcObj)
		if stageNo < self.maxStage():
			self.__rpcAddNpc(who)
			if not self.isSpecialStage(stageNo):
				gevent.spawn(goAheadNpc,who.id)

	def onWarFail(self, warObj, npcObj, w):
		'''失败时
		'''
		customActivity.onWarFail(self, warObj, npcObj, w)
		if hasattr(w,"isEscaped"):
			return
		who = getRole(w.id)
		if who:
			who.day.add("flFail",1)
			import activity.center
			activity.center.refreshTaskNpc(who)
			self.doScript(who, npcObj, "D4004")
			rpcChange(who,"count")

	def onCommand(self, w):
		if w.name != "浪剑客":
			return

		performId = self.getSpecialAI(w)
		if w.targetPerformId == performId:
			return

		if performId >= 100: # 法术攻击
			cmdType = CMD_TYPE_MAG
		elif performId > 0: # 普通物理攻击、防御等
			cmdType = performId
			performId = 0

		war.commands.setCommand(w.war, w, cmdType, performId=performId)

	def getSpecialAI(self, w):
		'''获得特殊AI
		'''
		if w.bout % 3 == 1:
			return 6208
		elif w.targetPerformId != 6208:
			return w.targetPerformId

		performId = CMD_TYPE_PHY

		performList = []
		for performObj in w.getPerformList():
			if performObj.id == 6208:
				continue
			if perform.isSEPerform(performObj.id): # 特技
				if w.hasApply("禁止特技"):
					continue
			elif w.hasApply("禁止法术"): # 法术
				continue
			performList.append(performObj.id)
		
		if len(performList):
			performId = performList[rand(len(performList))]
					
		if performId == CMD_TYPE_PHY and (w.hasApply("禁止物理攻击") or w.isLineupEye()):
			performId = CMD_TYPE_WAIT
					
		return performId


	def setBoxRewardIdx(self, who, rwdIdx):
		'''设置玩家的翻牌奖励序号
		'''
		if rwdIdx == 0 :
			self.boxRewardIdx.pop(who.id,0)
		else:
			self.boxRewardIdx[who.id] = rwdIdx
		self.markDirty()

	def getBoxRewardIdx(self, who):
		'''获得翻牌奖励序号
		'''
		return self.boxRewardIdx.get(who.id,0)

	def rewardBox(self, who, pos=0):
		'''获得翻牌奖励
		'''
		rwdIdx = self.getBoxRewardIdx(who)
		if not rwdIdx:
			return

		info = self.getRewardPropsInfo(rwdIdx)
		idx = chooseKey(info, key="权重")
		if idx is None:
			return
		self.setBoxRewardIdx(who,0)
		data = info[idx]
		propsNo	= int(data["物品"])
		amount = int(self.transCodeForReward(data["数量"], "数量", who))
		binded = data.get("绑定", 0)
		self.launchProps(who, propsNo, amount, binded)
		if data.get("传闻"):
			scriptStr = data["传闻"]
			if scriptStr.isdigit():
				scriptStr = "SM{}".format(scriptStr)
			self.doScript(who, None, scriptStr)

		if pos:
			rpcSendBoxRewardResult(self,who,pos,info,idx)

	def sendRankReward(self, roleId, rankNo):
		'''发送排行榜奖励
		'''
		rewardList = self.rankReward.get(rankNo)
		if not rewardList:
			return False

		propsObjList = []
		for data in rewardList:
			propsNo = data["物品"]
			amount = data["数量"]
			isBind = data.get("绑定")
			propsObj = props.new(propsNo)
			propsObj.setStack(amount)
			if isBind:
				propsObj.bind()
			propsObjList.append(propsObj)
		mail.sendSysMail(roleId,"试炼幻境","恭喜你获得上周试炼幻境排行榜第%d名" % rankNo,propsObjList)
		return True

	def onNewHour(self, day, hour, wday):
		if wday != 1 or hour != 0:
			return
		rankObj = rank.getRankObjByName("rank_race_fairyland")
		rankObj.updateRanking()

		for idx,roleId in enumerate(rankObj.ranking()):
			rankNo = idx + 1
			if not self.sendRankReward(roleId,rankNo):
				break
		rankObj.clearRank()

	def onLogin(self, who, bRelogin):
		boxReward = self.getBoxRewardIdx(who)
		if not boxReward:
			return

		self.rewardBox(who)

	def onEnter(self, who, oldScene, newScene):
		if oldScene == newScene:
			return
		rpcBegin(who)
		self.__rpcAddNpc(who)
		if not who.inWar():   #重连战斗中就不需要了
			self.goAheadNpc(who)

	def onLeave(self, who, oldScene, newScene):
		if oldScene == newScene:
			return
		rpcEnd(who)

	def testCmd(self, who, cmdIdx, *args):
		if cmdIdx == 1:
			rpcEnter(who, None)
		elif cmdIdx == 2:
			rpcQuit(who, None)
		elif cmdIdx == 3:
			stageNo = int(args[0])
			msg = self.getMsg(who,stageNo,0)
			who.endPoint.rpcFairylandStageSend(**msg)
		elif cmdIdx == 4:
			stageNo = int(args[0])
			self.quest(who,stageNo)
 		elif cmdIdx == 5:
 			stageNo = int(args[0])
 			self.autoPass(who,stageNo)
 		elif cmdIdx == 6:
 			npcObj = self.getNpcByRoleId(who.id)
 			if npcObj:
 				npcObj.doLook(who)
 		elif cmdIdx == 7:
 			pos = int(args[0])
 			self.rewardBox(who,pos)
 		elif cmdIdx == 8:
 			self.onNewHour(self,1,0,1)

import activity.object

class Npc(activity.object.Npc):
	'''活动npc
	'''

	def doLook(self, who):
		iTime = 0
		if not self.game.isSpecialStage(self.stageNo) and who.fetch("flStage") >= self.stageNo:
			iTime = 5

		rpcStageSend(who,self.game,self.stageNo,iTime)

def getActivity():
	return activity.getActivity("fairyland")

def goAheadNpc(roleId):
	'''前往npc
	'''
	actObj = getActivity()
	if not actObj:
		return

	who = getRole(roleId)
	if not who:
		return

	actObj.goAheadNpc(who)

# ==================================================================================
# 上行rpc 相关的
# ==================================================================================

def rpcBegin(who):
	msg = packInfoMsg(who)
	who.endPoint.rpcFairylandBegin(**msg)

def rpcChange(who,*attrNameList):
	msg = {}
	for attrName in attrNameList:
		if attrName == "stage": 
			msg["iPassStage"] = who.day.fetch("flStage")
		elif attrName == "count":
			msg["iSurplusCount"] = MAX_FIGHT - who.day.fetch("flFail")

	if msg:
		who.endPoint.rpcFairylandChange(**msg)

def rpcEnd(who):
	who.endPoint.rpcFairylandEnd()

def rpcStageSend(who, actObj, stageNo, timeout=0):
	'''发送关卡数据
	'''
	msg = actObj.getMsg(who,stageNo,timeout)
	who.endPoint.rpcFairylandStageSend(**msg)

def packInfoMsg(who):
	'''打包幻境信息
	'''
	msg = {}
	msg["iPassStage"] = who.day.fetch("flStage")
	msg["iSurplusCount"] = MAX_FIGHT - who.day.fetch("flFail")
	return msg

def rpcSendBoxRewardResult(actObj, who, pos, info, idx):
	'''发送翻牌结果
	'''
	msg = {}
	msg["iPos"] = pos
	msg["rewardList"] = packBoxRewardList(actObj,who,info,idx)
	who.endPoint.rpcFairylandBoxRewardResult(**msg)

def packBoxRewardList(actObj,who,info,idx):
	'''打包翻牌列表
	'''
	lst = []
	data = info[idx]
	lst.append(packBoxReward(actObj,who,data))

	for index,data in enumerate(info):
		if index == idx:
			continue
		lst.append(packBoxReward(actObj,who,data))

	return lst

def packBoxReward(actObj, who, data):
	'''打包翻牌奖励
	'''
	msgObj = act_fairyland_pb2.boxRewardMsg()
	msgObj.iPropsNo = int(data["物品"])
	msgObj.iAmount = int(actObj.transCodeForReward(data["数量"], "数量", who))
	return msgObj

# ===========================================================================================
# 上行rpc 相关的
# ===========================================================================================
def vaildRpc(func):

	def _rpc(who, reqMsg):
		actObj = getActivity()
		if not actObj:
			return
		if who.level < 40:
			return
		if who.inWar():
			return
		if who.inTeam():
			npcObj = npc.getNpcByIdx(10901)
			actObj.doScript(who, npcObj, "D4006")
			return
		func(actObj,who,reqMsg)

	return _rpc

@vaildRpc
def rpcEnter(actObj, who, reqMsg):
	'''进入试炼幻境
	'''
	actObj.enterScene(who)
	
@vaildRpc
def rpcQuit(actObj, who, reqMsg):
	'''退出试炼幻境
	'''
	actObj.leaveScene(who)

	
def rpcStageGet(who, reqMsg):
	'''关卡数据
	'''
	actObj = getActivity()
	if not actObj:
		return
	if who.level < 40:
		return
	if who.inWar():
		return
	stageNo = reqMsg.iStageNo
	rpcStageSend(who, actObj, stageNo)

@vaildRpc
def rpcStageFight(actObj, who, reqMsg):
	'''挑战
	'''
	stageNo = reqMsg.iStageNo
	actObj.quest(who,stageNo)

@vaildRpc
def rpcPass(actObj, who, reqMsg):
	'''自动通过
	'''
	stageNo = reqMsg.iStageNo
	if stageNo != who.day.fetch("flStage") + 1 or not actObj.canAutoPass(who,stageNo):
		return

	actObj.autoPass(who,stageNo)

@vaildRpc
def rpcTaskQuest(actObj, who, reqMsg):
	'''前往npc
	'''
	stageNo = reqMsg.iStageNo
	if stageNo != who.day.fetch("flStage") + 1:
		return

	actObj.goAheadNpc(who)

@vaildRpc
def rpcBoxChoose(actObj, who, reqMsg):
	'''翻牌
	'''
	pos = reqMsg.iPos
	actObj.rewardBox(who,pos)

# ==========================================================================================
# 脚本
# ==========================================================================================
def boxReward(gameObj, who, npcObj, *args):
	'''发送翻牌
	'''
	rwdIdx = int(args[0])
	gameObj.setBoxRewardIdx(who, rwdIdx)
	who.endPoint.rpcFairylandBoxRewardOpen(BOX_TIME)

from common import *
from war.defines import *
import activity
import template
import scene
import cycleData
import rank
import mail
import props
import role
import gevent
import npc
import activity.center
import act_fairyland_pb2
import perform
import war.commands

BOX_TIME = 15 #翻牌时间
MAX_FIGHT = 2 #最大挑战次数
