# -*- coding: utf-8 -*-
from activity.object import Activity as customActivity

TASK_ID = 20301

#导表开始
class Activity(customActivity):

	npcInfo = {
		1001:{"名称":"小神僧","造型":"4004(0,1,0,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,85,63,4"},
		1002:{"名称":"泰山君","造型":"4509(0,1,0,0,0,0)","染色":"0,0,0,0,0,0","位置":"2040,84,52,4"},
		1003:{"名称":"衡山君","造型":"4508(0,1,0,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,74,17,6"},
		1004:{"名称":"华山君","造型":"4504(0,1,0,0,0,0)","染色":"0,0,0,0,0,0","位置":"1150,46,11,5"},
		1005:{"名称":"嵩山君","造型":"4506(0,1,0,0,0,0)","染色":"0,0,0,0,0,0","位置":"1060,22,14,5"},
		1006:{"名称":"恒山君","造型":"1311(1,1,1,1,1,0)","染色":"3,0,0,0,0,0","位置":"2030,38,33,4"},
	}

	eventInfo = {
		1001:{"点击":"SB1001","回复":"1:TASK"},
		1002:{"点击":"SB1002","回复":"1:F1001","成功":"TR1001,FBD1002"},
		1003:{"点击":"SB1003","回复":"1:F1002","成功":"TR1002,FBD1003"},
		1004:{"点击":"SB1004","回复":"1:F1003","成功":"TR1003,FBD1004"},
		1005:{"点击":"SB1005","回复":"1:F1004","成功":"TR1004,FBD1005"},
		1006:{"点击":"SB1006","回复":"1:F1005","成功":"TR1005,FBD1006"},
	}

	rewardInfo = {
		1001:{"经验":lambda ALV:ALV*500+25000,"宠物经验":lambda ALV:ALV*350+17500,"银币":lambda ALV:ALV*150+20000,"物品":[1001],"活跃点":2},
		1002:{"经验":lambda ALV:ALV*500+25000,"宠物经验":lambda ALV:ALV*350+17500,"银币":lambda ALV:ALV*150+20000,"物品":[1001],"活跃点":2},
		1003:{"经验":lambda ALV:ALV*500+25000,"宠物经验":lambda ALV:ALV*350+17500,"银币":lambda ALV:ALV*150+20000,"物品":[1001],"活跃点":2},
		1004:{"经验":lambda ALV:ALV*500+25000,"宠物经验":lambda ALV:ALV*350+17500,"银币":lambda ALV:ALV*150+20000,"物品":[1001],"活跃点":2},
		1005:{"经验":lambda ALV:ALV*500+25000,"宠物经验":lambda ALV:ALV*350+17500,"银币":lambda ALV:ALV*150+20000,"物品":[1001],"活跃点":2},
		2001:{"物品":[2001]},
	}

	rewardPropsInfo = {
		1001:(
			{"权重":15,"物品":"202001","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"202002","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"202003","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"202004","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"202005","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224001","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224002","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224003","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224004","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224005","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224006","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224007","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224008","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224009","数量":"1","绑定":0,"传闻":0},
			{"权重":15,"物品":"224010","数量":"1","绑定":0,"传闻":0},
			{"权重":750,"物品":"224101","数量":"1","绑定":0,"传闻":0},
			{"权重":22,"物品":"224102","数量":"1","绑定":0,"传闻":0},
			{"权重":8,"物品":"230103","数量":"1","绑定":0,"传闻":0},
			{"权重":5,"物品":"234201","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234202","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234203","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234204","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234205","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234206","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234207","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234208","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234209","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234210","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234211","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234212","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234213","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234214","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234215","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234216","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234217","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234218","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234219","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234220","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234221","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234222","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234223","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234224","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234225","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234226","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234227","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234228","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234229","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234230","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234231","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234232","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234233","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234234","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234235","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234236","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234237","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234238","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234239","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234240","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234241","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234242","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234243","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234244","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234245","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234246","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234247","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234248","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234249","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234250","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234251","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234252","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234253","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234401","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234402","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234403","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234404","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234405","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234406","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234407","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234408","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234409","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234410","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234411","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234412","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234413","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234414","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234415","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234416","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234417","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234418","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234419","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":6,"物品":"234420","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234902","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":5,"物品":"234903","数量":"1","绑定":0,"传闻":0},
			{"权重":20,"物品":"234904","数量":"1","绑定":0,"传闻":0},
			{"权重":716,"物品":"224201","数量":"1","绑定":0,"传闻":0},
			{"权重":716,"物品":"224202","数量":"1","绑定":0,"传闻":0},
			{"权重":716,"物品":"224203","数量":"1","绑定":0,"传闻":0},
			{"权重":716,"物品":"224204","数量":"1","绑定":0,"传闻":0},
			{"权重":716,"物品":"246051","数量":"1","绑定":0,"传闻":0},
			{"权重":5000,"物品":"0","数量":"0","绑定":0,"传闻":0},
		),
		2001:(
			{"权重":100,"物品":"200006","数量":"5","绑定":0,"传闻":0},
		),
	}

	groupInfo = {
	}

	chatInfo = {
		1001:'''$SEX1做好准备了么？若是准备好了，马上就可挑战各位帝君。\nQ接受挑战''',
		1002:'''我乃泰山帝君，掌管人间善恶，注生录死。\nQ挑战''',
		1003:'''我乃衡山帝君，掌管鳞甲水族，沃土分野。\nQ挑战''',
		1004:'''我乃华山帝君，掌管珍宝五金，陶铸坑冶。\nQ挑战''',
		1005:'''我乃嵩山帝君，掌管地泽川谷，山林树木。\nQ挑战''',
		1006:'''我乃恒山帝君，掌管江河湖海，虎豹走兽。\nQ挑战''',
		2001:'''今日正是良辰吉日，#L1<14,27>*[五岳帝君]*02#n现于人世，想接受五位帝君挑战的仙友们可前往寻找帝君踪迹了！''',
		2002:'''良辰吉日已过，五位帝君游玩尽兴，已返回各自洞府，各位仙友们若想再前往挑战五位帝君，请等候下个吉日！''',
		3001:'''开战后每回合会损耗一定生命，注意了！''',
		3002:'''开战后每回合会失去一定真气，要小心应付！''',
		3003:'''五金之精在失去一半生命的三回合后自爆，尔等小心！''',
		3004:'''吾身以力为食，吾魂以气为食，少侠请小心！''',
		3005:'''吾拥有化身之术，本体不伤则永不落败！''',
		3006:'''看吾化身之术！''',
		4001:'''请3人以上组队再来挑战''',
		4002:'''#C01$teamRoleName#n等级不足30级，不能接取任务''',
		4003:'''$SEX1请先去小神僧处领取挑战资格''',
		4004:'''你身上已有此任务''',
		4005:'''此任务只能完成一次''',
		6001:'''#C01$roleName#n通过了#L1<14,27>*[五岳帝君]*02#n的考验，并幸运的获得了$lnkProps''',
		7001:'''领取五岳帝君任务''',
		7002:'''完成五岳帝君任务''',
	}

	branchInfo = {
	}

	fightInfo = {
		1001:(
			{"类型":1,"名称":"泰山君","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"1001","数量":"1","技能":(6413,1411,1412,),"站位":(1,)},
			{"类型":0,"名称":"青灵童子","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"1002","数量":"1","技能":(1613,1621,),"站位":(2,)},
			{"类型":0,"名称":"太华童子","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"1003","数量":"1","技能":(1221,1232,1233,),"站位":(3,)},
			{"类型":0,"名称":"金轮童子","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"1004","数量":"3","技能":(1111,1112,),"站位":(4,5,6,)},
		),
		1002:(
			{"类型":1,"名称":"衡山君","造型":"4508(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"2001","数量":"1","技能":(6414,1511,1512,),"站位":(1,)},
			{"类型":0,"名称":"丹灵道人","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"2002","数量":"1","技能":(1613,1621,),"站位":(2,)},
			{"类型":0,"名称":"黑虎道人","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"2003","数量":"2","技能":(1221,1232,1233,),"站位":(3,4,)},
			{"类型":0,"名称":"洋光道人","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"2004","数量":"2","技能":(1111,1112,),"站位":(5,6,)},
		),
		1003:(
			{"类型":1,"名称":"华山君","造型":"4504(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"3001","数量":"1","技能":(1311,1312,),"站位":(1,)},
			{"类型":0,"名称":"五金之精","造型":"3008(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"3002","数量":"5","技能":(6207,),"站位":(2,3,4,5,6,)},
		),
		1004:(
			{"类型":1,"名称":"嵩山君","造型":"4506(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"4001","数量":"1","技能":(6415,1111,1112,),"站位":(2,)},
			{"类型":0,"名称":"嵩山神魂","造型":"4506(0,1,0,0,0)","染色":"0,0,0,0,0,0","能力编号":"4002","数量":"1","技能":(6416,1121,1122,),"站位":(3,)},
		),
		1005:(
			{"类型":1,"名称":"恒山君","造型":"1311(1,1,1,1,1)","染色":"3,0,0,0,0,0","能力编号":"5001","数量":"1","技能":(6417,),"站位":(1,)},
			{"类型":1,"名称":"恒山君","造型":"1311(1,1,1,1,1)","染色":"2,0,0,0,0,0","能力编号":"5002","数量":"9","技能":(6418,),"站位":(2,3,4,5,6,7,8,9,10,)},
		),
		1006:(
			{"类型":1,"名称":"恒山君","造型":"1311(1,1,1,1,1)","染色":"2,0,0,0,0,0","能力编号":"5002","数量":"9","技能":(6418,)},
		),
	}

	ableInfo = {
		1001:{"等级":lambda ALV:ALV-2,"生命":"B*2.3","真气":"B*1","物理伤害":"B*1","法术伤害":"B*1","物理防御":"B*1","法术防御":"B*1","速度":"B*1.5","治疗":"B*0.82","封印":"B*0","抗封":"B*0.8"},
		1002:{"等级":lambda ALV:ALV-2,"生命":"B*1.3","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*1.2","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗":"B*1","封印":"B*0","抗封":"B*0.3"},
		1003:{"等级":lambda ALV:ALV-2,"生命":"B*1","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.7","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*1","治疗":"B*0.82","封印":"B*0","抗封":"B*0.3"},
		1004:{"等级":lambda ALV:ALV-2,"生命":"B*0.9","真气":"B*1","物理伤害":"B*0.8","法术伤害":"B*0.6","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.7","治疗":"B*0.82","封印":"B*0","抗封":"B*0.3"},
		2001:{"等级":lambda ALV:ALV-1,"生命":"B*2","真气":"B*1","物理伤害":"B*1","法术伤害":"B*1","物理防御":"B*1","法术防御":"B*1","速度":"B*1.5","治疗":"B*0.82","封印":"B*0","抗封":"B*0.8"},
		2002:{"等级":lambda ALV:ALV-1,"生命":"B*1.3","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*1.2","物理防御":"B*0.8","法术防御":"B*0.8","速度":"B*1","治疗":"B*1","封印":"B*0","抗封":"B*0.3"},
		2003:{"等级":lambda ALV:ALV-1,"生命":"B*1","真气":"B*1","物理伤害":"B*0.8","法术伤害":"B*0.6","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.7","治疗":"B*0.82","封印":"B*0","抗封":"B*0.3"},
		2004:{"等级":lambda ALV:ALV-1,"生命":"B*0.9","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.8","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.7","治疗":"B*0.82","封印":"B*0","抗封":"B*0.3"},
		3001:{"等级":lambda ALV:ALV+1,"生命":"B*2.5","真气":"B*1","物理伤害":"B*1","法术伤害":"B*1","物理防御":"B*1","法术防御":"B*1","速度":"B*1.5","治疗":"B*0.82","封印":"B*0","抗封":"B*0.8"},
		3002:{"等级":lambda ALV:ALV+1,"生命":"B*2","真气":"B*1","物理伤害":"B*0.7","法术伤害":"B*0.4","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.7","治疗":"B*0.82","封印":"B*0","抗封":"B*0.3"},
		4001:{"等级":lambda ALV:ALV+2,"生命":"B*2","真气":"B*1","物理伤害":"B*1","法术伤害":"B*1","物理防御":"B*1","法术防御":"B*1","速度":"B*1.5","治疗":"B*0.82","封印":"B*0","抗封":"B*0.8"},
		4002:{"等级":lambda ALV:ALV+2,"生命":"B*2","真气":"B*1","物理伤害":"B*1","法术伤害":"B*1","物理防御":"B*1","法术防御":"B*1","速度":"B*1.5","治疗":"B*0.82","封印":"B*0","抗封":"B*0.8"},
		5001:{"等级":lambda ALV:ALV+3,"生命":"B*3","真气":"B*1","物理伤害":"B*1","法术伤害":"B*1","物理防御":"B*1","法术防御":"B*1","速度":"B*0.7","治疗":"B*0.82","封印":"B*0","抗封":"B*0.8"},
		5002:{"等级":lambda ALV:ALV+3,"生命":"2","真气":"B*1","物理伤害":"B*0.5","法术伤害":"B*0.6","物理防御":"B*1","法术防御":"B*1","速度":"B*1","治疗":"B*0.82","封印":"B*0","抗封":"B*0.3"},
	}

	lineupInfo = {
	}

	sceneInfo = {
	}

	configInfo = {
	}

	starchat = {
		1001:{"开场对白":3001},
		1002:{"开场对白":3002},
		1003:{"开场对白":3003},
		1004:{"开场对白":3004},
		1005:{"开场对白":3005},
		1006:{"开场对白":3006},
	}
#导表结束

	def onStartWar(self, w):
		'''进入战斗
		'''
		if w.isBoss():
			fightIdx = w.war.fightIdx
			if fightIdx == 1005 and not w.performListPassive.get(6417):
				return
			chatIdx = self.starchat[fightIdx]["开场对白"]
			content = self.getText(chatIdx)
			w.war.say(w,content)
		else:
			who = getRole(w.id)
			if who and not task.hasTask(who,TASK_ID) and not self.hasKillBoss(who):
				task.newTask(who,None,TASK_ID)
				self.doScript(who, None, "TP7001")

	def reward(self, who, rwdIdx, npcObj=None):
		'''奖励
		'''
		taskObj = task.hasTask(who,TASK_ID)
		if not taskObj or self.hasKillBoss(who,npcObj.idx):
			rwdIdx = 2001
		customActivity.reward(self, who, rwdIdx, npcObj)

	def rewardTeam(self, who, rwdIdx, npcObj=None):
		'''奖励队伍
		'''
		teamObj = who.getTeamObj()
		if not teamObj:
			return

		for pid in teamObj.getInTeamList():
			obj = getRole(pid)
			if not obj:
				continue
			taskObj = task.hasTask(obj,TASK_ID)
			if not taskObj:
				continue	
			if not self.hasKillBoss(obj,npcObj.idx):
				customActivity.rewardTeam(self, who, rwdIdx, npcObj)
				break

	def getScriptHandler(self, script):
		m = re.match("TASK", script)
		if m:
			args = m.groups()
			return giveTask,args
		m = re.match("FBD(\d+)", script)
		if m:
			args = m.groups()
			return taskDone,args
		return customActivity.getScriptHandler(self, script)

	def giveTask(self, npcObj, who):
		if task.hasTask(who,TASK_ID):
			self.doScript(who, npcObj, "D4004")
			return

		if self.hasKillBoss(who):
			self.doScript(who, npcObj, "D4005")
			return

		if not self.vaildTeam(npcObj,who):
			return

		task.newTask(who,npcObj,TASK_ID)
		for pid in who.getTeamObj().getInTeamList():
			if pid == who.id:
				continue
			memberObj = getRole(pid)
			if memberObj and not task.hasTask(memberObj,TASK_ID) and not self.hasKillBoss(memberObj):
				task.newTask(memberObj,npcObj,TASK_ID)
				self.doScript(memberObj, npcObj, "TP7001")

	def hasKillBoss(self, who, bossIdx=0):
		'''是否击杀该boss
		'''
		bossList = who.week.fetch("fiveBoss",[])
		if not bossIdx:
			return len(bossList)>=5
		return bossIdx in bossList

	def taskDone(self, npcObj, who, bossIdx):
		for pid in who.getTeamObj().getInTeamList():
			roleObj = getRole(pid)
			if not roleObj:
				continue
			taskObj = task.hasTask(roleObj, TASK_ID)
			if not taskObj or self.hasKillBoss(roleObj,bossIdx):
				continue
			bossList = roleObj.week.fetch("fiveBoss",[])
			bossList.append(bossIdx)
			roleObj.week.set("fiveBoss",bossList)
			if self.hasKillBoss(roleObj):
				task.removeTask(roleObj, TASK_ID)
				self.doScript(roleObj, npcObj, "TP7002")
			else:
				taskObj.attrChange("intro")

	def validFight(self, who, npcObj, fightIdx):
		if not task.hasTask(who,TASK_ID):
			self.doScript(who, npcObj, "D4003")
			return 0

		if not self.vaildTeam(npcObj,who):
			return 0

		return customActivity.validFight(self, who, npcObj, fightIdx)

	def vaildTeam(self, npcObj, who):
		if not who.validInTeamSize(3):
			self.doScript(who, npcObj, "D4001")
			return 0

		if not self.validLevel(npcObj,who):
			return 0

		if who.inWar():
			return 0

		return 1

	def validLevel(self, npcObj, who):
		lst = []
		teamObj = who.getTeamObj()
		for pid in teamObj.getInTeamList():
			roleObj = getRole(pid)
			if roleObj.level < 30:
				lst.append(roleObj.name)

		if lst:
			who.teamRoleName = lst
			self.doScript(who, npcObj, "D4002")
			del who.teamRoleName
			return 0

		return 1
	
	def open(self):
		'''活动开启
		'''
		self.close()
		for npcIdx in self.npcInfo:
			npcObj = self.addNpc(npcIdx)
			npcObj.eventIdx = npcIdx

	def close(self):
		'''活动关闭
		'''
		for typeFlag in self.npcList.keys():
			self.removeNpcByTypeFlag(typeFlag)

	def handleSysMessageRoll(self, chatIdxStr):
		'''系统传闻且滚动
		'''
		chatIdx = self.transIdxByGroup(int(chatIdxStr))
		message.sysMessageRoll(self.getText(chatIdx))

	def setupWar(self, warObj, who, npcObj):
		warObj.setAutoFight(False)

		#把召唤怪先存起来
		fightList = self.getFightInfo(1006)
		monsterList = war.warctrl.createMonsterList(who,1006,fightList,self.getAbleInfo(),self.getLineupInfo(),self,npcObj)
		warObj.summonMonsterList = monsterList[WARRIOR_TYPE_BOSS]

	def onNewHour(self, day, hour, wday):
		'''系统刷小时时
		'''
		if hour != 0:
			return

		if wday == 1: #结束
			self.handleSysMessageRoll(2002)
			self.close()
		elif wday == 7: #开始
			self.handleSysMessageRoll(2001)
			self.open()

	def transString(self, content, pid=0):
		'''转化字符串
		'''

		who = None
		if pid:
			who = getRole(pid)
		if who:
			if "$teamRoleName" in content:
				content = content.replace("$teamRoleName", ",".join(who.teamRoleName))
		return customActivity.transString(self, content, pid)

	def testCmd(self, who, cmdIdx, *args):
		if cmdIdx == 1:
			self.handleSysMessageRoll(2001)
			self.open()
		elif cmdIdx == 2:
			self.handleSysMessageRoll(2002)
			self.close()

def getActivity():
	return activity.getActivity("fiveBoss")

def giveTask(gameObj, who, npcObj):
	gameObj.giveTask(npcObj,who)

def taskDone(gameObj, who, npcObj, bossIdx):
	gameObj.taskDone(npcObj,who,int(bossIdx))

from common import *
from war.defines import *
import message
import task
import activity
import war