# -*- coding: utf-8 -*-
from activity.object import Activity as customActivity
import activity.object

#导表开始
class Activity(customActivity):

	npcInfo = {
		1001:{"名称":"金臂护卫","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1002:{"名称":"桑木护卫","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1003:{"名称":"沧浪护卫","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1004:{"名称":"赤霞护卫","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1005:{"名称":"戊土护卫","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1011:{"名称":"金臂行者","造型":"4005(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1012:{"名称":"桑木仙姥","造型":"4508(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1013:{"名称":"沧浪羽士","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1014:{"名称":"赤霞神君","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1015:{"名称":"戊土道人","造型":"5001(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
		1021:{"名称":"天罗子","造型":"4504(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"$pos","称谓":"邪道煞星"},
	}

	eventInfo = {
		2001:{"点击":"SB5003","回复":"1:B(2011,scene)","成功":"TR1001"},
		2002:{"点击":"SB5004","回复":"1:STARS(2012,scene)","成功":"TR1002"},
		2003:{"点击":"SB5005","回复":"1:STARS(2013,scene)","成功":"TR1002,RSM4031"},
	}

	rewardInfo = {
		1001:{"经验":lambda LV:LV*700+15000,"宠物经验":lambda PLV:PLV*560+12000,"银币":lambda LV:LV*200+5000,"物品":[1001],"活跃点":5},
		1002:{"经验":lambda LV:LV*1000+20000,"宠物经验":lambda PLV:PLV*800+16000,"银币":lambda LV:LV*300+8000,"物品":[1002],"活跃点":5},
		1003:{"经验":lambda LV:LV*350+5500,"宠物经验":lambda PLV:PLV*280+4400,"银币":lambda LV:LV*150+2500,"物品":[1003]},
		2001:{"物品":[1004]},
	}

	rewardPropsInfo = {
		1001:(
			{"权重":80,"物品":"246051","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234901","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234101","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234102","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234103","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234104","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234105","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234106","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234107","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234108","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234109","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234110","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234111","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234112","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234113","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234114","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234115","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234116","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234117","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234118","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234119","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234120","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234121","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234122","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234123","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234124","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234125","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234126","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234127","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234128","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234129","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234130","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234131","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234132","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234133","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234134","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234135","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234136","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234137","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234138","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234139","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234140","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234141","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234142","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234143","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234144","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234145","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234146","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234147","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234148","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234149","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234150","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234151","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234152","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234153","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"224103","数量":"2","绑定":0,"传闻":0},
			{"权重":100,"物品":"224104","数量":"2","绑定":0,"传闻":0},
			{"权重":100,"物品":"224105","数量":"2","绑定":0,"传闻":0},
			{"权重":100,"物品":"224106","数量":"2","绑定":0,"传闻":0},
			{"权重":100,"物品":"224107","数量":"2","绑定":0,"传闻":0},
			{"权重":80,"物品":"224108","数量":"1","绑定":0,"传闻":0},
			{"权重":800,"物品":"0","数量":"0","绑定":0,"传闻":0},
		),
		1002:(
			{"权重":100,"物品":"202001","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"202002","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"202003","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"202004","数量":"1","绑定":0,"传闻":0},
			{"权重":100,"物品":"202005","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224001","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224002","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224003","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224004","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224005","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224006","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224007","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224008","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224009","数量":"1","绑定":0,"传闻":0},
			{"权重":90,"物品":"224010","数量":"1","绑定":0,"传闻":0},
			{"权重":400,"物品":"224103","数量":"3","绑定":0,"传闻":0},
			{"权重":400,"物品":"224104","数量":"3","绑定":0,"传闻":0},
			{"权重":400,"物品":"224105","数量":"3","绑定":0,"传闻":0},
			{"权重":400,"物品":"224106","数量":"3","绑定":0,"传闻":0},
			{"权重":400,"物品":"224107","数量":"3","绑定":0,"传闻":0},
			{"权重":390,"物品":"224108","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234101","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234102","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234103","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234104","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234105","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234106","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234107","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234108","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234109","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234110","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234111","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234112","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234113","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234114","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234115","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234116","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234117","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234118","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234119","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234120","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234121","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234122","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234123","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234124","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234125","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234126","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234127","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234128","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234129","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234130","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234131","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234132","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234133","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234134","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234135","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234136","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234137","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234138","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234139","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234140","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234141","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234142","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234143","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234144","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234145","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234146","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234147","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234148","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234149","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234150","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234151","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234152","数量":"1","绑定":0,"传闻":0},
			{"权重":50,"物品":"234153","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234401","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234402","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234403","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234404","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234405","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234406","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234407","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234408","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234409","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234410","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234411","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234412","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234413","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234414","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234415","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234416","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234417","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234418","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234419","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":10,"物品":"234420","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":50,"物品":"234901","数量":"1","绑定":0,"传闻":0},
			{"权重":10,"物品":"234903","数量":"1","绑定":0,"传闻":"SM5001"},
			{"权重":300,"物品":"246051","数量":"1","绑定":0,"传闻":0},
			{"权重":3000,"物品":"0","数量":"0","绑定":0,"传闻":0},
		),
		1003:(
			{"权重":300,"物品":"224103","数量":"5","绑定":0,"传闻":0},
			{"权重":300,"物品":"224104","数量":"5","绑定":0,"传闻":0},
			{"权重":300,"物品":"224105","数量":"5","绑定":0,"传闻":0},
			{"权重":300,"物品":"224106","数量":"5","绑定":0,"传闻":0},
			{"权重":300,"物品":"224107","数量":"5","绑定":0,"传闻":0},
			{"权重":460,"物品":"224108","数量":"1","绑定":0,"传闻":0},
			{"权重":450,"物品":"202001","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":450,"物品":"202002","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":450,"物品":"202003","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":450,"物品":"202004","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":450,"物品":"202005","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224001","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224002","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224003","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224004","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224005","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224006","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224007","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224008","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224009","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":400,"物品":"224010","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234201","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234202","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234203","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234204","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234205","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234206","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234207","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234208","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234209","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234210","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234211","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234212","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234213","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234214","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234215","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234216","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234217","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234218","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234219","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234220","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234221","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234222","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234223","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234224","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234225","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234226","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234227","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234228","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234229","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234230","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234231","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234232","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234233","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234234","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234235","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234236","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234237","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234238","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234239","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234240","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234241","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234242","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234243","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234244","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234245","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234246","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234247","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234248","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234249","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234250","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234251","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234252","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":10,"物品":"234253","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234401","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234402","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234403","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234404","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234405","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234406","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234407","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234408","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234409","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234410","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234411","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234412","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234413","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234414","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234415","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234416","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234417","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234418","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234419","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234420","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":100,"物品":"234901","数量":"1","绑定":0},
			{"权重":10,"物品":"234902","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":50,"物品":"234903","数量":"1","绑定":0,"传闻":"RSM5002"},
			{"权重":100,"物品":"246051","数量":"1","绑定":0,"传闻":0},
		),
		1004:(
			{"权重":100,"物品":"200006","数量":"10","绑定":0,"传闻":0},
		),
	}

	groupInfo = {
	}

	chatInfo = {
		4011:'''中原地大物博资源丰富，可是这修道之人的实力却是如此不济。''',
		4012:'''你们对我造成的伤痛只能让我更加强大！''',
		4013:'''我的傀儡是无穷尽的！''',
		4014:'''受伤了不用着急，我将治疗你们所有人！''',
		4015:'''爆发体内炽烈火焰的力量吧！''',
		4016:'''陷入泥潭，被泥淹没，你又能做些什么？''',
		4017:'''竟敢挑战我，我会选出一队与我战斗，就看谁运气好了''',
		4018:'''竟敢挑战我，不知量力，我会选出一队与我战斗，就看谁运气好了''',
		4019:'''竟然消灭了他们，倒是一群了不起的蝼蚁！''',
		4020:'''这点实力也敢向我挑战？#C01$teamRoleName#n＜#C0430级#n，多练几年再来吧！''',
		4021:'''这点实力也敢向我挑战？#C01$teamRoleName#n＜#C0460级#n，多练几年再来吧！''',
		4022:'''这点实力也敢向我挑战？叫多几个人，组成最低#C043人队伍#n后再来找我吧！''',
		4023:'''每天仅能获得#C043次#n煞星奖励，这次战斗可获得侠义值奖励。''',
		4024:'''每天仅能获得#C041次#n天罗子奖励，这次战斗可获得侠义值奖励。''',
		4025:'''#C03天墉城#n、#C03峨眉山#n、#C03莽苍山#n、#C03锁妖塔外#n、#C03云顶村#n出现大量#L1<14,23>*[邪道煞星]*02#n，各位仙友速度去赶走这些邪魔外道''',
		4026:'''挑战失败，邪道煞星已退散，#C01$boss#n离开了这里''',
		4027:'''两仪微尘阵已准备妥当，吓得剩余的#L1<14,23>*[邪道煞星]*02#n闻风而逃''',
		4028:'''#L1<14,23>*[邪道煞星]*02#n已全部被击败，感谢各位仙友的出手相助''',
		4029:'''#C01$roleName#n带领的队伍已被#C01$boss#n击败，仙友们速去#C03$bScene#n#C03$pos#n，灭了它的威风''',
		4030:'''五行煞星已被全部击杀，却引出#L1<14,23>*[邪道煞星]*02#n的领军人物#C01$monster#n在#C03$scene#n四处肆虐，仙友速去救援''',
		4031:'''自古邪不能胜正，罪恶多端的#C01天罗子#n已被#C01$roleName#n带领的队伍消灭''',
		4032:'''#C01$roleName#n带领的队伍已被#C01$boss#n击败，仙友们速去#C03$bScene#n#C03$pos#n，灭了它的威风''',
		4033:'''回合数已达到上限，退出战斗''',
		4034:'''死亡并不是结束而仅是开始，我将在#C042回合#n后赐予重生！''',
		5001:'''#C01$roleName#n成功击杀#L1<14,23>*[邪道煞星]*02#n，并从其手中夺得$lnkProps''',
		5002:'''#L1<14,23>*[邪道煞星]*02#n领军#C02天罗子#n被#C01$roleName#n击败，只能留下$lnkProps仓皇逃窜''',
		5003:'''中原的宝物、福地都在这了，我们去抢啊~\nQ开启战斗\nQ取消''',
		5004:'''谁敢阻我？\nQ开启战斗\nQ取消''',
		5005:'''竟然消灭了他们，倒是一群了不起的蝼蚁！\nQ开启战斗\nQ取消''',
		5006:'''非常可惜，你的队伍没被选中挑战#C01$boss#n''',
	}

	branchInfo = {
		2011:(
			{"条件":1130,"脚本":"SF1001"},
			{"条件":1140,"脚本":"SF1002"},
			{"条件":2040,"脚本":"SF1003"},
			{"条件":1060,"脚本":"SF1004"},
			{"条件":1030,"脚本":"SF1005"},
		),
		2012:(
			{"条件":1130,"脚本":"SF1011"},
			{"条件":1140,"脚本":"SF1012"},
			{"条件":2040,"脚本":"SF1013"},
			{"条件":1060,"脚本":"SF1014"},
			{"条件":1030,"脚本":"SF1015"},
		),
		2013:(
			{"条件":1130,"脚本":"SF1021"},
			{"条件":1140,"脚本":"SF1021"},
			{"条件":2040,"脚本":"SF1021"},
			{"条件":1060,"脚本":"SF1021"},
			{"条件":1030,"脚本":"SF1021"},
		),
	}

	fightInfo = {
		1001:(
			{"类型":1,"名称":"金臂护卫","造型":"5002(0,1,0,0,0)","能力编号":"1001","数量":"1","技能":(1112,1531,5122,5133,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"4003(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(1321,1331,5119,5201,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"3013(0,1,0,0,0)","能力编号":"1003","数量":"1","技能":(1531,1521,5202,5114,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"4007(0,1,0,0,0)","能力编号":"1005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"3009(0,1,0,0,0)","能力编号":"1004","数量":"1","技能":(1613,1621,1623,5107,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"4008(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"金"},
		),
		1002:(
			{"类型":1,"名称":"桑木护卫","造型":"5002(0,1,0,0,0)","能力编号":"1001","数量":"1","技能":(1112,1531,5122,5133,),"五行":"木"},
			{"类型":0,"名称":"桑木侍从","造型":"4003(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(1321,1331,5119,5201,),"五行":"木"},
			{"类型":0,"名称":"桑木侍从","造型":"3013(0,1,0,0,0)","能力编号":"1003","数量":"1","技能":(1531,1521,5202,5114,),"五行":"木"},
			{"类型":0,"名称":"桑木侍从","造型":"4007(0,1,0,0,0)","能力编号":"1005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"木"},
			{"类型":0,"名称":"桑木侍从","造型":"3009(0,1,0,0,0)","能力编号":"1004","数量":"1","技能":(1613,1621,1623,5107,),"五行":"木"},
			{"类型":0,"名称":"桑木侍从","造型":"4008(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"木"},
		),
		1003:(
			{"类型":1,"名称":"沧浪护卫","造型":"5002(0,1,0,0,0)","能力编号":"1001","数量":"1","技能":(1112,1531,5122,5133,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"4003(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(1321,1331,5119,5201,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"3013(0,1,0,0,0)","能力编号":"1003","数量":"1","技能":(1531,1521,5202,5114,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"4007(0,1,0,0,0)","能力编号":"1005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"3009(0,1,0,0,0)","能力编号":"1004","数量":"1","技能":(1613,1621,1623,5107,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"4008(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"水"},
		),
		1004:(
			{"类型":1,"名称":"赤霞护卫","造型":"5002(0,1,0,0,0)","能力编号":"1001","数量":"1","技能":(1112,1531,5122,5133,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"4003(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(1321,1331,5119,5201,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"3013(0,1,0,0,0)","能力编号":"1003","数量":"1","技能":(1531,1521,5202,5114,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"4007(0,1,0,0,0)","能力编号":"1005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"3009(0,1,0,0,0)","能力编号":"1004","数量":"1","技能":(1613,1621,1623,5107,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"4008(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"火"},
		),
		1005:(
			{"类型":1,"名称":"戊土护卫","造型":"5002(0,1,0,0,0)","能力编号":"1001","数量":"1","技能":(1112,1531,5122,5133,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"4003(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(1321,1331,5119,5201,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"3013(0,1,0,0,0)","能力编号":"1003","数量":"1","技能":(1531,1521,5202,5114,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"4007(0,1,0,0,0)","能力编号":"1005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"3009(0,1,0,0,0)","能力编号":"1004","数量":"1","技能":(1613,1621,1623,5107,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"4008(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"土"},
		),
		1011:(
			{"类型":1,"名称":"金臂行者","造型":"4005(0,1,0,0,0)","能力编号":"2001","数量":"1","技能":(1512,1321,5119,6406,5502,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"3013(0,1,0,0,0)","能力编号":"2003","数量":"1","技能":(1531,1521,5202,5114,5501,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"4003(0,1,0,0,0)","能力编号":"2002","数量":"1","技能":(1321,1331,5119,5201,5501,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"4007(0,1,0,0,0)","能力编号":"2005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"4007(0,1,0,0,0)","能力编号":"2005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"金"},
			{"类型":0,"名称":"金臂侍从","造型":"3009(0,1,0,0,0)","能力编号":"2004","数量":"1","技能":(1613,1621,1623,5107,1622,),"五行":"金"},
		),
		1012:(
			{"类型":1,"名称":"桑木仙姥","造型":"4508(0,1,0,0,0)","能力编号":"2008","数量":"1","技能":(1532,1122,5134,5135,6407,5502,),"五行":"木"},
			{"类型":0,"名称":"桑木傀儡","造型":"3006(0,1,0,0,0)","能力编号":"2004","数量":"1","技能":(1613,1621,1623,5107,),"站位":(2,),"五行":"木"},
			{"类型":0,"名称":"桑木傀儡","造型":"3006(0,1,0,0,0)","能力编号":"2006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"木"},
			{"类型":0,"名称":"桑木傀儡","造型":"3006(0,1,0,0,0)","能力编号":"2005","数量":"1","技能":(1421,1412,1423,5125,),"站位":(3,),"五行":"水"},
		),
		1013:(
			{"类型":1,"名称":"沧浪羽士","造型":"4006(0,1,0,0,0)","能力编号":"2001","数量":"1","技能":(1213,1121,5123,5125,6408,5502,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"3013(0,1,0,0,0)","能力编号":"2003","数量":"1","技能":(1531,1521,5202,5114,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"4003(0,1,0,0,0)","能力编号":"2002","数量":"1","技能":(1321,1331,5119,5201,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"3012(0,1,0,0,0)","能力编号":"2006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"4007(0,1,0,0,0)","能力编号":"2005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"水"},
			{"类型":0,"名称":"沧浪侍从","造型":"4007(0,1,0,0,0)","能力编号":"2005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"水"},
		),
		1014:(
			{"类型":1,"名称":"赤霞神君","造型":"4502(0,1,0,0,0)","能力编号":"2001","数量":"1","技能":(1531,1312,5112,5113,6409,5502,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"3013(0,1,0,0,0)","能力编号":"2003","数量":"1","技能":(1531,1521,5202,5114,5501,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"4003(0,1,0,0,0)","能力编号":"2002","数量":"1","技能":(1321,1331,5119,5201,5501,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"3006(0,1,0,0,0)","能力编号":"2006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"3013(0,1,0,0,0)","能力编号":"2005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"火"},
			{"类型":0,"名称":"赤霞侍从","造型":"3009(0,1,0,0,0)","能力编号":"2004","数量":"1","技能":(1613,1621,1623,5107,1622,),"五行":"火"},
		),
		1015:(
			{"类型":1,"名称":"戊土道人","造型":"5001(0,1,0,0,0)","能力编号":"2001","数量":"1","技能":(1313,1412,1332,5107,6410,5502,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"3013(0,1,0,0,0)","能力编号":"2003","数量":"1","技能":(1531,1521,5202,5114,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"4003(0,1,0,0,0)","能力编号":"2002","数量":"1","技能":(1321,1331,5119,5201,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"3006(0,1,0,0,0)","能力编号":"2006","数量":"1","技能":(1211,1221,1222,5123,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"4007(0,1,0,0,0)","能力编号":"2005","数量":"1","技能":(1421,1412,1423,5125,),"五行":"土"},
			{"类型":0,"名称":"戊土侍从","造型":"3009(0,1,0,0,0)","能力编号":"2004","数量":"1","技能":(1613,1621,1623,5107,),"五行":"土"},
		),
		1021:(
			{"类型":1,"名称":"天罗子","造型":"4504(0,1,0,0,0)","能力编号":"3001","数量":"1","技能":(6411,1111,1211,5214,5502,),"五行":"无"},
			{"类型":0,"名称":"金臂行者","造型":"4005(0,1,0,0,0)","能力编号":"3002","数量":"1","技能":(1511,1311,5119,6406,5501,),"五行":"金"},
			{"类型":0,"名称":"桑木仙姥","造型":"4508(0,1,0,0,0)","能力编号":"3002","数量":"1","技能":(1221,1121,5134,5135,6407,5501,),"五行":"木"},
			{"类型":0,"名称":"沧浪羽士","造型":"4006(0,1,0,0,0)","能力编号":"3002","数量":"1","技能":(1213,1211,5123,5125,6408,5501,),"五行":"水"},
			{"类型":0,"名称":"赤霞神君","造型":"4502(0,1,0,0,0)","能力编号":"3002","数量":"1","技能":(1411,1311,5112,5113,6409,5501,),"五行":"火"},
			{"类型":0,"名称":"戊土道人","造型":"5001(0,1,0,0,0)","能力编号":"3002","数量":"1","技能":(1313,1611,1332,5107,6410,5501,),"五行":"土"},
		),
		1031:(
			{"类型":0,"名称":"桑木傀儡","造型":"3006(0,1,0,0,0)","能力编号":"2007","数量":"1","技能":(1412,1112,5202,5204,),"五行":"木"},
		),
	}

	ableInfo = {
		1001:{"等级":lambda ALV:ALV,"生命":"B*1.08","真气":"B*1","物理伤害":"B*0.88","法术伤害":"B*0.88","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.8","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.96","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1002:{"等级":lambda ALV:ALV,"生命":"B*0.9","真气":"B*1","物理伤害":"B*0.73","法术伤害":"B*0.51","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1003:{"等级":lambda ALV:ALV,"生命":"B*0.9","真气":"B*1","物理伤害":"B*0.51","法术伤害":"B*0.73","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1004:{"等级":lambda ALV:ALV,"生命":"B*0.9","真气":"B*1","物理伤害":"B*0.51","法术伤害":"B*0.51","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.8","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1005:{"等级":lambda ALV:ALV,"生命":"B*0.9","真气":"B*1","物理伤害":"B*0.73","法术伤害":"B*0.73","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.85","治疗强度":"B*0.56","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1006:{"等级":lambda ALV:ALV,"生命":"B*0.9","真气":"B*1","物理伤害":"B*0.73","法术伤害":"B*0.73","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","治疗强度":"B*0.56","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2001:{"等级":lambda MLV:MLV+1,"生命":"B*2.4","真气":"B*1","物理伤害":"B*0.99","法术伤害":"B*0.99","物理防御":"B*0.82","法术防御":"B*0.82","速度":"B*1.09","治疗强度":"B*0.76","封印命中":"B*0","抵抗封印":"B*1.09","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0,"物理暴击":5,"物理抗暴":5,"法术暴击":5,"法术抗暴":5},
		2002:{"等级":lambda MLV:MLV,"生命":"B*1.8","真气":"B*1","物理伤害":"B*0.88","法术伤害":"B*0.61","物理防御":"B*0.84","法术防御":"B*0.59","速度":"B*0.8","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2003:{"等级":lambda MLV:MLV,"生命":"B*1.8","真气":"B*1","物理伤害":"B*0.61","法术伤害":"B*0.88","物理防御":"B*0.59","法术防御":"B*0.84","速度":"B*0.8","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2004:{"等级":lambda MLV:MLV,"生命":"B*1.8","真气":"B*1","物理伤害":"B*0.61","法术伤害":"B*0.61","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.8","治疗强度":"B*0.96","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2005:{"等级":lambda MLV:MLV,"生命":"B*1.8","真气":"B*1","物理伤害":"B*0.88","法术伤害":"B*0.88","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.85","治疗强度":"B*0.67","封印命中":"B*0.8","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2006:{"等级":lambda MLV:MLV,"生命":"B*1.8","真气":"B*1","物理伤害":"B*0.88","法术伤害":"B*0.88","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.8","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2007:{"等级":lambda MLV:MLV,"生命":"B*1","真气":"B*1","物理伤害":"B*0.73","法术伤害":"B*0.73","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.8","治疗强度":"B*0.67","封印命中":"B*0","抵抗封印":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2008:{"等级":lambda MLV:MLV+1,"生命":"B*3","真气":"B*1","物理伤害":"B*0.88","法术伤害":"B*0.88","物理防御":"B*0.82","法术防御":"B*0.82","速度":"B*1.09","治疗强度":"B*0.76","封印命中":"B*0","抵抗封印":"B*1.09","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0,"物理暴击":5,"物理抗暴":5,"法术暴击":5,"法术抗暴":5},
		3001:{"等级":lambda MLV:MLV+2,"生命":"B*3","真气":"B*1","物理伤害":"B*1.08","法术伤害":"B*1.08","物理防御":"B*0.94","法术防御":"B*0.94","速度":"B*1.25","治疗强度":"B*0.87","封印命中":"B*0","抵抗封印":"B*1.25","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0,"物理暴击":10,"物理抗暴":10,"法术暴击":10,"法术抗暴":10},
		3002:{"等级":lambda MLV:MLV,"生命":"B*2","真气":"B*1","物理伤害":"B*0.88","法术伤害":"B*0.88","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.85","治疗强度":"B*0.76","封印命中":"B*0","抵抗封印":"B*1","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0,"物理暴击":3,"物理抗暴":3,"法术暴击":3,"法术抗暴":3},
	}

	lineupInfo = {
	}

	sceneInfo = {
	}

	configInfo = {
	}

	monsterData = {
		1130:{"小怪":1001,"BOSS怪":1011,"终极BOSS怪":1021},
		1140:{"小怪":1002,"BOSS怪":1012,"终极BOSS怪":1021},
		2040:{"小怪":1003,"BOSS怪":1013,"终极BOSS怪":1021},
		1060:{"小怪":1004,"BOSS怪":1014,"终极BOSS怪":1021},
		1030:{"小怪":1005,"BOSS怪":1015,"终极BOSS怪":1021},
	}

	monsterConfig = {
		"小怪":{"刷出量":10,"存活时间":30,"事件编号":2001,"等级":30},
		"BOSS怪":{"刷出量":3,"存活时间":30,"事件编号":2002,"等级":30},
		"终极BOSS怪":{"刷出量":1,"存活时间":0,"事件编号":2003,"等级":60},
	}
#导表结束

	def transNpcInfo(self, npcIdx, info, who=None):
		if "$pos" in info["位置"]:
			sceneId = self.currentSceneId
			x, y = scene.randSpace(sceneId)
			info["位置"] = "%s,%s,%s,0" % (sceneId, x, y)
		return customActivity.transNpcInfo(self, npcIdx, info, who)
	
	def newNpc(self, npcIdx, name, shape, who=None):
		'''创建Npc
		'''
		if hasattr(self, "currentMonsterType"):
			cls = getMonsterTypeClass(self.currentMonsterType)
			return cls(self)
		return customActivity.newNpc(self, npcIdx, name, shape, who)

	def getScriptHandler(self, script):
		m = re.match("STARS\((\S+),(\S+)\)", script)
		if m:
			args = m.groups()
			return doStarSelect,args
		return customActivity.getScriptHandler(self, script)

	def validFight(self, who, npcObj, fightIdx):
		if hasattr(npcObj, "validFight"):
			return npcObj.validFight(who, fightIdx)
		return customActivity.validFight(self, who, npcObj, fightIdx)

	def getBranchCondition(self, who, npcObj, branchIdx, flag):
		if flag == "scene":
			return npcObj.sceneId
		return customActivity.getBranchCondition(self, who, npcObj, branchIdx, flag)

	def onWarFail(self, warObj, npcObj, w):
		customActivity.onWarFail(self, warObj, npcObj, w)
		if hasattr(npcObj,"onWarFail"):
			npcObj.onWarFail(w,self)

	def onWarWin(self, warObj, npcObj, w):
		customActivity.onWarWin(self, warObj, npcObj, w)
		if hasattr(npcObj, "onWarWin"):
			npcObj.onWarWin(w,self)

	def onStartWar(self, w):
		w.war.gameNpc.onStartWar(w)
		if hasattr(w,"specialBuff"):
			buff.addOrReplace(w,w.specialBuff,99)

	def reward(self, who, rwdIdx, npcObj=None):
		if npcObj.isLimitReward(who):
			rwdIdx = 2001
		customActivity.reward(self, who, rwdIdx, npcObj)

	def getMonsterData(self, sceneId, key):
		return self.monsterData[sceneId][key]

	def getMonsterConfig(self, monsterType, key):
		monsterTypeName = getMonsterTypeName(monsterType)
		return self.monsterConfig[monsterTypeName][key]

	def getRefreshCnt(self, monsterType):
		'''刷新个数
		'''
		monsterCnt = self.getMonsterConfig(monsterType, "刷出量")
		if monsterType == STAR_MONSTER_TYPE_NORMAL:
			roleCnt = role.gKeeper.amount()
			monsterCnt = min(5 + ((roleCnt+199)/200),monsterCnt)

		return monsterCnt

	def autoFreshMonster(self):
		'''自动刷新怪物
		'''
		for sceneId in self.monsterData.iterkeys():
			self.refreshMonster(sceneId,STAR_MONSTER_TYPE_NORMAL)
			self.refreshMonster(sceneId,STAR_MONSTER_TYPE_BOSS)
		self.handleSysMessageRoll(4025)
	
	def refreshMonster(self, sceneId, monsterType):
		'''刷新怪物
		'''
		if monsterType == STAR_MONSTER_TYPE_KING:
			self.removeNpcByTypeFlag(monsterType)

		self.tempSceneName = scene.getScene(sceneId).name
		monsterCnt = self.getRefreshCnt(monsterType)
		self.createMonster(sceneId, monsterType, monsterCnt)

	def createMonster(self, sceneId, monsterType, monsterCnt):
		'''创建怪物
		'''
		self.currentMonsterType = monsterType
		self.currentSceneId = sceneId

		monsterTypeName = getMonsterTypeName(monsterType)
		npcIdx = self.getMonsterData(sceneId, monsterTypeName)
		typeFlag = monsterType
		for i in xrange(monsterCnt):
			npcObj = self.addNpc(self.transIdxByGroup(npcIdx), typeFlag)
			npcObj.monsterType = monsterType
			npcObj.eventIdx = self.getMonsterConfig(monsterType, "事件编号")
			self.tempMonsterName = npcObj.name
		if hasattr(self, "currentMonsterType"):
			del self.currentMonsterType
		if hasattr(self, "currentSceneId"):
			del self.currentSceneId

	def tryRefreshMonsterKind(self, npcObj):
		'''尝试刷新终极BOSS
		'''
		ration = getattr(self,"kindRatio",0)
		if rand(0,100) < ration * 10 + 30:
			self.kindRatio = 0
			sceneId = npcObj.sceneId
			self.refreshMonster(sceneId,STAR_MONSTER_TYPE_KING)
			self.handleSysMessageRoll(4030)
		else:
			self.kindRatio = ration + 1

	def getMonsterById(self, iMonsterId):
		for monsterList in self.npcList.itervalues():
			for monsterObj in monsterList:
				if monsterObj.id == iMonsterId:
					return monsterObj

		return None

	def transString(self, content, pid=0):
		'''转化字符串
		'''
		content = customActivity.transString(self, content, pid)
		if "$scene" in content:
			content = content.replace("$scene", getattr(self, "tempSceneName", ""))
		if "$monster" in content:
			content = content.replace("$monster", getattr(self, "tempMonsterName", ""))

		who = None
		if pid:
			who = getRole(pid)
		if who:
			if "$teamRoleName" in content:
				content = content.replace("$teamRoleName", ",".join(who.teamRoleName))
		return content

	def onRemoveNpc(self, npcObj):
		'''移除npc时
		'''
		customActivity.onRemoveNpc(self, npcObj)
		if npcObj.monsterType != STAR_MONSTER_TYPE_KING:
			if STAR_MONSTER_TYPE_NORMAL not in self.npcList and STAR_MONSTER_TYPE_BOSS not in self.npcList:
				chatIdx = 4027 if hasattr(npcObj,"isTimeout") else 4028
				self.handleSysMessage(chatIdx)
			if npcObj.monsterType == STAR_MONSTER_TYPE_BOSS:
				if npcObj.monsterType not in self.npcList and not hasattr(npcObj,"isTimeout"):
					self.tryRefreshMonsterKind(npcObj)

	def handleSysMessage(self, chatIdxStr):
		'''系统传闻
		'''
		chatIdx = self.transIdxByGroup(int(chatIdxStr))
		message.sysMessage(self.getText(chatIdx))

	def handleSysMessageRoll(self, chatIdxStr):
		'''系统传闻且滚动
		'''
		chatIdx = self.transIdxByGroup(int(chatIdxStr))
		message.sysMessageRoll(self.getText(chatIdx))

	def customCheckBoutLimit(self, warObj):
		'''检查回合数
		'''
		if warObj.gameNpc.monsterType != STAR_MONSTER_TYPE_KING:
			return False

		if warObj.bout >= 200:
			warObj.isEnd = True
			warObj.winner = TEAM_SIDE_2
			warObj.isBoutLimit = True

		return True

	def say(self, w, chatIdx):
		'''说话
		'''
		content = self.getText(chatIdx)
		w.war.say(w,content)

	def setupWar(self, warObj, who, npcObj):
		if npcObj and npcObj.monsterType != STAR_MONSTER_TYPE_NORMAL: #设置手动
			warObj.setAutoFight(False)

		#把召唤怪先存起来
		fightList = self.getFightInfo(1031)
		monsterList = war.warctrl.createMonsterList(who,1031,fightList,self.getAbleInfo(),self.getLineupInfo(),self,npcObj)
		if monsterList:
			warObj.summonMonsterObj = monsterList[WARRIOR_TYPE_NORMAL][0]

	def onNewHour(self, day, hour, wday):
		if 0 < hour < 10:
			return
		self.autoFreshMonster()

	def removeAllNpc(self):
		lst = []
		for monsterObj in self.npcList.get(STAR_MONSTER_TYPE_NORMAL,[]):
			lst.append(monsterObj)
		for monsterObj in self.npcList.get(STAR_MONSTER_TYPE_BOSS,[]):
			lst.append(monsterObj)

		for monsterObj in lst:
			self.removeNpc(monsterObj)

	def testCmd(self, who, cmdIdx, *args):
		if cmdIdx == 1:
			self.autoFreshMonster()
		elif cmdIdx == 2:
			self.removeAllNpc()

STAR_MONSTER_TYPE_NORMAL = 1
STAR_MONSTER_TYPE_BOSS = 2
STAR_MONSTER_TYPE_KING = 3

class NormalMonster(activity.object.Npc):
	'''小怪
	'''
	monsterType = STAR_MONSTER_TYPE_BOSS

	def __init__(self, gameObj):
		activity.object.Npc.__init__(self, gameObj)
		self.selectTime = 0
		self.selectLst = []
		self.timerMgr = timer.cTimerMng()
		self.timerId = 0

		timeLimit = self.getTimeLimit()
		if timeLimit:
			self.timerId = self.timerMgr.run(self.timeOut, timeLimit, 0, "timeOut")

	def validFight(self, who, fightIdx):
		if not who.validInTeamSize(3):
			self.game.doScript(who, self, "D4022")
			return 0

		if not self.validLevel(who):
			return 0

		if self.inWar():
			return 0

		return 1

	def validLevel(self, who):
		lst = []
		teamObj = who.getTeamObj()
		minLevel = self.getMinLevel()
		for pid in teamObj.getInTeamList():
			roleObj = getRole(pid)
			if roleObj.level < minLevel:
				lst.append(roleObj.name)

		if lst:
			who.teamRoleName = lst
			self.sayInvaildLevel(who)
			del who.teamRoleName
			return 0

		return 1

	def sayInvaildLevel(self, who):
		self.game.doScript(who, self, "D4020")

	def getMinLevel(self):
		minLevel = self.game.getMonsterConfig(self.monsterType, "等级")
		return minLevel

	def isLimitReward(self, who):
		'''时间奖励次数够了
		'''
		return who.day.fetch("starKill") >= 3

	def getTimeLimit(self):
		'''时间限制
		'''
		return self.game.getMonsterConfig(self.monsterType, "存活时间") * 60

	def timeOut(self):
		'''时间到了
		'''
		self.isTimeout = 1
		self.game.removeNpc(self)

	def isWanEndDel(self, warObj):
		'''战斗结束，玩家胜利才删除
		'''
		if warObj.winner == TEAM_SIDE_1:
			return True
		return False 

	def onWarEnd(self, warObj):
		activity.object.Npc.onWarEnd(self, warObj)
		if self.isWanEndDel(warObj):
			self.game.removeNpc(self)

	def onStartWar(self, w):
		who = getRole(w.id)
		if who and self.isLimitReward(who):
			self.game.doScript(who, self, "TP4023")

	def removeSelect(self, who):
		'''移除抽取队列
		'''
		if who.id in self.selectLst:
			self.selectLst.remove(who.id)
			self.selectChange()
			self.closeSelect(who)
			if not self.selectLst:
				self.selectTime = 0
				self.timerMgr.cancel(self.timerId)

	def sendSelectBox(self, who, branchIdx, flag):
		'''发送抽取界面
		'''
		if not self.validFight(who,0):
			return
		if who.id in self.selectLst:
			return
		now = getSecond()
		if not self.selectTime:
			self.timerId = self.timerMgr.run(functor(self.selectFightTeam,branchIdx,flag),5)
			self.selectTime = now
		self.selectAdd(who.id)
		for pid in who.getTeamObj().getInTeamList():
			roleObj = getRole(pid)
			if roleObj:
				roleObj.endPoint.rpcStarSelectSend(self.id, 5-(now-self.selectTime),len(self.selectLst))

	def selectAdd(self, iRoleId):
		'''添加抽取
		'''
		if iRoleId not in self.selectLst:
			self.selectLst.append(iRoleId)
			self.selectChange(iRoleId)

	def selectChange(self, filterId=0):
		'''人数改变
		'''
		iAmount = len(self.selectLst)
		for roleId in self.selectLst:
			if filterId == roleId:
				continue
			who = getRole(roleId)
			if not who or not who.inTeam():
				continue
			for pid in who.getTeamObj().getInTeamList():
				roleObj = getRole(pid)
				if roleObj:
					roleObj.endPoint.rpcStarSelectMod(iAmount=iAmount)

	def selectFightTeam(self, branchIdx, flag):
		'''选择战斗队伍
		'''
		isSelect = False
		lst = shuffleList(self.selectLst)
		for roleId in lst:
			who = getRole(roleId)
			if not who:
				continue
			if not isSelect and self.validFight(who,0):
				self.game.doScript(who, self, "B({},{})".format(branchIdx,flag))
				isSelect = True
				self.closeSelect(who)
			else:
				self.closeSelect(who,True)

		self.selectTime = 0
		self.selectLst = []

	# def sendSelectResult(self, fightTeamMsg, who):
	# 	'''发送选择结果
	# 	'''
	# 	for otherRoleId in self.selectLst:
	# 		if otherRoleId == who.id:
	# 			self.closeSelect(who)
	# 			continue
	# 		otherObj = getRole(otherRoleId)
	# 		if not otherObj or not otherObj.inTeam():
	# 			continue
	# 		for pid in otherObj.getTeamObj().getInTeamList():
	# 			roleObj = getRole(pid)
	# 			if roleObj:
	# 				roleObj.endPoint.rpcStarSelectResult(**fightTeamMsg)
	# 				content = self.getContent(5006,roleObj)
	# 				message.tips(roleObj,content)

	# 	self.selectTime = 0
	# 	self.selectLst = []

	def closeSelect(self, who, bTips=False):
		'''关闭选择框
		'''
		if not who.inTeam():
			return
		for pid in who.getTeamObj().getInTeamList():
			roleObj = getRole(pid)
			if roleObj:
				roleObj.endPoint.rpcStarSelectClose()
				if bTips:
					message.tips(roleObj,self.getContent(5006,roleObj))

	def onWarWin(self, w, gameObj):
		who = getRole(w.id)
		if not who:
			return
		for pid in who.getTeamObj().getInTeamList():
			obj = getRole(pid)
			if obj:
				obj.day.add("starKill",1)

	def onWarFail(self, w, gameObj):
		who = getRole(w.id)
		if not who or not who.getTeamObj().isLeader(who.id):
			return
		if self.monsterType not in gameObj.npcList or self.id not in gameObj.npcList[self.monsterType]:
			content =self.getContent(4026,who)
			message.tips(who, content)

	def getContent(self, chatIdx, who):
		content = self.game.getText(chatIdx,who.id)
		if "$boss" in content:
			content = content.replace("$boss",self.name)
		if "$bScene" in content:
			content = content.replace("$bScene",scene.getScene(self.sceneId).name)
		if "$pos" in content:
			content = content.replace("$pos","({},{})".format(self.x,self.y))

		return content

class BossMonster(NormalMonster):
	'''boss怪
	'''
	monsterType = STAR_MONSTER_TYPE_BOSS

	def onWarFail(self, w, gameObj):
		who = getRole(w.id)
		if not who or not who.getTeamObj().isLeader(who.id):
			return
		if self.monsterType not in gameObj.npcList or self not in gameObj.npcList[self.monsterType]:
			content =self.getContent(4026,who)
			message.tips(who, content)
		else:
			content =self.getContent(4029,who)
			message.sysMessage(content)

class KingMonster(NormalMonster):
	'''终极BOSS怪
	'''
	monsterType = STAR_MONSTER_TYPE_KING

	def onStartWar(self, w):
		who = getRole(w.id)
		if who and self.isLimitReward(who):
			self.game.doScript(who, self, "TP4024")

	def onWarFail(self, w, gameObj):
		who = getRole(w.id)
		if not who or not who.getTeamObj().isLeader(who.id):
			return
		content =self.getContent(4032,who)
		message.sysMessage(content)
		if hasattr(w.war,"isBoutLimit"):
			self.game.doScript(who, self, "TTP4033")

	def sayInvaildLevel(self, who):
		self.game.doScript(who, self, "D4021")

	def isLimitReward(self, who):
		'''时间奖励次数够了
		'''
		return who.day.fetch("starKindKill") >= 1

	def onWarWin(self, w, gameObj):
		who = getRole(w.id)
		if not who:
			return
		for pid in who.getTeamObj().getInTeamList():
			obj = getRole(pid)
			if obj:
				obj.day.add("starKindKill",1)

monsterType2Class = {
	STAR_MONSTER_TYPE_NORMAL: NormalMonster,
	STAR_MONSTER_TYPE_BOSS: BossMonster,
	STAR_MONSTER_TYPE_KING: KingMonster,
}

monsterType2Name = {
	STAR_MONSTER_TYPE_NORMAL: "小怪",
	STAR_MONSTER_TYPE_BOSS: "BOSS怪",
	STAR_MONSTER_TYPE_KING: "终极BOSS怪",
}

def getMonsterTypeClass(monsterType):
	return monsterType2Class[monsterType]

def getMonsterTypeName(monsterType):
	return monsterType2Name[monsterType]

def doStarSelect(gameObj, who, npcObj, branchIdx, flag):
	'''杀星抽取脚本
	'''
	npcObj.sendSelectBox(who, branchIdx, flag)

def packFightTeamMsg(who):
	'''打包战斗队伍信息
	'''
	lst = []
	for roleId in who.getTeamObj().getInTeamList():
		who = getRole(roleId)
		msgObj = act_star_pb2.roleInfo()
		msgObj.iRoleId = roleId
		msgObj.iLevel = who.level
		msgObj.sName = who.name
		msgObj.iSchool = who.school
		msgObj.iShape = who.shape
		lst.append(msgObj)

	msg = {}
	msg["roleList"] = lst
	return msg

def rpcSelectCancle(who, reqMsg):
	'''取消抽取
	'''
	if not who.inTeam() or not who.getTeamObj().isLeader(who.id):
		return
	iMonsterId = reqMsg.iMonsterId
	actObj = activity.getActivity("star")
	monsterObj = actObj.getMonsterById(iMonsterId)
	if monsterObj:
		monsterObj.removeSelect(who)

from common import *
from war.defines import *
import act_star_pb2
import activity
import message
import scene
import timer
import war.warctrl
import buff
import role