编号	等级_S	生命_S	真气_S	物理伤害_S	法术伤害_S	物理防御_S	法术防御_S	速度_S	治疗强度_S	封印命中_S	抵抗封印_S	物理抗性	法术抗性	攻击修炼	物防修炼	法防修炼	物理暴击	物理抗暴	法术暴击	法术抗暴	愤怒初始值	符能初始值
1001	LV	B*0.98	B*1	B*0.81	B*0.81	B*0.6	B*0.6	B*0.8	B*0.56	B*0	B*0.8	0	0	0	0	0						
1002	LV	B*0.75	B*1	B*0.45	B*0.65	B*0.39	B*0.56	B*0.64	B*0.45	B*0	B*0.8	0	0	0	0	0						
1003	LV	B*0.75	B*1	B*0.65	B*0.45	B*0.56	B*0.39	B*0.64	B*0.45	B*0	B*0.8	0	0	0	0	0						
2001	LV+1	B*1.13	B*1	B*0.97	B*0.97	B*0.72	B*0.72	B*0.96	B*0.67	B*0	B*0.8	0	0	0	0	0						
2002	LV	B*0.98	B*1	B*0.56	B*0.81	B*0.49	B*0.7	B*0.8	B*0.56	B*0	B*0.8	0	0	0	0	0						
2003	LV	B*0.98	B*1	B*0.81	B*0.56	B*0.7	B*0.49	B*0.8	B*0.56	B*0	B*0.8	0	0	0	0	0						