# -*- coding: utf-8 -*-
from task.defines import *
# from task.object import TeamTask as customTask
from task.instance import InstanceTask as customTask

#导表开始
class Task(customTask):
	parentId = 30401
	targetType = TASK_TARGET_TYPE_NPC
	icon = 0
	title = '''竹林除妖'''
	intro = '''战胜$target'''
	detail = '''$target正在袭击村民，快去营救'''
	rewardDesc = ''''''
	goAheadScript = ''''''
	initScript = '''N1002,NI1001,E(1002,1003),E(1001,1002),STORY30401'''

	npcInfo = {
		1001:{"名称":"村民","造型":"1111(1,1,1,1,1,0)","染色":"0,0,0,0,0","位置":"4010,22,38,4"},
		1002:{"名称":"僵尸","造型":"1111(1,1,1,1,1,0)","染色":"0,0,0,0,0","位置":"4010,25,35,8"},
		1003:{"名称":"受伤的村民","造型":"1111(1,1,1,1,1,0)","染色":"0,0,0,0,0","位置":"4010,22,38,4","动作":5},
		1004:{"名称":"愤怒的村民","造型":"1111(1,1,1,1,1,0)","染色":"0,0,0,0,0","位置":"4010,15,33,2"},
		1005:{"名称":"悲伤的村民","造型":"1111(1,1,1,1,1,0)","染色":"0,0,0,0,0","位置":"4010,16,31,2"},
		1006:{"名称":"僵尸头领","造型":"4502(0,1,0,0,0,0)","染色":"0,0,0,0,0","位置":"4010,55,6,6"},
		1007:{"名称":"赤尸童子","造型":"4001(0,1,0,0,0,0)","染色":"0,0,0,0,0","位置":"4010,40,20,6"},
		1008:{"名称":"赤尸神君","造型":"1511(1,1,1,1,1,0)","染色":"0,0,0,0,0","位置":"4010,70,40,6"},
	}

	eventInfo = {
		1001:{"点击":"STORY30401,T30401"},
		1002:{"点击":"TD1001"},
		1003:{"点击":"SB1002","回复":"1:F1001","成功":"TR1001,TD1004,DONE,T30403"},
		1004:{"点击":"SB1009","回复":"1:F1003","成功":"TR1003,DONE,T30404"},
		1005:{"点击":"TD1010,E(0,1006)"},
		1006:{"点击":"SB1011","回复":"1:F1004","成功":"TR1004,TD1012,DONE,T30405"},
		1007:{"点击":"TD1013,E(0,1008)"},
		1008:{"点击":"SB1014","回复":"1:F1005","成功":"TR1005,TD1016,DONE"},
		1009:{"点击":"TD1005,E(0,1010)"},
		1010:{"点击":"TD1006,E(0,1011)"},
		1011:{"点击":"SB1007","回复":"1:F1002","成功":"TR1006,TD1008,DONE,T30403"},
		1012:{"点击":"TD1015"},
	}

	rewardInfo = {
		1001:{"经验":lambda LV:LV*370+4000,"宠物经验":lambda PLV:PLV*260+2800,"银币":lambda LV:LV*130+2000,"物品":[1001]},
		1002:{"经验":lambda LV:LV*185+2000,"宠物经验":lambda PLV:PLV*130+1400,"银币":lambda LV:LV*65+1000},
		1006:{"经验":lambda LV:LV*185+2000,"宠物经验":lambda PLV:PLV*130+1400,"银币":lambda LV:LV*65+1000,"物品":[1001]},
		1003:{"经验":lambda LV:LV*407+4400,"宠物经验":lambda PLV:PLV*284+3080,"银币":lambda LV:LV*143+2200,"物品":[1002]},
		1004:{"经验":lambda LV:LV*518+5600,"宠物经验":lambda LV:LV*362+3920,"银币":lambda LV:LV*182+2800,"物品":[1003]},
		1005:{"经验":lambda LV:LV*555+6000,"宠物经验":lambda LV:LV*388+4200,"银币":lambda LV:LV*195+3000,"物品":[1004]},
	}

	rewardPropsInfo = {
		1001:(
			{"权重":45,"物品":"202001","数量":"1","绑定":0},
			{"权重":45,"物品":"202002","数量":"1","绑定":0},
			{"权重":45,"物品":"202003","数量":"1","绑定":0},
			{"权重":45,"物品":"202004","数量":"1","绑定":0},
			{"权重":45,"物品":"202005","数量":"1","绑定":0},
			{"权重":90,"物品":"230101","数量":"1","绑定":0},
			{"权重":90,"物品":"230102","数量":"1","绑定":0},
			{"权重":90,"物品":"230103","数量":"1","绑定":0},
			{"权重":90,"物品":"246001","数量":"1","绑定":0},
			{"权重":90,"物品":"246002","数量":"1","绑定":0},
			{"权重":90,"物品":"246003","数量":"1","绑定":0},
			{"权重":90,"物品":"246004","数量":"1","绑定":0},
			{"权重":90,"物品":"246005","数量":"1","绑定":0},
			{"权重":90,"物品":"246006","数量":"1","绑定":0},
			{"权重":90,"物品":"246007","数量":"1","绑定":0},
			{"权重":90,"物品":"246008","数量":"1","绑定":0},
			{"权重":90,"物品":"246009","数量":"1","绑定":0},
			{"权重":90,"物品":"246010","数量":"1","绑定":0},
			{"权重":1400,"物品":"0","数量":"0","绑定":0},
		),
		1002:(
			{"权重":40,"物品":"202001","数量":"1","绑定":0},
			{"权重":40,"物品":"202002","数量":"1","绑定":0},
			{"权重":40,"物品":"202003","数量":"1","绑定":0},
			{"权重":40,"物品":"202004","数量":"1","绑定":0},
			{"权重":40,"物品":"202005","数量":"1","绑定":0},
			{"权重":80,"物品":"230101","数量":"1","绑定":0},
			{"权重":80,"物品":"230102","数量":"1","绑定":0},
			{"权重":130,"物品":"230103","数量":"1","绑定":0},
			{"权重":100,"物品":"224103","数量":"2","绑定":0},
			{"权重":100,"物品":"224104","数量":"2","绑定":0},
			{"权重":100,"物品":"224105","数量":"2","绑定":0},
			{"权重":100,"物品":"224106","数量":"2","绑定":0},
			{"权重":100,"物品":"224107","数量":"2","绑定":0},
			{"权重":210,"物品":"234901","数量":"1","绑定":0,"传闻":"SM6003"},
			{"权重":800,"物品":"0","数量":"0","绑定":0},
		),
		1003:(
			{"权重":35,"物品":"202001","数量":"1","绑定":0},
			{"权重":35,"物品":"202002","数量":"1","绑定":0},
			{"权重":35,"物品":"202003","数量":"1","绑定":0},
			{"权重":35,"物品":"202004","数量":"1","绑定":0},
			{"权重":35,"物品":"202005","数量":"1","绑定":0},
			{"权重":70,"物品":"230101","数量":"1","绑定":0},
			{"权重":70,"物品":"230102","数量":"1","绑定":0},
			{"权重":70,"物品":"230103","数量":"1","绑定":0},
			{"权重":120,"物品":"234903","数量":"1","绑定":0,"传闻":"SM6003"},
			{"权重":145,"物品":"230001","数量":"1","绑定":0,"传闻":"SM6003"},
			{"权重":200,"物品":"224108","数量":"1","绑定":0},
			{"权重":300,"物品":"245001","数量":"5","绑定":0},
			{"权重":250,"物品":"245001","数量":"3","绑定":0},
			{"权重":600,"物品":"0","数量":"0","绑定":0},
		),
		1004:(
			{"权重":30,"物品":"202001","数量":"1","绑定":0},
			{"权重":30,"物品":"202002","数量":"1","绑定":0},
			{"权重":30,"物品":"202003","数量":"1","绑定":0},
			{"权重":30,"物品":"202004","数量":"1","绑定":0},
			{"权重":30,"物品":"202005","数量":"1","绑定":0},
			{"权重":60,"物品":"230101","数量":"1","绑定":0},
			{"权重":60,"物品":"230102","数量":"1","绑定":0},
			{"权重":60,"物品":"230103","数量":"1","绑定":0},
			{"权重":90,"物品":"234902","数量":"1","绑定":0,"传闻":"SM6003"},
			{"权重":272,"物品":"234904","数量":"1","绑定":0,"传闻":"SM6003"},
			{"权重":277,"物品":"247002","数量":"1","绑定":0},
			{"权重":277,"物品":"247003","数量":"1","绑定":0},
			{"权重":277,"物品":"241305","数量":"1","绑定":0},
			{"权重":277,"物品":"241306","数量":"1","绑定":0},
			{"权重":200,"物品":"0","数量":"0","绑定":0},
		),
	}

	groupInfo = {
	}

	chatInfo = {
		1001:'''少侠们，有僵尸啊！快救救我！''',
		1002:'''呜~ 嘶~ 嗷~ 呱~\nQ救下村民''',
		1003:'''妖物速速受死！''',
		1004:'''哇……（僵尸灰飞烟灭）	*A*nA**SS*$S2S$我们调查僵尸们来的足迹应该能有所收获''',
		1005:'''啊……（村民晕倒）	*A*nA**SS*$S2S$哎呀，村民被我们误伤晕倒了。''',
		1006:'''你们为什么在这里？你们为什么打伤我大爷？！	*A*nA**SS*$S2S$不是的，我们是来救他的，你们误会了	*A愤怒的村民A**S1111S*$S1S$这些外来人肯定不是什么好人，抓他们去官府''',
		1007:'''你们还想反抗吗？\nQ冷静一下''',
		1008:'''他们好强！	*A*nA**SS*$S2S$你们听我们解释吧，是我们不小心伤到的。治疗一下应该没什么大碍了，是我们疏忽了。	*A村民A**S1111S*$S1S$麻烦诸位少侠了，是我们鲁莽了。	*A*nA**SS*$S2S$我们调查僵尸们来的足迹应该能有所收获''',
		1009:'''呵呵，居然有羊自己跑上门来的\nQ你才是羊''',
		1010:'''你们竟敢破坏师尊的计划，是不是活得不耐烦了''',
		1011:'''可恶的多管闲事之人，你们会付出代价的。\nQ开打''',
		1012:'''别打了，我告诉你们师尊在哪里。！	*A*nA**SS*$S2S$赶紧带路，饶你狗命！（走到桥头）	*A赤尸童子A**S1111S*$S1S$师傅！快救我，他们威胁我来找你。	*A*nA**SS*$S2S$你就是幕后黑手？	*A赤尸神君A**S1111S*$S1S$你们很大胆，不过你们居然能找到这里来，很不错''',
		1013:'''你们居然能找到这里来，不错''',
		1014:'''不过你们敢打乱老夫的计划，你们死到临头了\nQ开打''',
		1015:'''你们打伤了大爷，不要跑''',
		1016:'''居然被黄毛小儿重伤，真是丢脸，先暂时撤退吧。我会再回来的！''',
		6003:'''#C01$roleName#n为村民们除去了#L1<14,16>*[竹林妖魔]*02#n，获得了村民们赠予的$lnkProps''',
		2001:'''狂暴''',
		2002:'''血炼大法''',
	}

	branchInfo = {
	}

	fightInfo = {
		1001:(
			{"类型":0,"名称":"村民","造型":"1111(1,1,1,1,1,0)","能力编号":"1001","数量":"1","站位":(1,)},
			{"类型":0,"名称":"僵尸","造型":"1111(1,1,1,1,1,0)","能力编号":"1002","数量":"2","技能":(5403,),"站位":(2,3,)},
			{"类型":0,"名称":"僵尸","造型":"1111(1,1,1,1,1,0)","能力编号":"1002","数量":"3","技能":(5413,),"站位":(4,5,6,)},
		),
		1002:(
			{"类型":0,"名称":"愤怒的村民","造型":"1111(1,1,1,1,1,0)","能力编号":"1003","数量":"1","技能":(5406,),"站位":(5,)},
			{"类型":0,"名称":"怨愤的村民","造型":"1111(1,1,1,1,1,0)","能力编号":"1003","数量":"1","技能":(5407,),"站位":(3,)},
			{"类型":0,"名称":"悲伤的村民","造型":"1111(1,1,1,1,1,0)","能力编号":"1003","数量":"1","技能":(5408,),"站位":(1,)},
			{"类型":0,"名称":"盛怒的村民","造型":"1111(1,1,1,1,1,0)","能力编号":"1003","数量":"1","技能":(5409,),"站位":(2,)},
			{"类型":0,"名称":"恼怒的村民","造型":"1111(1,1,1,1,1,0)","能力编号":"1003","数量":"1","技能":(5410,),"站位":(4,)},
		),
		1003:(
			{"类型":0,"名称":"僵尸头领","造型":"4502(0,1,0,0,0,0)","能力编号":"1004","数量":"1","技能":(1321,1322,1323,),"站位":(1,)},
			{"类型":0,"名称":"僵尸","造型":"1111(1,1,1,1,1,0)","能力编号":"1002","数量":"5","技能":(5403,),"站位":(2,3,4,5,6,)},
		),
		1004:(
			{"类型":0,"名称":"赤尸童子","造型":"4001(0,1,0,0,0,0)","能力编号":"1004","数量":"1","技能":(1321,1322,1323,),"站位":(1,)},
			{"类型":0,"名称":"帮手","造型":"4504(0,1,0,0,0,0)","能力编号":"1005","数量":"2","技能":(1511,1512,1513,),"站位":(2,3,)},
			{"类型":0,"名称":"僵尸","造型":"1111(1,1,1,1,1,0)","能力编号":"1002","数量":"5","技能":(5403,),"站位":(4,5,6,7,8,)},
		),
		1005:(
			{"类型":0,"名称":"赤尸神君","造型":"1511(1,1,1,1,1,0)","能力编号":"1007","数量":"1","技能":(1512,1531,1532,1533,5501,),"站位":(1,)},
			{"类型":0,"名称":"贴身童子","造型":"1411(1,1,1,1,1,0)","能力编号":"1006","数量":"2","技能":(1612,1621,1622,),"站位":(2,3,),"AI集":"治疗集","精通技能":1622},
			{"类型":0,"名称":"僵尸","造型":"1111(1,1,1,1,1,0)","能力编号":"1002","数量":"7","技能":(5403,),"站位":(4,5,6,7,8,9,10,)},
		),
	}

	ableInfo = {
		1001:{"等级":"BALV","生命":"B*1.5","真气":"B*1","物理伤害":"B*0.1","法术伤害":"B*0.1","物理防御":"B*0.5","法术防御":"B*0.5","速度":"B*1","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1002:{"等级":"BALV","生命":"B*1.5","真气":"B*1","物理伤害":"B*0.5","法术伤害":"B*0.5","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1003:{"等级":"BALV","生命":"B*2","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.5","法术防御":"B*0.5","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1004:{"等级":"BALV","生命":"B*3.5","真气":"B*1","物理伤害":"B*0.8","法术伤害":"B*0.8","物理防御":"B*0.7","法术防御":"B*0.7","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1005:{"等级":"BALV","生命":"B*2.5","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.6","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*1","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1006:{"等级":"BALV","生命":"B*2.5","真气":"B*1","物理伤害":"B*1","法术伤害":"B*1","物理防御":"B*0.7","法术防御":"B*0.7","速度":"B*0.1","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0,"治疗强度":"B*1"},
		1007:{"等级":"BALV","生命":"B*4","真气":"B*1","物理伤害":"B*1.2","法术伤害":"B*1.2","物理防御":"B*0.7","法术防御":"B*0.7","速度":"B*1.2","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
	}

	lineupInfo = {
	}

	configInfo = {
		"生成路径":"bamboo",
	}
#导表结束

	def initInstanceTask(self):#override
		'''设置副本任务类型
		'''
		self.instanceTaskType = activity.instance.BAMBOO_INSTANCE
		self.lastTaskId = 30405
		
	def reward(self, who, rwdIdx, npcObj=None):#override
		'''每天第一次完成有奖励,以后只奖励侠义值
		'''
		normalReward = True
		instanceReward = who.day.fetch("instanceReward", [])
		if rwdIdx in instanceReward:
			normalReward = False
		elif rwdIdx in (1001, 1002):#两个奖励只能获得一个
			if 1001 in instanceReward or 1002 in instanceReward:
				normalReward = False
		elif rwdIdx == 1006:	#第一关拿了1001奖励就不能拿1006奖励
			if 1001 in instanceReward:
				normalReward = False

		if normalReward:#正常奖励
			customTask.reward(self, who, rwdIdx, npcObj)
			instanceReward.append(rwdIdx)
			who.day.set("instanceReward", instanceReward)
		else:#只奖励侠义值
			self.rewardHelpPoint(who)
			#who.addHelpPoint(1, "instance_{}".format(self.id))

	#============================================
	#============================================
	def onStartWar(self, w):
		if self.id == 30401:
			self.villagerDeath = 0		#村民是否死亡
			self.monsterDeathCnt = 0	#僵尸怪物死亡个数

	def onAddWarrior(self, w):
		if self.id == 30401:
			w.addFunc("beforeDie", self.beforeDie)
			if w.isMonster() and w.name == "村民":
				w.addFunc("onNewRound", self.onNewRound)
	
	def onNewRound(self, w):
		'''回合前设置逃跑指令
		'''
		if self.id == 30401:
			#僵尸全部死亡,村民逃跑
			if self.monsterDeathCnt >= 5:
				if not self.villagerDeath:
					war.commands.doEscape(w)

	def customEscapeRatio(self, w):
		'''村民逃跑100%成功
		'''
		if self.id == 30401 and w.isMonster() and w.name == "村民":
			return 100
		return None
		
	def beforeDie(self, w, att):
		if self.id == 30401:
			if w.isMonster() and w.name == "村民":
				self.villagerDeath = 1
			elif w.isMonster() and w.name == "僵尸":
				self.monsterDeathCnt += 1

	def onWarWin(self, warObj, npcObj, w):
		if self.id == 30401:
			#击杀了怪物“村民”，则会触发事件1010，获得任务30402
			if self.villagerDeath:
				who = getRole(self.ownerId)
				if not who:
					return
				self.doScript(who, npcObj, "TR1002,E(0,1010),DONE,T30402")
				return
		customTask.onWarWin(self, warObj, npcObj, w)

	

	#============================================


from common import *
import war.commands
import activity.instance
import scene
import task.instance