#-*-coding:utf-8-*-
#作者:叶伟龙@龙川县赤光镇
#导表开始
gdData={
	3301:{"技能名称":"舍身","技能图标":"s3301","出现等级":0,"类型":1,"出现部位":3,"评分":30,"消耗愤怒":0},
	3302:{"技能名称":"白刃","技能图标":"s3302","出现等级":0,"类型":1,"出现部位":3,"评分":30,"消耗愤怒":0},
	3303:{"技能名称":"霜剑","技能图标":"s3303","出现等级":0,"类型":1,"出现部位":3,"评分":30,"消耗愤怒":0},
	3304:{"技能名称":"封禁","技能图标":"s3304","出现等级":0,"类型":1,"出现部位":3,"评分":30,"消耗愤怒":0},
	3305:{"技能名称":"暗香","技能图标":"s3305","出现等级":0,"类型":1,"出现部位":3,"评分":30,"消耗愤怒":0},
	3201:{"技能名称":"灵药","技能图标":"s3201","出现等级":0,"类型":1,"出现部位":2,"评分":30,"消耗愤怒":0},
	3202:{"技能名称":"生死意","技能图标":"s3202","出现等级":0,"类型":1,"出现部位":2,"评分":30,"消耗愤怒":0},
	3203:{"技能名称":"妙手","技能图标":"s3203","出现等级":0,"类型":1,"出现部位":2,"评分":30,"消耗愤怒":0},
	3204:{"技能名称":"流霜","技能图标":"s3204","出现等级":0,"类型":1,"出现部位":2,"评分":30,"消耗愤怒":0},
	3205:{"技能名称":"惠赠","技能图标":"s3205","出现等级":0,"类型":1,"出现部位":2,"评分":30,"消耗愤怒":0},
	3206:{"技能名称":"浩然气","技能图标":"s3206","出现等级":0,"类型":1,"出现部位":2,"评分":30,"消耗愤怒":0},
	3101:{"技能名称":"盈袖","技能图标":"s3101","出现等级":0,"类型":1,"出现部位":1,"评分":30,"消耗愤怒":0},
	3102:{"技能名称":"持身","技能图标":"s3102","出现等级":0,"类型":1,"出现部位":1,"评分":30,"消耗愤怒":0},
	3103:{"技能名称":"怒目","技能图标":"s3103","出现等级":0,"类型":1,"出现部位":1,"评分":30,"消耗愤怒":0},
	3104:{"技能名称":"防御","技能图标":"s3104","出现等级":0,"类型":1,"出现部位":1,"评分":30,"消耗愤怒":0},
	3105:{"技能名称":"风鸣","技能图标":"s3105","出现等级":0,"类型":1,"出现部位":1,"评分":30,"消耗愤怒":0},
	3501:{"技能名称":"提携","技能图标":"s3501","出现等级":0,"类型":1,"出现部位":5,"评分":30,"消耗愤怒":0},
	3502:{"技能名称":"碧水流","技能图标":"s3502","出现等级":0,"类型":1,"出现部位":5,"评分":30,"消耗愤怒":0},
	3503:{"技能名称":"千堆雪","技能图标":"s3503","出现等级":0,"类型":1,"出现部位":5,"评分":30,"消耗愤怒":0},
	3504:{"技能名称":"横剑","技能图标":"s3504","出现等级":0,"类型":1,"出现部位":5,"评分":30,"消耗愤怒":0},
	3505:{"技能名称":"怒气","技能图标":"s3505","出现等级":0,"类型":1,"出现部位":5,"评分":30,"消耗愤怒":0},
	3601:{"技能名称":"形影","技能图标":"s3601","出现等级":0,"类型":1,"出现部位":6,"评分":30,"消耗愤怒":0},
	3602:{"技能名称":"移形","技能图标":"s3602","出现等级":0,"类型":1,"出现部位":6,"评分":30,"消耗愤怒":0},
	3603:{"技能名称":"绕指柔","技能图标":"s3603","出现等级":0,"类型":1,"出现部位":6,"评分":30,"消耗愤怒":0},
	3604:{"技能名称":"疏雨","技能图标":"s3604","出现等级":0,"类型":1,"出现部位":6,"评分":30,"消耗愤怒":0},
	3401:{"技能名称":"不著","技能图标":"s3401","出现等级":0,"类型":1,"出现部位":4,"评分":30,"消耗愤怒":0},
	3402:{"技能名称":"真力","技能图标":"s3402","出现等级":0,"类型":1,"出现部位":4,"评分":30,"消耗愤怒":0},
	3403:{"技能名称":"同尘","技能图标":"s3403","出现等级":0,"类型":1,"出现部位":4,"评分":30,"消耗愤怒":0},
	3404:{"技能名称":"坚志","技能图标":"s3404","出现等级":0,"类型":1,"出现部位":4,"评分":30,"消耗愤怒":0},
	3405:{"技能名称":"拂衣","技能图标":"s3405","出现等级":0,"类型":1,"出现部位":4,"评分":30,"消耗愤怒":0},
	3901:{"技能名称":"朔气","技能图标":"s3901","出现等级":60,"类型":1,"出现部位":9,"评分":30,"消耗愤怒":0},
	3902:{"技能名称":"玉壶冰","技能图标":"s3902","出现等级":70,"类型":1,"出现部位":9,"评分":30,"消耗愤怒":0},
	4001:{"技能名称":"仰聆玉章","技能图标":"s4001","出现等级":70,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":60},
	4002:{"技能名称":"折节死生","技能图标":"s4002","出现等级":70,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":90},
	4003:{"技能名称":"清风入松","技能图标":"s4003","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":60},
	4004:{"技能名称":"一蓑风雨","技能图标":"s4004","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":130},
	4005:{"技能名称":"钟鼓馔玉","技能图标":"s4005","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":90},
	4006:{"技能名称":"绿蚁红泥","技能图标":"s4006","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":135},
	4007:{"技能名称":"金灶仙桃","技能图标":"s4007","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":60},
	4008:{"技能名称":"洗尽尘缘","技能图标":"s4008","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":90},
	4009:{"技能名称":"风起鹤归","技能图标":"s4009","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":120},
	4010:{"技能名称":"海上明月","技能图标":"s4010","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":120},
	4011:{"技能名称":"青松翠叶","技能图标":"s4011","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":150},
	4012:{"技能名称":"俯仰自得","技能图标":"s4012","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":60},
	4013:{"技能名称":"万世不竭","技能图标":"s4013","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":90},
	4014:{"技能名称":"碧山孤月","技能图标":"s4014","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":100},
	4015:{"技能名称":"清溪水色","技能图标":"s4015","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":50},
	4016:{"技能名称":"白鹿青崖","技能图标":"s4016","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":100},
	4017:{"技能名称":"松月夜凉","技能图标":"s4017","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":125},
	4018:{"技能名称":"荷风竹露","技能图标":"s4018","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":150},
	4019:{"技能名称":"青莲净心","技能图标":"s4019","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":45},
	4020:{"技能名称":"霜凄万木","技能图标":"s4020","出现等级":70,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":100},
	4021:{"技能名称":"挥刃弯弓","技能图标":"s4021","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":80},
	4022:{"技能名称":"摧眉折腰","技能图标":"s4022","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":40},
	4023:{"技能名称":"远树寒烟","技能图标":"s4023","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":60},
	4024:{"技能名称":"净扫胡尘","技能图标":"s4024","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":40},
	4025:{"技能名称":"吴钩霜雪","技能图标":"s4025","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":70},
	4026:{"技能名称":"江海凝光","技能图标":"s4026","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":40},
	4027:{"技能名称":"长风破浪","技能图标":"s4027","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":80},
	4028:{"技能名称":"秋水流光","技能图标":"s4028","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":40},
	4029:{"技能名称":"振衣千仞","技能图标":"s4029","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":70},
	4030:{"技能名称":"金铃绿章","技能图标":"s4030","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":40},
	4031:{"技能名称":"百胜金甲","技能图标":"s4031","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":80},
	4032:{"技能名称":"放下屠刀","技能图标":"s4032","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":30},
	4033:{"技能名称":"剑覆秋霜","技能图标":"s4033","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":100},
	4034:{"技能名称":"落木萧萧","技能图标":"s4034","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":35},
	4035:{"技能名称":"铁衣难着","技能图标":"s4035","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":80},
	4036:{"技能名称":"沾衣欲湿","技能图标":"s4036","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":30},
	4037:{"技能名称":"四座无言","技能图标":"s4037","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":100},
	4038:{"技能名称":"天寒日暮","技能图标":"s4038","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":35},
	4039:{"技能名称":"满堂花醉","技能图标":"s4039","出现等级":0,"类型":2,"出现部位":9,"评分":30,"消耗愤怒":80},
}
#导表结束

def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'没有编号为{}的特技特效'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)

def getSpecialEffects(iLevel=0, iPos=9):
	'''获取所有符合条件的特效
	'''
	lSes = []
	for k, v in gdData.iteritems():
		if v["类型"] != 1:
			continue
		if v["出现等级"] > iLevel:
			continue
		if v["出现部位"] not in (iPos, 9):
			continue
		lSes.append(k)
	return lSes

def getSpecialSkills(iLevel=0, iPos=9):
	'''获取所有符合条件的特技
	'''
	lSks = []
	for k, v in gdData.iteritems():
		if v["类型"] != 2:
			continue
		if v["出现等级"] > iLevel:
			continue
		if v["出现部位"] not in (iPos, 9):
			continue
		lSks.append(k)
	return lSks
