# -*- coding: utf-8 -*-
from task.defines import *
# from task.object import TeamTask as customTask
from task.instance import InstanceTask as customTask

#导表开始
class Task(customTask):
	parentId = 30501
	targetType = TASK_TARGET_TYPE_NPC
	icon = 1
	title = '''副本·回春真人'''
	intro = '''与$target战斗'''
	detail = '''击败$target，寻找玉娘子踪迹'''
	rewardDesc = ''''''
	goAheadScript = ''''''
	initScript = '''N1001,E(1001,1001),STORY30501'''

	npcInfo = {
		1001:{"名称":"回春真人","造型":"4006(0,1,0,0,0,0)","染色":"0,0,0,0,0","位置":"1060,68,14,4"},
		1002:{"名称":"火云童子","造型":"1411(1,1,1,1,1)","染色":"3,0,3,0,0","位置":"1060,28,15,4"},
		1003:{"名称":"圣姑幻影","造型":"4508(0,1,0,0,0,0)","染色":"0,0,0,0,0","位置":"1060,54,33,6"},
		1004:{"名称":"玉娘子崔盈","造型":"4008(0,1,0,0,0,0)","染色":"0,0,0,0,0","位置":"1060,51,44,4"},
	}

	eventInfo = {
		1001:{"点击":"SB1001","回复":"1:F1001;2:TD1005","成功":"TR1001,DONE,T30502","失败":"TD1009"},
		1002:{"点击":"SB1002","回复":"1:F1002;2:TD1006","成功":"TR1002,DONE,T30503","失败":"TD1010"},
		1003:{"点击":"SB1003","回复":"1:F1003;2:TD1007","成功":"TR1003,DONE,T30504","失败":"TD1011"},
		1004:{"点击":"SB1004","回复":"1:F1004;2:TD1008","成功":"STORY(30505,1005)","失败":"TD1012"},
		1005:{"成功":"TR1004,DONE"},
	}

	rewardInfo = {
		1001:{"经验":lambda LV:LV*480+6000,"宠物经验":lambda PLV:PLV*336+4200,"银币":lambda LV:LV*130+3000,"物品":[1001]},
		1002:{"经验":lambda LV:LV*528+6600,"宠物经验":lambda PLV:PLV*369+4620,"银币":lambda LV:LV*143+3300,"物品":[1002]},
		1003:{"经验":lambda LV:LV*672+8400,"宠物经验":lambda PLV:PLV*470+5880,"银币":lambda LV:LV*182+4200,"物品":[1003]},
		1004:{"经验":lambda LV:LV*720+9000,"宠物经验":lambda PLV:PLV*504+6300,"银币":lambda LV:LV*195+4500,"物品":[1004]},
	}

	rewardPropsInfo = {
		1001:(
			{"权重":50,"物品":"202001","数量":"1","绑定":0},
			{"权重":50,"物品":"202002","数量":"1","绑定":0},
			{"权重":50,"物品":"202003","数量":"1","绑定":0},
			{"权重":50,"物品":"202004","数量":"1","绑定":0},
			{"权重":50,"物品":"202005","数量":"1","绑定":0},
			{"权重":55,"物品":"230101","数量":"5","绑定":0},
			{"权重":80,"物品":"230102","数量":"2","绑定":0},
			{"权重":55,"物品":"230103","数量":"1","绑定":0},
			{"权重":76,"物品":"246001","数量":"1","绑定":0},
			{"权重":76,"物品":"246002","数量":"1","绑定":0},
			{"权重":76,"物品":"246003","数量":"1","绑定":0},
			{"权重":76,"物品":"246004","数量":"1","绑定":0},
			{"权重":76,"物品":"246005","数量":"1","绑定":0},
			{"权重":76,"物品":"246006","数量":"1","绑定":0},
			{"权重":76,"物品":"246007","数量":"1","绑定":0},
			{"权重":76,"物品":"246008","数量":"1","绑定":0},
			{"权重":76,"物品":"246009","数量":"1","绑定":0},
			{"权重":76,"物品":"246010","数量":"1","绑定":0},
			{"权重":800,"物品":"0","数量":"0","绑定":0},
		),
		1002:(
			{"权重":40,"物品":"202001","数量":"1","绑定":0},
			{"权重":40,"物品":"202002","数量":"1","绑定":0},
			{"权重":40,"物品":"202003","数量":"1","绑定":0},
			{"权重":40,"物品":"202004","数量":"1","绑定":0},
			{"权重":40,"物品":"202005","数量":"1","绑定":0},
			{"权重":90,"物品":"230101","数量":"5","绑定":0},
			{"权重":100,"物品":"230102","数量":"2","绑定":0},
			{"权重":90,"物品":"230103","数量":"1","绑定":0},
			{"权重":110,"物品":"224103","数量":"5","绑定":0},
			{"权重":110,"物品":"224104","数量":"5","绑定":0},
			{"权重":110,"物品":"224105","数量":"5","绑定":0},
			{"权重":110,"物品":"224106","数量":"5","绑定":0},
			{"权重":110,"物品":"224107","数量":"5","绑定":0},
			{"权重":370,"物品":"234901","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":600,"物品":"0","数量":"0","绑定":0},
		),
		1003:(
			{"权重":35,"物品":"202001","数量":"1","绑定":0},
			{"权重":35,"物品":"202002","数量":"1","绑定":0},
			{"权重":35,"物品":"202003","数量":"1","绑定":0},
			{"权重":35,"物品":"202004","数量":"1","绑定":0},
			{"权重":35,"物品":"202005","数量":"1","绑定":0},
			{"权重":80,"物品":"230101","数量":"5","绑定":0},
			{"权重":80,"物品":"230102","数量":"2","绑定":0},
			{"权重":80,"物品":"230103","数量":"1","绑定":0},
			{"权重":180,"物品":"234903","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":150,"物品":"230001","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":200,"物品":"224108","数量":"1","绑定":0},
			{"权重":300,"物品":"245001","数量":"5","绑定":0},
			{"权重":355,"物品":"245001","数量":"3","绑定":0},
			{"权重":400,"物品":"0","数量":"0","绑定":0},
		),
		1004:(
			{"权重":30,"物品":"202001","数量":"1","绑定":0},
			{"权重":30,"物品":"202002","数量":"1","绑定":0},
			{"权重":30,"物品":"202003","数量":"1","绑定":0},
			{"权重":30,"物品":"202004","数量":"1","绑定":0},
			{"权重":30,"物品":"202005","数量":"1","绑定":0},
			{"权重":60,"物品":"230101","数量":"1","绑定":0},
			{"权重":60,"物品":"230102","数量":"1","绑定":0},
			{"权重":60,"物品":"230103","数量":"1","绑定":0},
			{"权重":95,"物品":"234902","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":230,"物品":"234904","数量":"1","绑定":0,"传闻":"SM6001"},
			{"权重":286,"物品":"247003","数量":"1","绑定":0},
			{"权重":286,"物品":"247004","数量":"1","绑定":0},
			{"权重":286,"物品":"241306","数量":"1","绑定":0},
			{"权重":287,"物品":"241307","数量":"1","绑定":0},
			{"权重":200,"物品":"0","数量":"0","绑定":0},
		),
	}

	groupInfo = {
	}

	chatInfo = {
		1001:'''心魔无形，看你能否抵挡！\nQ硬闯\nQ离开''',
		1002:'''哇，有活人来了！\nQ教训他们\nQ认怂''',
		1003:'''先败我，方有挑战那孽徒之能。\nQ挑战\nQ放弃''',
		1004:'''嗯——我美吗？\nQ除魔\nQ放弃''',
		1005:'''贪生怕死之辈，滚吧！''',
		1006:'''嘻嘻，我很饿了哦。''',
		1007:'''只是那孽徒——受害之人又多了。''',
		1008:'''是臣服于我的美貌了吗？''',
		1009:'''心志不坚，别来送死了。''',
		1010:'''啊……想跑？我，我饿了……''',
		1011:'''下次再来，也无不可。''',
		1012:'''你们就要这样离去了？''',
		2001:'''哼，倒要看看有什么本事！''',
		2002:'''我来提供物理减伤''',
		2003:'''我死了，减伤效果消失''',
		2004:'''我来提供法术减伤''',
		2005:'''我死了，减伤效果消失''',
		2006:'''我被圣姑封印，不能行动''',
		2007:'''我自由啦！''',
		2008:'''与其挑战我，不如为我沉沦''',
		6001:'''#C01$roleName#n成功通过#L1<14,22>*[幻波池]*02#n试练，获得$lnkProps''',
	}

	branchInfo = {
	}

	fightInfo = {
		1001:(
			{"类型":1,"名称":"回春真人","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1001","数量":"1","技能":(6201,5501,),"站位":(1,)},
			{"类型":0,"名称":"金刀真人","造型":"4003(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1002","数量":"2","技能":(5411,),"站位":(2,3,)},
			{"类型":0,"名称":"千手真人","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1003","数量":"2","技能":(5402,5407,),"站位":(4,5,)},
		),
		1002:(
			{"类型":1,"名称":"冰玉童子","造型":"1411(1,1,1,1,1)","染色":"2,0,2,0,0","能力编号":"1004","数量":"1","技能":(5406,5401,5501,6401,),"站位":(2,)},
			{"类型":1,"名称":"火云童子","造型":"1411(1,1,1,1,1)","染色":"3,0,3,0,0","能力编号":"1005","数量":"1","技能":(5412,5417,5501,6402,),"站位":(3,)},
			{"类型":0,"名称":"金刀真人","造型":"4003(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1002","数量":"2","技能":(5411,),"站位":(7,9,)},
			{"类型":0,"名称":"千手真人","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1003","数量":"2","技能":(5402,5407,),"站位":(8,10,)},
			{"类型":0,"名称":"回春真人","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1001","数量":"1","技能":(6201,),"站位":(6,)},
		),
		1003:(
			{"类型":1,"名称":"圣姑幻影","造型":"4508(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1006","数量":"1","技能":(5501,6203,6202,),"站位":(1,)},
			{"类型":0,"名称":"魅魂","造型":"3006(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1007","数量":"2","技能":(6403,6404,5502,),"站位":(7,8,)},
			{"类型":0,"名称":"金刀真人","造型":"4003(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1010","数量":"2","技能":(5411,),"站位":(2,3,)},
			{"类型":0,"名称":"千手真人","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1011","数量":"2","技能":(5402,5407,),"站位":(4,5,)},
		),
		1004:(
			{"类型":1,"名称":"崔盈","造型":"4008(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1008","数量":"1","技能":(5501,6206,6405,6205,5502,),"站位":(1,)},
			{"类型":0,"名称":"魅魂","造型":"3006(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1007","数量":"2","技能":(6403,6404,5502,),"站位":(2,3,)},
			{"类型":0,"名称":"冰玉童子","造型":"1411(1,1,1,1,1)","染色":"2,0,2,0,0","能力编号":"1004","数量":"1","技能":(5406,5401,5501,6401,),"站位":(7,)},
			{"类型":0,"名称":"火云童子","造型":"1411(1,1,1,1,1)","染色":"3,0,3,0,0","能力编号":"1005","数量":"1","技能":(5412,5417,5501,6402,),"站位":(8,)},
			{"类型":0,"名称":"金刀真人","造型":"4003(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1002","数量":"2","技能":(5411,),"站位":(4,9,)},
			{"类型":0,"名称":"千手真人","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1003","数量":"2","技能":(5402,5407,),"站位":(5,10,)},
			{"类型":0,"名称":"回春真人","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1001","数量":"1","技能":(6201,),"站位":(6,)},
		),
		2001:(
			{"类型":0,"名称":"回春真人","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1009","数量":"1","技能":(6201,)},
			{"类型":0,"名称":"金刀真人","造型":"4003(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1010","数量":"1","技能":(5411,)},
			{"类型":0,"名称":"千手真人","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1011","数量":"1","技能":(5402,5407,)},
		),
		2002:(
			{"类型":0,"名称":"回春真人","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1012","数量":"1","技能":(6201,)},
			{"类型":0,"名称":"金刀真人","造型":"4003(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1013","数量":"1","技能":(5411,)},
			{"类型":0,"名称":"千手真人","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1014","数量":"1","技能":(5402,5407,)},
		),
	}

	ableInfo = {
		1001:{"等级":"BALV","生命":"B*1.9","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.6","物理防御":"B*0.7","法术防御":"B*0.9","速度":"B*1.2","治疗":"B*1.1","封印":"B*0","抗封":"B*0.77","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1002:{"等级":"BALV","生命":"B*1.6","真气":"B*1","物理伤害":"B*0.8","法术伤害":"B*0.6","物理防御":"B*0.8","法术防御":"B*0.7","速度":"B*0.8","治疗":"B*0.68","封印":"B*0","抗封":"B*0.77","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1003:{"等级":"BALV","生命":"B*1.6","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.8","物理防御":"B*0.7","法术防御":"B*0.9","速度":"B*1","治疗":"B*0.65","封印":"B*0","抗封":"B*0.81","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1004:{"等级":"BALV","生命":"B*1.8","真气":"B*1","物理伤害":"B*0.8","法术伤害":"B*0.6","物理防御":"B*0.7","法术防御":"B*0.7","速度":"B*0.8","治疗":"B*0.67","封印":"B*0","抗封":"B*0.77","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1005:{"等级":"BALV","生命":"B*1.8","真气":"B*1","物理伤害":"B*0.5","法术伤害":"B*0.8","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*1","治疗":"B*0.92","封印":"B*0","抗封":"B*0.82","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1006:{"等级":"BALV","生命":"B*1.6","真气":"B*1","物理伤害":"B*0.5","法术伤害":"B*1","物理防御":"B*0.7","法术防御":"B*0.8","速度":"B*1.4","治疗":"B*0.96","封印":"B*0","抗封":"B*0.79","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1007:{"等级":"BALV","生命":"B*2.6","真气":"B*1","物理伤害":"B*0.8","法术伤害":"B*0.8","物理防御":"B*0.7","法术防御":"B*0.7","速度":"B*1","治疗":"B*0.65","封印":"B*0","抗封":"B*0.79","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1008:{"等级":"BALV","生命":"B*2.6","真气":"B*1","物理伤害":"B*0.7","法术伤害":"B*0.9","物理防御":"B*0.7","法术防御":"B*0.7","速度":"B*1.7","治疗":"B*0.63","封印":"B*0","抗封":"B*0.83","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1009:{"等级":"BALV","生命":"B*0.2","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.6","物理防御":"B*0.7","法术防御":"B*0.8","速度":"B*1.2","治疗":"B*1.1","封印":"B*0","抗封":"B*0.77","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1010:{"等级":"BALV","生命":"B*0.1","真气":"B*1","物理伤害":"B*0.8","法术伤害":"B*0.6","物理防御":"B*0.8","法术防御":"B*0.7","速度":"B*0.8","治疗":"B*0.68","封印":"B*0","抗封":"B*0.77","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1011:{"等级":"BALV","生命":"B*0.1","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.8","物理防御":"B*0.7","法术防御":"B*0.8","速度":"B*1","治疗":"B*0.65","封印":"B*0","抗封":"B*0.81","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1012:{"等级":"BALV","生命":"B*0.3","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.6","物理防御":"B*0.7","法术防御":"B*0.8","速度":"B*1.2","治疗":"B*1.1","封印":"B*0","抗封":"B*0.77","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1013:{"等级":"BALV","生命":"B*0.2","真气":"B*1","物理伤害":"B*0.8","法术伤害":"B*0.6","物理防御":"B*0.8","法术防御":"B*0.7","速度":"B*0.8","治疗":"B*0.68","封印":"B*0","抗封":"B*0.77","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1014:{"等级":"BALV","生命":"B*0.2","真气":"B*1","物理伤害":"B*0.6","法术伤害":"B*0.8","物理防御":"B*0.7","法术防御":"B*0.8","速度":"B*1","治疗":"B*0.65","封印":"B*0","抗封":"B*0.81","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
	}

	lineupInfo = {
	}

	configInfo = {
		"生成路径":"magicWave",
	}

	summonMonsterInfo = {
		1001:{"名称":"治疗","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1001","技能":(1211,)},
		1002:{"名称":"物理","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1002","技能":(5411,)},
		1003:{"名称":"魔法","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1003","技能":(5402,5407,)},
		1004:{"名称":"治疗","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1004","技能":(1211,)},
		1005:{"名称":"物理","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1005","技能":(5411,)},
		1006:{"名称":"魔法","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0","能力编号":"1006","技能":(5402,5407,)},
	}
#导表结束

	def initInstanceTask(self):#override
		'''设置副本任务类型
		'''
		self.instanceTaskType = activity.instance.MAGIC_WAVE_INSTANCE
		self.lastTaskId = 30504

	def onStartWar(self, w):
		'''登场闲话
		'''
		if self.id == 30501:
			if w.isMonster():
				if w.name == "回春真人":
					w.war.say(w, self.getText(2001), WORDS_STAR)

	def storySpecialDuel(self, who):#override
		customTask.storySpecialDuel(self, who)
		if self.id == 30504:
			if getattr(self, "instanceStoryId", 0) == 30505:
				#最后一个任务播完剧情30505再删除任务传出副本场景
				teamObj = who.inTeam()
				if teamObj and teamObj.isLeader(who.id):
					self.doScript(who, None, "DONE")

	def setupWar(self, warObj, who, npcObj):
		import war.warctrl
		# 生成会被召唤的怪物
		self.monsterList = {}
		for fightIdx in (2001, 2002):
			self.monsterList[fightIdx] = []
			fightList = self.getFightInfo(fightIdx)
			ableData = self.getAbleInfo()
			lineupData = self.getLineupInfo()
			monsterList = war.warctrl.createMonsterList(who, fightIdx, fightList, ableData, lineupData, self, npcObj)
			for lst in monsterList.itervalues():
				for monsterObj in lst:
					self.monsterList[fightIdx].append(monsterObj)

	def getMonsterListByFightIdx(self, fightIdx):
		'''获取被召唤的怪物列表
		'''
		if hasattr(self, "monsterList"):
			return self.monsterList.get(fightIdx)
		return None
	
	
from common import *
import war.commands
import activity.instance
import scene
from words.defines import *
