编号	等级_S	生命_S	真气_S	物理伤害_S	法术伤害_S	物理防御_S	法术防御_S	速度_S	物理抗性	法术抗性	攻击修炼	物防修炼	法防修炼	物理暴击	物理抗暴	法术暴击	法术抗暴	愤怒初始值	符能初始值	治疗强度
1001	BALV	B*1.5	B*1	B*0.1	B*0.1	B*0.5	B*0.5	B*1	0	0	0	0	0							
1002	BALV	B*1.5	B*1	B*0.5	B*0.5	B*0.6	B*0.6	B*0.5	0	0	0	0	0							
1003	BALV	B*2	B*1	B*0.4	B*0.4	B*0.5	B*0.5	B*0.5	0	0	0	0	0							
1004	BALV	B*3.5	B*1	B*0.8	B*0.8	B*0.7	B*0.7	B*0.5	0	0	0	0	0							
1005	BALV	B*2.5	B*1	B*0.6	B*0.6	B*0.6	B*0.6	B*1	0	0	0	0	0							
1006	BALV	B*2.5	B*1	B*1	B*1	B*0.7	B*0.7	B*0.1	0	0	0	0	0							B*1
1007	BALV	B*4	B*1	B*1.2	B*1.2	B*0.7	B*0.7	B*1.2	0	0	0	0	0							