# -*- coding: utf-8 -*-
from task.defines import *
from task.object import Task as customTask

MAX_RING = 10 # 每轮最大环数

#导表开始
class Task(customTask):
	parentId = 30001
	targetType = TASK_TARGET_TYPE_NPC
	icon = 0
	title = '''师门-传话'''
	intro = '''传话给$target'''
	detail = '''替师父向$target传话，切莫耽误'''
	rewardDesc = ''''''
	goAheadScript = ''''''
	initScript = '''E(9001,1001)'''

	npcInfo = {
		1001:{"名称":"旁门散人","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,10,10,0","称谓":"百晓副本"},
		1002:{"名称":"任春","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"白首仙童"},
		1003:{"名称":"牛宪","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"豹头神"},
		1004:{"名称":"乌蒙","造型":"4003(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"黑手真人"},
		2001:{"名称":"乌萨齐","造型":"4001(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0","称谓":"血童"},
		2002:{"名称":"叶景枫","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"绿袍子"},
		2003:{"名称":"陆延博","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0"},
		2004:{"名称":"郑隐","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0","称谓":"血神子"},
		2005:{"名称":"公孙无我","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1060,0,0,0","称谓":"山中人"},
		2006:{"名称":"唐绝","造型":"4504(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0"},
		2007:{"名称":"卑蓝","造型":"4007(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0"},
		2008:{"名称":"唐影","造型":"4504(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1060,0,0,0","称谓":"无影手"},
		2009:{"名称":"巫燕风","造型":"4506(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0"},
		2010:{"名称":"唐烟","造型":"4006(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1060,0,0,0","称谓":"烟雾里"},
		2011:{"名称":"莫高声","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0"},
		2012:{"名称":"雁开","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"一剪梅"},
		2013:{"名称":"卢鸿富","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0"},
		2014:{"名称":"凯金","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0","称谓":"富贵剑"},
		2015:{"名称":"燕璞玉","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1060,0,0,0"},
		2016:{"名称":"石理老","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0"},
		2017:{"名称":"果老","造型":"5002(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"赤拳"},
		2018:{"名称":"亚克","造型":"4508(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"弯刀"},
		2019:{"名称":"蓝凤凰","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0","称谓":"五毒"},
		2020:{"名称":"拜月","造型":"4008(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1060,0,0,0","称谓":"黑主教"},
		2021:{"名称":"师文恭","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0"},
		2022:{"名称":"萧宝娘","造型":"4509(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"五铢神女"},
		2023:{"名称":"徐神君","造型":"4005(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0"},
		2024:{"名称":"司徒兴明","造型":"1511(1,1,1,1,1,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0"},
		2025:{"名称":"冼盈","造型":"4005(0,1,0,0,0,0,0)","染色":"0,0,0,0,0,0","位置":"1060,0,0,0","称谓":"鬼王"},
		2026:{"名称":"朱洪","造型":"4504(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0","称谓":"病维摩"},
		2027:{"名称":"明珠禅师","造型":"1611(0,1,1,1,1,0,0)","染色":"0,0,0,0,0,0","位置":"1060,0,0,0"},
		2028:{"名称":"鹿清","造型":"4502(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1130,0,0,0","称谓":"通臂神猿"},
		2029:{"名称":"萧勉","造型":"4004(0,1,0,0,0)","染色":"0,0,0,0,0,0","位置":"1040,0,0,0","称谓":"白骨禅师"},
		2030:{"名称":"一灯上人","造型":"1611(0,1,1,1,1,0,0)","染色":"0,0,0,0,0,0","位置":"1060,0,0,0"},
	}

	eventInfo = {
		1001:{"点击":"DONE,DEFF,R1001,D9002"},
		1002:{"点击":"F9005","成功":"DONE,DEFF,R1001,D1005"},
		1003:{"点击":"POPI","成功":"DONE,DEFF,R1003,D1006","失败":"D1007"},
		1004:{"点击":"POPI","成功":"DONE,DEFF,R1002,D1006","失败":"D1007"},
		1005:{"点击":"F9015","成功":"DONE,DEFF,R1001,D1008","失败":"D1009"},
		1012:{"点击":"DONE,DEFF,R1001,D1040"},
		1013:{"点击":"DONE,DEFF,R1001,D1011"},
		1014:{"点击":"DONE,DEFF,R1001,D1012"},
		1015:{"点击":"DONE,DEFF,R1001,D1013"},
		1016:{"点击":"DONE,DEFF,R1001,D1014"},
		1017:{"点击":"DONE,DEFF,R1001,D1015"},
		2001:{"点击":"F1101","成功":"DONE,DEFF,R1001,D9100","失败":"D2999"},
		2002:{"点击":"F1101","成功":"DONE,DEFF,R1001,D9101","失败":"D2999"},
		2003:{"点击":"F1101","成功":"DONE,DEFF,R1001,D9102","失败":"D2999"},
		2004:{"点击":"F1101","成功":"DONE,DEFF,R1001,D9103","失败":"D2999"},
		2005:{"点击":"F1101","成功":"DONE,DEFF,R1001,D9104","失败":"D2999"},
		2006:{"点击":"F1102","成功":"DONE,DEFF,R1001,D9105","失败":"D2999"},
		2007:{"点击":"F1102","成功":"DONE,DEFF,R1001,D9106","失败":"D2999"},
		2008:{"点击":"F1102","成功":"DONE,DEFF,R1001,D9107","失败":"D2999"},
		2009:{"点击":"F1102","成功":"DONE,DEFF,R1001,D9108","失败":"D2999"},
		2010:{"点击":"F1102","成功":"DONE,DEFF,R1001,D9109","失败":"D2999"},
		2011:{"点击":"F1103","成功":"DONE,DEFF,R1001,D9110","失败":"D2999"},
		2012:{"点击":"F1103","成功":"DONE,DEFF,R1001,D9111","失败":"D2999"},
		2013:{"点击":"F1103","成功":"DONE,DEFF,R1001,D9112","失败":"D2999"},
		2014:{"点击":"F1103","成功":"DONE,DEFF,R1001,D9113","失败":"D2999"},
		2015:{"点击":"F1103","成功":"DONE,DEFF,R1001,D9114","失败":"D2999"},
		2016:{"点击":"F1104","成功":"DONE,DEFF,R1001,D9115","失败":"D2999"},
		2017:{"点击":"F1104","成功":"DONE,DEFF,R1001,D9116","失败":"D2999"},
		2018:{"点击":"F1104","成功":"DONE,DEFF,R1001,D9117","失败":"D2999"},
		2019:{"点击":"F1104","成功":"DONE,DEFF,R1001,D9118","失败":"D2999"},
		2020:{"点击":"F1104","成功":"DONE,DEFF,R1001,D9119","失败":"D2999"},
		2021:{"点击":"F1105","成功":"DONE,DEFF,R1001,D9120","失败":"D2999"},
		2022:{"点击":"F1105","成功":"DONE,DEFF,R1001,D9121","失败":"D2999"},
		2023:{"点击":"F1105","成功":"DONE,DEFF,R1001,D9122","失败":"D2999"},
		2024:{"点击":"F1105","成功":"DONE,DEFF,R1001,D9123","失败":"D2999"},
		2025:{"点击":"F1105","成功":"DONE,DEFF,R1001,D9124","失败":"D2999"},
		2026:{"点击":"F1106","成功":"DONE,DEFF,R1001,D9125","失败":"D2999"},
		2027:{"点击":"F1106","成功":"DONE,DEFF,R1001,D9126","失败":"D2999"},
		2028:{"点击":"F1106","成功":"DONE,DEFF,R1001,D9127","失败":"D2999"},
		2029:{"点击":"F1106","成功":"DONE,DEFF,R1001,D9128","失败":"D2999"},
		2030:{"点击":"F1106","成功":"DONE,DEFF,R1001,D9129","失败":"D2999"},
		3001:{"点击":"DONE,DEFF,R3001,LOOK"},
	}

	rewardInfo = {
		1001:{"经验":lambda LV,R:(LV*32+40)*R+LV*400+1000,"宠物经验":lambda PLV,R:(PLV*32+40)*R+PLV*400+1000,"银币":lambda LV,R:LV*R*4+LV*36+200,"门派贡献":1},
		1002:{"经验":lambda LV:LV*720+1400,"宠物经验":lambda PLV:PLV*720+1400,"银币":lambda LV:LV*76+200,"物品":[1001],"门派贡献":1},
		1003:{"经验":lambda LV,QU:LV*720+1400+QU*500,"宠物经验":lambda PLV,QU:PLV*720+1400+QU*500,"银币":lambda LV:LV*76+200,"物品":[1001],"门派贡献":1},
		3001:{"经验":lambda :1000,"宠物经验":lambda :1000,"银币":lambda :1000},
	}

	rewardPropsInfo = {
		1001:(
			{"权重":10,"物品":"230011","数量":"1"},
		),
	}

	groupInfo = {
		9001:(20201,20202,20203,20204,20205,20206,20208,20301,20302,20303,20304,20601,20602,20603,20701,20702,20801,20802,20803,20901,20902,20903,),
		9002:(1001,1002,1003,1004,),
		9003:(203011,203012,203013,),
		9004:(1130,1040,),
		9005:(1001,1002,1003,),
		9006:(220002,220003,),
		9007:(221101,221102,),
		9008:(221101,221102,221103,221104,),
		9009:(221101,221102,221103,221104,),
		9010:(221101,221102,221103,221104,),
		9011:(100004,100054,100104,100154,100204,100254,100304,100354,100404,100454,100504,100554,101004,101104,101204,101304,101404,101504,101604,),
		9012:(10101,10102,10103,10104,10105,10106,),
		9013:(1040,1011,1012,1013,1014,1015,),
		9014:(1002,1003,1004,),
		9015:(1004,1005,),
		9100:(2001,2002,2003,),
		9101:(2011,2012,2013,),
		9102:(2021,2022,2023,),
		9103:(2031,2032,2033,),
		9104:(2041,2042,2043,),
		9105:(2051,2052,2053,),
		9106:(2061,2062,2063,),
		9107:(2071,2072,2073,),
		9108:(2081,2082,2083,),
		9109:(2091,2092,2093,),
		9110:(2101,2102,2103,),
		9111:(2111,2112,2113,),
		9112:(2121,2122,2123,),
		9113:(2131,2132,2133,),
		9114:(2141,2142,2143,),
		9115:(2151,2152,2153,),
		9116:(2161,2162,2163,),
		9117:(2171,2172,2173,),
		9118:(2181,2182,2183,),
		9119:(2191,2192,2193,),
		9120:(2201,2202,2203,),
		9121:(2211,2212,2213,),
		9122:(2221,2222,2223,),
		9123:(2231,2232,2233,),
		9124:(2241,2242,2243,),
		9125:(2251,2252,2253,),
		9126:(2261,2262,2263,),
		9127:(2271,2272,2273,),
		9128:(2281,2282,2283,),
		9129:(2291,2292,2293,),
	}

	chatInfo = {
		1001:'''*2*嗯，此事我已经明了，请先回去吧。''',
		1002:'''*2*原来如此。''',
		1003:'''*2*唔唔（陷入沉思中）……''',
		1004:'''*2*哼，竟然这样。''',
		1005:'''*2*东西已经拿到了，回去吧。''',
		1006:'''*2*很好很好，为师急需这个。''',
		1007:'''少侠没有带来所需物品''',
		1008:'''*2*哇，不要打了，我这就返回山去……''',
		1009:'''滚开，也不称称自己有多少伎俩。''',
		1040:'''*4*蜀山派，乃第一名门正宗，剑法博大精深，也不怕任何人去了解。\n蜀山剑法为物理攻击，以一敌多。	蜀山符法虽是单攻，但有不同效果的符法辅助。\n而蜀山剑诀更是千变万化，能攻能守。''',
		1011:'''*4*我西蜀唐门……此事不得外传。\n唐门风字式，乃以各种火器作法术攻击为主，并有一定辅助效果。	花字式，则是用淬毒的暗器攻击对方并造成各种负面状态。\n雪字式，以唐门心法使用各种辅助技巧。''',
		1012:'''*4*呵呵，我们武林盟集各家所长，武术精湛。\n天刀式，能单能群，可攻可封。	连环刀，每一招式都对敌手发起复数攻击。\n秘刀，审时度势，劈出最致命的一刀！''',
		1013:'''*4*苗疆……不能多说，不能外说，否则你知道，嘿。\n我们擅长驱虫术，可单可群。	禁咒术，封锁对方行动，控制敌方思想。\n巫蛊，能为战斗作各种有利的准备。''',
		1014:'''*4*赫赫，魔宫没什么值得隐藏的，告诉你又如何。\n魔宫火魔法，虽只对单人，但威力甚大。	幽冥术，能增强我们实力甚至召唤天魔帮忙。\n水魔法，针对群体敌人，无往而不利。''',
		1015:'''*4*阿弥陀佛，佛门慈悲为怀，我们的吟唱功能打单、打群，但我们还是抱着慈悲为怀。	普渡心咒，能救死扶伤，普度众生。\n金刚神功，能清净六道，守护三界。''',
		2001:'''*2*我跟着恩师郑隐修炼数十年，虽说也被授予蜀山剑法，但怎么也算不上是你们叛徒吧！''',
		2002:'''*2*咳咳咳……可恶的蜀山，暂且放你一马！''',
		2003:'''*2*啧哈哈哈，就算击败了我，你们就救不回那个被我炼成血影的村庄了！''',
		2011:'''*2*我本一心修道，无奈昔日师尊待我如此……罢了，走了。''',
		2012:'''*2*你的剑法不错，只是还待成长，下次见吧。''',
		2013:'''*2*正道旁门，邪教九流，天下万物，始皆为一。''',
		2021:'''*2*哇，不要打了，我这就返回山去……''',
		2022:'''*2*哇，不要打了，我这就返回山去……''',
		2023:'''*2*哇，不要打了，我这就返回山去……''',
		2031:'''*2*哇，不要打了，我这就返回山去……''',
		2032:'''*2*哇，不要打了，我这就返回山去……''',
		2033:'''*2*哇，不要打了，我这就返回山去……''',
		2041:'''*2*我为蜀山做了那么多事情，哼哼，我很懂的灭尘子的心态呢。''',
		2042:'''*2*就凭你想拿下我？我有事情，别了，哼哼。''',
		2043:'''*2*呼……实力涨了不少嘛，只可惜还不足以逮住我。''',
		2051:'''*2*哇，不要打了，我这就返回山去……''',
		2052:'''*2*哇，不要打了，我这就返回山去……''',
		2053:'''*2*哇，不要打了，我这就返回山去……''',
		2061:'''*2*哇，不要打了，我这就返回山去……''',
		2062:'''*2*哇，不要打了，我这就返回山去……''',
		2063:'''*2*哇，不要打了，我这就返回山去……''',
		2071:'''*2*哇，不要打了，我这就返回山去……''',
		2072:'''*2*哇，不要打了，我这就返回山去……''',
		2073:'''*2*哇，不要打了，我这就返回山去……''',
		2081:'''*2*哇，不要打了，我这就返回山去……''',
		2082:'''*2*哇，不要打了，我这就返回山去……''',
		2083:'''*2*哇，不要打了，我这就返回山去……''',
		2091:'''*2*哇，不要打了，我这就返回山去……''',
		2092:'''*2*哇，不要打了，我这就返回山去……''',
		2093:'''*2*哇，不要打了，我这就返回山去……''',
		2101:'''*2*哇，不要打了，我这就返回山去……''',
		2102:'''*2*哇，不要打了，我这就返回山去……''',
		2103:'''*2*哇，不要打了，我这就返回山去……''',
		2111:'''*2*哇，不要打了，我这就返回山去……''',
		2112:'''*2*哇，不要打了，我这就返回山去……''',
		2113:'''*2*哇，不要打了，我这就返回山去……''',
		2121:'''*2*哇，不要打了，我这就返回山去……''',
		2122:'''*2*哇，不要打了，我这就返回山去……''',
		2123:'''*2*哇，不要打了，我这就返回山去……''',
		2131:'''*2*哇，不要打了，我这就返回山去……''',
		2132:'''*2*哇，不要打了，我这就返回山去……''',
		2133:'''*2*哇，不要打了，我这就返回山去……''',
		2141:'''*2*哇，不要打了，我这就返回山去……''',
		2142:'''*2*哇，不要打了，我这就返回山去……''',
		2143:'''*2*哇，不要打了，我这就返回山去……''',
		2151:'''*2*哇，不要打了，我这就返回山去……''',
		2152:'''*2*哇，不要打了，我这就返回山去……''',
		2153:'''*2*哇，不要打了，我这就返回山去……''',
		2161:'''*2*哇，不要打了，我这就返回山去……''',
		2162:'''*2*哇，不要打了，我这就返回山去……''',
		2163:'''*2*哇，不要打了，我这就返回山去……''',
		2171:'''*2*哇，不要打了，我这就返回山去……''',
		2172:'''*2*哇，不要打了，我这就返回山去……''',
		2173:'''*2*哇，不要打了，我这就返回山去……''',
		2181:'''*2*哇，不要打了，我这就返回山去……''',
		2182:'''*2*哇，不要打了，我这就返回山去……''',
		2183:'''*2*哇，不要打了，我这就返回山去……''',
		2191:'''*2*哇，不要打了，我这就返回山去……''',
		2192:'''*2*哇，不要打了，我这就返回山去……''',
		2193:'''*2*哇，不要打了，我这就返回山去……''',
		2201:'''*2*哇，不要打了，我这就返回山去……''',
		2202:'''*2*哇，不要打了，我这就返回山去……''',
		2203:'''*2*哇，不要打了，我这就返回山去……''',
		2211:'''*2*哇，不要打了，我这就返回山去……''',
		2212:'''*2*哇，不要打了，我这就返回山去……''',
		2213:'''*2*哇，不要打了，我这就返回山去……''',
		2221:'''*2*哇，不要打了，我这就返回山去……''',
		2222:'''*2*哇，不要打了，我这就返回山去……''',
		2223:'''*2*哇，不要打了，我这就返回山去……''',
		2231:'''*2*哇，不要打了，我这就返回山去……''',
		2232:'''*2*哇，不要打了，我这就返回山去……''',
		2233:'''*2*哇，不要打了，我这就返回山去……''',
		2241:'''*2*哇，不要打了，我这就返回山去……''',
		2242:'''*2*哇，不要打了，我这就返回山去……''',
		2243:'''*2*哇，不要打了，我这就返回山去……''',
		2251:'''*2*哇，不要打了，我这就返回山去……''',
		2252:'''*2*哇，不要打了，我这就返回山去……''',
		2253:'''*2*哇，不要打了，我这就返回山去……''',
		2261:'''*2*哇，不要打了，我这就返回山去……''',
		2262:'''*2*哇，不要打了，我这就返回山去……''',
		2263:'''*2*哇，不要打了，我这就返回山去……''',
		2271:'''*2*哇，不要打了，我这就返回山去……''',
		2272:'''*2*哇，不要打了，我这就返回山去……''',
		2273:'''*2*哇，不要打了，我这就返回山去……''',
		2281:'''*2*哇，不要打了，我这就返回山去……''',
		2282:'''*2*哇，不要打了，我这就返回山去……''',
		2283:'''*2*哇，不要打了，我这就返回山去……''',
		2291:'''*2*哇，不要打了，我这就返回山去……''',
		2292:'''*2*哇，不要打了，我这就返回山去……''',
		2293:'''*2*哇，不要打了，我这就返回山去……''',
		2999:'''哼，看在半个同门的份上，这次就饶你一命！''',
	}

	branchInfo = {
		1001:(
			{"条件":0,"脚本":"L(9007,1)"},
			{"条件":10,"脚本":"L(9008,1)"},
			{"条件":20,"脚本":"L(9009,1)"},
			{"条件":30,"脚本":"L(9010,1)"},
			{"条件":40,"脚本":"L(9011,1)"},
		),
		1002:(
			{"条件":0,"脚本":"L(9006,1)"},
		),
		1003:(
			{"条件":11,"脚本":"E(10101,1012)"},
			{"条件":12,"脚本":"E(10102,1013)"},
			{"条件":13,"脚本":"E(10103,1014)"},
			{"条件":14,"脚本":"E(10104,1015)"},
			{"条件":15,"脚本":"E(10105,1016)"},
			{"条件":16,"脚本":"E(10106,1017)"},
		),
		1004:(
			{"条件":11,"脚本":"NE(2001,2001)"},
			{"条件":12,"脚本":"NE(2006,2006)"},
			{"条件":13,"脚本":"NE(2011,2011)"},
			{"条件":14,"脚本":"NE(2016,2016)"},
			{"条件":15,"脚本":"NE(2021,2021)"},
			{"条件":16,"脚本":"NE(2026,2026)"},
		),
		1005:(
			{"条件":11,"脚本":"NE(2002,2002)"},
			{"条件":12,"脚本":"NE(2007,2007)"},
			{"条件":13,"脚本":"NE(2012,2012)"},
			{"条件":14,"脚本":"NE(2017,2017)"},
			{"条件":15,"脚本":"NE(2022,2022)"},
			{"条件":16,"脚本":"NE(2027,2027)"},
		),
		1006:(
			{"条件":11,"脚本":"NE(2003,2003)"},
			{"条件":12,"脚本":"NE(2008,2008)"},
			{"条件":13,"脚本":"NE(2013,2013)"},
			{"条件":14,"脚本":"NE(2018,2018)"},
			{"条件":15,"脚本":"NE(2023,2023)"},
			{"条件":16,"脚本":"NE(2028,2028)"},
		),
		1007:(
			{"条件":11,"脚本":"NE(2004,2004)"},
			{"条件":12,"脚本":"NE(2009,2009)"},
			{"条件":13,"脚本":"NE(2014,2014)"},
			{"条件":14,"脚本":"NE(2019,2019)"},
			{"条件":15,"脚本":"NE(2024,2024)"},
			{"条件":16,"脚本":"NE(2030,2030)"},
		),
		1008:(
			{"条件":11,"脚本":"NE(2005,2005)"},
			{"条件":12,"脚本":"NE(2010,2010)"},
			{"条件":13,"脚本":"NE(2015,2015)"},
			{"条件":14,"脚本":"NE(2020,2020)"},
			{"条件":15,"脚本":"NE(2025,2025)"},
			{"条件":16,"脚本":"NE(2030,2030)"},
		),
	}

	fightInfo = {
		1001:(
			{"类型":0,"名称":"强盗","造型":"4502(0,1,0,0,0)","能力编号":"1002","数量":"2","技能":(5401,5406,),"站位":(8,3,)},
			{"类型":0,"名称":"绑匪","造型":"4001(0,1,0,0,0)","能力编号":"1002","数量":"2","技能":(5402,5407,),"站位":(6,1,)},
			{"类型":0,"名称":"杀手","造型":"4502(0,1,0,0,0)","能力编号":"1001","数量":"2","技能":(5413,5418,),"站位":(7,2,)},
		),
		1002:(
			{"类型":0,"名称":"猛兽","造型":"3007(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(5403,5408,),"站位":(6,)},
			{"类型":0,"名称":"野兽","造型":"3008(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(5404,5409,),"站位":(1,)},
			{"类型":0,"名称":"恶兽","造型":"3004(0,1,0,0,0)","能力编号":"1001","数量":"2","技能":(5415,5420,),"站位":(7,8,)},
			{"类型":0,"名称":"邪兽","造型":"3005(0,1,0,0,0)","能力编号":"1001","数量":"2","技能":(5411,5416,),"站位":(3,2,)},
		),
		1003:(
			{"类型":0,"名称":"男散修","造型":"4502(0,1,0,0,0)","能力编号":"1003","数量":"1","技能":(1111,1113,1133,)},
			{"类型":0,"名称":"女散修","造型":"4506(0,1,0,0,0)","能力编号":"1004","数量":"1","技能":(1212,1222,1223,)},
		),
		1004:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1009","数量":"1","技能":(1112,1212,1312,1612,),"站位":(1,)},
			{"类型":0,"名称":"打手","造型":"4001(0,1,0,0,0)","能力编号":"1010","数量":"2","技能":(1111,1211,1311,1611,),"站位":(2,3,)},
			{"类型":0,"名称":"恶兽","造型":"3004(0,1,0,0,0)","能力编号":"1010","数量":"3","技能":(5401,5406,5411,5416,),"站位":(4,5,6,)},
		),
		1005:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1009","数量":"1","技能":(1112,1212,1312,1612,),"站位":(1,)},
			{"类型":0,"名称":"打手","造型":"4001(0,1,0,0,0)","能力编号":"1010","数量":"2","技能":(1111,1211,1311,1611,),"站位":(3,2,)},
			{"类型":0,"名称":"恶兽","造型":"3004(0,1,0,0,0)","能力编号":"1010","数量":"3","技能":(5402,5407,5412,5417,),"站位":(4,5,6,)},
		),
		1006:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1009","数量":"1","技能":(1112,1212,1312,1612,),"站位":(1,)},
			{"类型":0,"名称":"旁门散人","造型":"4001(0,1,0,0,0)","能力编号":"1010","数量":"3","技能":(1111,1211,1311,1611,)},
			{"类型":0,"名称":"妖物","造型":"3004(0,1,0,0,0)","能力编号":"1010","数量":"3","技能":(5403,5408,5413,5418,)},
		),
		1101:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1005","数量":"1","技能":(1111,1112,1113,1121,1122,1123,1131,),"站位":(1,)},
			{"类型":0,"名称":"御兽","造型":"3005(0,1,0,0,0)","能力编号":"1008","数量":"1","技能":(5406,),"站位":(6,)},
			{"类型":0,"名称":"蜀山叛徒","造型":"4502(0,1,0,0,0)","能力编号":"1007","数量":"2","技能":(1111,1112,1113,),"站位":(7,8,)},
			{"类型":0,"名称":"蜀山叛徒","造型":"4506(0,1,0,0,0)","能力编号":"1007","数量":"2","技能":(1121,1122,1123,),"站位":(9,10,)},
		),
		1102:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1006","数量":"1","技能":(1221,1222,1223,),"站位":(1,)},
			{"类型":0,"名称":"药兽","造型":"3006(0,1,0,0,0)","能力编号":"1007","数量":"1","技能":(5417,),"站位":(6,)},
			{"类型":0,"名称":"唐门叛徒","造型":"4504(0,1,0,0,0)","能力编号":"1008","数量":"2","技能":(1211,1212,1213,),"站位":(7,8,)},
			{"类型":0,"名称":"唐门叛徒","造型":"4508(0,1,0,0,0)","能力编号":"1008","数量":"2","技能":(1221,1222,1223,),"站位":(9,10,)},
		),
		1103:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1005","数量":"1","技能":(1321,1322,1323,),"站位":(1,)},
			{"类型":0,"名称":"训兽","造型":"3004(0,1,0,0,0)","能力编号":"1008","数量":"1","技能":(5407,),"站位":(6,)},
			{"类型":0,"名称":"武林盟叛徒","造型":"4504(0,1,0,0,0)","能力编号":"1007","数量":"2","技能":(1311,1312,1313,),"站位":(7,8,)},
			{"类型":0,"名称":"武林盟叛徒","造型":"4508(0,1,0,0,0)","能力编号":"1007","数量":"2","技能":(1331,1332,1333,),"站位":(9,10,)},
		),
		1104:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1006","数量":"1","技能":(1411,1412,1413,1421,1422,),"站位":(1,)},
			{"类型":0,"名称":"蛊兽","造型":"3005(0,1,0,0,0)","能力编号":"1007","数量":"1","技能":(5403,),"站位":(6,)},
			{"类型":0,"名称":"苗疆叛徒","造型":"4504(0,1,0,0,0)","能力编号":"1008","数量":"2","技能":(1411,1412,1432,),"站位":(7,8,)},
			{"类型":0,"名称":"苗疆叛徒","造型":"4509(0,1,0,0,0)","能力编号":"1008","数量":"2","技能":(1411,1412,1431,),"站位":(9,10,)},
		),
		1105:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1006","数量":"1","技能":(1511,1512,1513,1521,1522,1523,1531,),"站位":(1,)},
			{"类型":0,"名称":"魔兽","造型":"3005(0,1,0,0,0)","能力编号":"1007","数量":"1","技能":(5404,),"站位":(6,)},
			{"类型":0,"名称":"魔宫叛徒","造型":"4506(0,1,0,0,0)","能力编号":"1008","数量":"2","技能":(1511,1521,),"站位":(7,8,)},
			{"类型":0,"名称":"魔宫叛徒","造型":"4509(0,1,0,0,0)","能力编号":"1008","数量":"2","技能":(1511,1531,),"站位":(9,10,)},
		),
		1106:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1006","数量":"1","技能":(1611,1621,1622,1623,),"站位":(1,)},
			{"类型":0,"名称":"佛奴","造型":"3005(0,1,0,0,0)","能力编号":"1007","数量":"1","技能":(5418,),"站位":(6,)},
			{"类型":0,"名称":"佛门叛徒","造型":"1611(0,1,1,1,1,0)","能力编号":"1008","数量":"2","技能":(1611,1612,1613,),"站位":(7,8,)},
			{"类型":0,"名称":"佛门叛徒","造型":"1621(1,1,1,1,1,1)","能力编号":"1008","数量":"2","技能":(1611,1612,1613,),"站位":(9,10,)},
		),
	}

	ableInfo = {
		1001:{"等级":"LV","生命":"B*0.5","真气":"B*1","物理伤害":"B*0.49","法术伤害":"B*0.34","物理防御":"B*0.42","法术防御":"B*0.29","速度":"B*0.72","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1002:{"等级":"LV","生命":"B*0.5","真气":"B*1","物理伤害":"B*0.34","法术伤害":"B*0.49","物理防御":"B*0.29","法术防御":"B*0.42","速度":"B*0.72","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1003:{"等级":"LV","生命":"B*0.8","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.88","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1004:{"等级":"LV","生命":"B*0.8","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.88","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1005:{"等级":"LV","生命":"B*0.65","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1006:{"等级":"LV","生命":"B*0.65","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1007:{"等级":"LV","生命":"B*0.5","真气":"B*1","物理伤害":"B*0.49","法术伤害":"B*0.34","物理防御":"B*0.42","法术防御":"B*0.29","速度":"B*0.72","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1008:{"等级":"LV","生命":"B*0.5","真气":"B*1","物理伤害":"B*0.34","法术伤害":"B*0.49","物理防御":"B*0.29","法术防御":"B*0.42","速度":"B*0.72","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1009:{"等级":"LV","生命":"B*0.65","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1010:{"等级":"LV","生命":"B*0.5","真气":"B*1","物理伤害":"B*0.49","法术伤害":"B*0.49","物理防御":"B*0.36","法术防御":"B*0.36","速度":"B*0.72","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
	}

	lineupInfo = {
	}

	configInfo = {
		"生成路径":"school",
	}

	ringTask = {
		15:(
			{"编号":30001,"权重":200},
			{"编号":30002,"权重":20},
			{"编号":30005,"权重":20},
			{"编号":30006,"权重":200},
			{"编号":30007,"权重":20},
			{"编号":30008,"权重":20},
			{"编号":30009,"权重":20},
		),
		50:(
			{"编号":30001,"权重":200},
			{"编号":30002,"权重":50},
			{"编号":30005,"权重":50},
			{"编号":30006,"权重":200},
			{"编号":30007,"权重":18},
			{"编号":30008,"权重":18},
			{"编号":30009,"权重":18},
			{"编号":30010,"权重":23},
			{"编号":30011,"权重":23},
		),
	}

	lastRingTask = {
		15:(
			{"编号":30004,"权重":100},
		),
		50:(
			{"编号":30003,"权重":100},
		),
	}

	schoolPoint = {
		1:0,
		2:0,
		3:0,
		4:0,
		5:0,
		6:4,
		7:5,
		8:6,
		9:7,
		10:8,
	}
#导表结束

	def getTitle(self, who):
		title = self.transString(self.title, who.id)
		return "%s#C07(%d/%d)#n" % (title, self.getRing(who), MAX_RING)

	def getHyperlinkIntro(self, who):
		content = self.getIntro(who)
		if "$process" in content:
			propsNeeded = self.getPropsNeeded()
			needCnt = sum(propsNeeded.values())
			ownCnt = sum(who.propsCtn.getPropsAmountByNos(*propsNeeded.keys()))
			content = content.replace("$process", "{}/{}".format(ownCnt, needCnt))
		return content

	def getRing(self, who):
		return who.taskCtn.fetch("schoolRing") + 1

	def onMissionDone(self, who, npcObj):
		ring = who.taskCtn.add("schoolRing", 1)
		dayRing = who.day.add("schoolRing", 1)
		if who.day.fetch("schoolRing") <= 20:
			perPoint = activity.center.getPerActPoint(2)
			who.addActPoint(perPoint)

		if ring == 10:  # 第10环额外奖励
			who.taskCtn.delete("schoolRing")
		if dayRing >= 20:	#小于20轮自动接下一任务
			return
# 			if dayRing < 20:
# 				self.reward(who, 2002, npcObj)
# 			else:
# 				self.reward(who, 2003, npcObj)
#			return
			
		# 是否继续任务
		# if ring == 10 and dayRing >= 20:
		# 	if message.confirmBox(who, self.getText(1111, who.id)) != 2:
		# 		return
		
		# 自动给任务
		if ring == 9:
			taskObj = task.school.randSchoolTask(who, npcObj, True)
		else:
			taskObj = task.school.randSchoolTask(who, npcObj)
		if taskObj:	
			#taskObj.goAhead(who)
			taskObj.timerMgr.run(functor(taskObj.autoGoAhead, who.id), 1, 0, "school_%s%s"%(taskObj.id, who.id))

	def autoGoAhead(self, pid):
		return # 暂时不自动任务
		who = getRole(pid)
		if who:
			self.goAhead(who)

	def abort(self, who):
		customTask.abort(self, who)
		who.taskCtn.delete("schoolRing")
			
	def getBranchCondition(self, who, npcObj, branchIdx, flag):
		if flag == "lv":
			lst = [info["条件"] for info in self.getBranchInfo(branchIdx)]
			lst.sort(reverse=True)
			for lv in lst:
				if who.level >= lv:
					return lv
			
		return customTask.getBranchCondition(self, who, npcObj, branchIdx, flag)			

	def completeTakeProps(self, who, npcObj, propsList=None):
		'''上交物品成功
		'''
		#物品品质
		needQu = self.fetch("propsQu", 0)
		if needQu and propsList:
			propsQuality = getattr(propsList[0], "quality", 0)
			if propsQuality >= needQu:
				self.propsQuality = propsQuality

		customTask.completeTakeProps(self, who, npcObj, propsList)

	def setQuality(self, who, npcObj, args):
		'''设置品质
		'''
		if args:
			propsNeedQuality = int(args[0])
			self.set("propsQu", propsNeedQuality)

	# def checkTakeProps(self, who, npcObj, propsList):
	# 	'''检查上交的物品
	# 	'''
	# 	propsNeedQu = self.fetch("propsQu", 0)
	# 	if propsNeedQu:
	# 		for propsObj in propsList:
	# 			if getattr(propsObj, "quality", 0) < propsNeedQu:
	# 				return 0
	# 	return 1

	def getValueByVarName(self, varName, who):
		if varName == "R":
			if who:
				ring = who.taskCtn.fetch("schoolRing") % 10
				return 10 if ring == 0 else ring
			return 0
		return customTask.getValueByVarName(self, varName, who)

	def rewardByType(self, who, val, _type):
		if _type == "门派贡献":
			val = self.schoolPoint.get(self.getValueByVarName("R",who),0)
			if val:
				who.addSchoolPoint(val, "师门任务")
			return
		template.Template.rewardByType(self, who, val, _type)

	def onBorn(self, who, npcObj, **kwargs):
		customTask.onBorn(self, who, npcObj, **kwargs)
		dayRing = who.day.fetch("schoolRing")
		if dayRing > 0:
			who.taskCtn.set("schoolRing", dayRing%10)

from common import *
import re
import task
import task.school
import message
import activity.center
import template