编号	内容_S
1001	$SEX1做好准备了么？若是准备好了，马上就可挑战各位帝君。
	接受挑战
1002	我乃泰山帝君，掌管人间善恶，注生录死。
	挑战
1003	我乃衡山帝君，掌管鳞甲水族，沃土分野。
	挑战
1004	我乃华山帝君，掌管珍宝五金，陶铸坑冶。
	挑战
1005	我乃嵩山帝君，掌管地泽川谷，山林树木。
	挑战
1006	我乃恒山帝君，掌管江河湖海，虎豹走兽。
	挑战
2001	今日正是良辰吉日，#L1<14,27>*[五岳帝君]*02#n现于人世，想接受五位帝君挑战的仙友们可前往寻找帝君踪迹了！
2002	良辰吉日已过，五位帝君游玩尽兴，已返回各自洞府，各位仙友们若想再前往挑战五位帝君，请等候下个吉日！
3001	开战后每回合会损耗一定生命，注意了！
3002	开战后每回合会失去一定真气，要小心应付！
3003	五金之精在失去一半生命的三回合后自爆，尔等小心！
3004	吾身以力为食，吾魂以气为食，少侠请小心！
3005	吾拥有化身之术，本体不伤则永不落败！
3006	看吾化身之术！
4001	请3人以上组队再来挑战
4002	#C01$teamRoleName#n等级不足30级，不能接取任务
4003	$SEX1请先去小神僧处领取挑战资格
4004	你身上已有此任务
4005	此任务只能完成一次
6001	#C01$roleName#n通过了#L1<14,27>*[五岳帝君]*02#n的考验，并幸运的获得了$lnkProps
7001	领取五岳帝君任务
7002	完成五岳帝君任务
