#-*-coding:utf-8-*-
#作者:叶伟龙@龙川县赤光镇

def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'没有{}的背包解锁数据'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)

#导表开始
gdData={
	1:{"消耗银币":0},
	2:{"消耗银币":0},
	3:{"消耗银币":0},
	4:{"消耗银币":0},
	5:{"消耗银币":50000},
	6:{"消耗银币":50000},
	7:{"消耗银币":100000},
	8:{"消耗银币":100000},
	9:{"消耗银币":125000},
	10:{"消耗银币":145000},
	11:{"消耗银币":165000},
	12:{"消耗银币":185000},
	13:{"消耗银币":205000},
	14:{"消耗银币":225000},
	15:{"消耗银币":245000},
	16:{"消耗银币":265000},
	17:{"消耗银币":285000},
	18:{"消耗银币":305000},
	19:{"消耗银币":325000},
	20:{"消耗银币":345000},
}
#导表结束