编号	等级_S	生命_S	真气_S	物理伤害_S	法术伤害_S	物理防御_S	法术防御_S	速度_S	治疗_S	封印_S	抗封_S	物理抗性	法术抗性	攻击修炼	物防修炼	法防修炼	物理暴击	物理抗暴	法术暴击	法术抗暴	愤怒初始值	符能初始值
1001	BALV	B*1.9	B*1	B*0.6	B*0.6	B*0.7	B*0.9	B*1.2	B*1.1	B*0	B*0.77	0	0	0	0	0						
1002	BALV	B*1.6	B*1	B*0.8	B*0.6	B*0.8	B*0.7	B*0.8	B*0.68	B*0	B*0.77	0	0	0	0	0						
1003	BALV	B*1.6	B*1	B*0.6	B*0.8	B*0.7	B*0.9	B*1	B*0.65	B*0	B*0.81	0	0	0	0	0						
1004	BALV	B*1.8	B*1	B*0.8	B*0.6	B*0.7	B*0.7	B*0.8	B*0.67	B*0	B*0.77	0	0	0	0	0						
1005	BALV	B*1.8	B*1	B*0.5	B*0.8	B*0.6	B*0.6	B*1	B*0.92	B*0	B*0.82	0	0	0	0	0						
1006	BALV	B*1.6	B*1	B*0.5	B*1	B*0.7	B*0.8	B*1.4	B*0.96	B*0	B*0.79	0	0	0	0	0						
1007	BALV	B*2.6	B*1	B*0.8	B*0.8	B*0.7	B*0.7	B*1	B*0.65	B*0	B*0.79	0	0	0	0	0						
1008	BALV	B*2.6	B*1	B*0.7	B*0.9	B*0.7	B*0.7	B*1.7	B*0.63	B*0	B*0.83	0	0	0	0	0						
1009	BALV	B*0.2	B*1	B*0.6	B*0.6	B*0.7	B*0.8	B*1.2	B*1.1	B*0	B*0.77	0	0	0	0	0						
1010	BALV	B*0.1	B*1	B*0.8	B*0.6	B*0.8	B*0.7	B*0.8	B*0.68	B*0	B*0.77	0	0	0	0	0						
1011	BALV	B*0.1	B*1	B*0.6	B*0.8	B*0.7	B*0.8	B*1	B*0.65	B*0	B*0.81	0	0	0	0	0						
1012	BALV	B*0.3	B*1	B*0.6	B*0.6	B*0.7	B*0.8	B*1.2	B*1.1	B*0	B*0.77	0	0	0	0	0						
1013	BALV	B*0.2	B*1	B*0.8	B*0.6	B*0.8	B*0.7	B*0.8	B*0.68	B*0	B*0.77	0	0	0	0	0						
1014	BALV	B*0.2	B*1	B*0.6	B*0.8	B*0.7	B*0.8	B*1	B*0.65	B*0	B*0.81	0	0	0	0	0						
