# -*- coding: utf-8 -*-
from task.defines import *
from task.object import Task as customTask

#导表开始
class Task(customTask):
	parentId = 40001
	targetType = TASK_TARGET_TYPE_NPC
	icon = 0
	title = '''第一章·遇仙'''
	intro = '''与$target说话'''
	detail = '''前面$target看起来是位大仙，仙缘际遇，不可错过！'''
	rewardDesc = '''200001,221401'''
	goAheadScript = ''''''
	initScript = '''N1001,E(1001,1001)'''

	npcInfo = {
		1001:{"名称":"百晓仙姑","造型":"2002(0,1,0,0,0)","位置":"1130,89,68,4","称谓":"蜀山掌门"},
		1002:{"名称":"地痞头子","造型":"4502(0,1,0,0,0)","位置":"1130,61,86,6"},
		1003:{"名称":"师兄路向东","造型":"4502(0,1,0,0,0)","位置":"1130,39,72,4"},
		1004:{"名称":"富贵剑董威","造型":"4003(0,1,0,0,0)","位置":"1130,36,70,4"},
		1005:{"名称":"大师兄姜朝南","造型":"4504(0,1,0,0,0)","位置":"1140,55,25,6"},
		1006:{"名称":"二师兄汪顾北","造型":"4504(0,1,0,0,0)","位置":"2020,82,43,6"},
		1007:{"名称":"三师姐林逐西","造型":"4506(0,1,0,0,0)","位置":"1140,52,10,2"},
		1008:{"名称":"四师兄路向东","造型":"4502(0,1,0,0,0)","位置":"1140,11,38,2"},
		1009:{"名称":"神秘人","造型":"1111(1,1,1,1,1)","位置":"1060,38,39,4"},
		1010:{"名称":"醉汉甲","造型":"4001(0,1,0,0,0)","位置":"1140,51,52,4"},
		1011:{"名称":"醉汉乙","造型":"4502(0,1,0,0,0)","位置":"1140,51,52,4"},
		1012:{"名称":"地痞","造型":"4504(0,1,0,0,0)","位置":"1130,64,86,6"},
		1013:{"名称":"百晓仙姑","造型":"2002(0,1,0,0,0)","位置":"1070,9,41,4","称谓":"蜀山掌门"},
		1014:{"名称":"二师兄汪顾北","造型":"4504(0,1,0,0,0)","位置":"1140,25,43,4"},
		1015:{"名称":"二师兄汪顾北","造型":"4504(0,1,0,0,0)","位置":"1140,41,7,8"},
		2001:{"名称":"匆匆的路人","造型":"2005(0,1,0,0,0)","位置":"1040,40,19,2"},
		2002:{"名称":"刚才的路人","造型":"2005(0,1,0,0,0)","位置":"1040,56,27,2"},
		2003:{"名称":"大师兄姜朝南","造型":"4504(0,1,0,0,0)","位置":"1040,65,35,6"},
		2004:{"名称":"师妹夜仲央","造型":"1121(1,1,1,1,1)","位置":"1040,69,37,6"},
		2005:{"名称":"野兽","造型":"3005(0,1,0,0,0)","位置":"1040,0,0,0"},
		2006:{"名称":"孩童","造型":"2006(0,1,0,0,0)","位置":"2040,17,31,4"},
		2007:{"名称":"师妹夜仲央","造型":"1121(1,1,1,1,1)","位置":"2040,90,9,6"},
		2008:{"名称":"四师兄路向东","造型":"4502(0,1,0,0,0)","位置":"1140,13,18,2"},
		2009:{"名称":"富贵剑董威","造型":"4003(0,1,0,0,0)","位置":"1140,10,19,2"},
		2010:{"名称":"二师兄汪顾北","造型":"4504(0,1,0,0,0)","位置":"1140,58,27,6"},
		2011:{"名称":"百晓仙姑","造型":"2002(0,1,0,0,0)","位置":"1140,22,57,4","称谓":"蜀山掌门"},
		2012:{"名称":"三师姐林逐西","造型":"4506(0,1,0,0,0)","位置":"1140,26,54,4"},
		2013:{"名称":"四师兄路向东","造型":"4502(0,1,0,0,0)","位置":"1140,29,55,4"},
		2014:{"名称":"师妹夜仲央","造型":"1121(1,1,1,1,1)","位置":"1140,21,55,4"},
		2015:{"名称":"大师兄姜朝南","造型":"4504(0,1,0,0,0)","位置":"1140,19,63,4"},
		2016:{"名称":"神秘人","造型":"1111(1,1,1,1,1)","位置":"1140,16,67,4"},
		2017:{"名称":"樗散子","造型":"1111(1,1,1,1,1)","位置":"1140,16,67,4","称谓":"蜀山祖师"},
		2018:{"名称":"鬼修","造型":"4509(0,1,0,0,0,0)","位置":"1130,87,60,8"},
	}

	eventInfo = {
		1001:{"点击":"STORY(99997,1001)","成功":"R1001,D1001,DONE,DEFF,T40002"},
		1002:{"点击":"POPI","成功":"R1002,D1002,DONE,DEFF,T40003","失败":"D1003"},
		1003:{"点击":"SB1031","回复":"1:F1001,E(0,1024);2:F1008,E(0,1025);3:D1035"},
		1004:{"点击":"SB1006","回复":"1:R1021,D1036,DONE,DEFF,T40005;2:R1004,D1037,DONE,DEFF,T40005"},
		1005:{"点击":"SB1032","回复":"1:F1002","成功":"R1005,D1007,DONE,DEFF,T40006","失败":"D1008"},
		1006:{"点击":"D1009"},
		1007:{"点击":"R1006,D1010,DONE,DEFF,T40007"},
		1008:{"点击":"TAKE","成功":"R1007,D1011,DONE,DEFF,T40008","失败":"D1012"},
		1009:{"点击":"D9002,R1009,DONE,DEFF,T40010"},
		1010:{"点击":"D1013,R1008,DONE,DEFF,T40009"},
		1013:{"点击":"D1014,R1010,DONE,DEFF,T40011"},
		1014:{"点击":"SB1039","回复":"1:F1003;2:D1015","成功":"R1011,D1021,DONE,DEFF,T40012","失败":"D1022"},
		1015:{"点击":"R1012,D1023,DONE,DEFF,T40013"},
		1016:{"点击":"R1013,D1025,DONE,DEFF,T40014"},
		1017:{"点击":"SB1040","回复":"1:F1004","成功":"R1014,D1033,DONE,DEFF,T40015"},
		1018:{"点击":"F1005","成功":"R1015,D1034,DONE,DEFF,T40016"},
		1019:{"点击":"R1016,D1026,DONE,DEFF,T40017"},
		1020:{"点击":"R1017,D1027,DONE,DEFF,T40018"},
		1021:{"点击":"SB2049","回复":"1:F1006","成功":"R1018,D1028,DONE,DEFF,T40019"},
		1022:{"点击":"SB2050","回复":"1:F1007","成功":"R1019,D1029,DONE,DEFF,T40020"},
		1023:{"点击":"R1020,D1030,DONE,DEFF,$next40101"},
		1024:{"点击":"F1001","成功":"R1003,D1004,DONE,DEFF,T40004","失败":"D1005"},
		1025:{"点击":"F1008","成功":"R1022,D1004,DONE,DEFF,T40004","失败":"D1005"},
		1026:{"点击":"D1038"},
		2001:{"点击":"R2001,D2001,DONE,DEFF,T40102"},
		2002:{"点击":"R2002,D2002,DONE,DEFF,T40103"},
		2003:{"点击":"SB2003","回复":"1:F2001","成功":"R2003,D2006,DONE,DEFF,T40104","失败":"D2005"},
		2004:{"点击":"D2004"},
		2005:{"点击":"F2002","成功":"R2004,DONE,DEFF,T40105"},
		2006:{"点击":"SB2008","回复":"1:F2003","成功":"R2005,D2010,DONE,DEFF,T40106","失败":"D2009"},
		2007:{"点击":"POPI","成功":"R2006,D2011,DONE,DEFF,T40107","失败":"D2012"},
		2008:{"点击":"R2007,D2013,DONE,DEFF,T40108"},
		2009:{"点击":"SB2014","回复":"1:R2008,D2015,T40109,DONE,DEFF;2:D2016"},
		2010:{"点击":"SB2018","回复":"1:F2004","成功":"R2009,D2019,DONE,DEFF,T40110"},
		2011:{"点击":"D2017"},
		2012:{"点击":"SB2051","回复":"1:F2005","成功":"R2010,D2020,DONE,DEFF,T40111"},
		2013:{"点击":"D2021,R2011,DONE,DEFF,T40112"},
		2014:{"点击":"SB2022","回复":"1:F2006","成功":"R2012,D2026,DONE,DEFF,T40113"},
		2015:{"点击":"D2023"},
		2016:{"点击":"D2024"},
		2017:{"点击":"D2025"},
		2018:{"点击":"D2027,R2013,DONE,DEFF,T40114"},
		2019:{"点击":"SB2028","回复":"1:R2014,D2030,T40115,TP2043,DONE;2:R2012,D2031,T40115,TP2044,DONE,DEFF"},
		2020:{"点击":"D2029"},
		2021:{"点击":"SB2032","回复":"1:R2015,D2034,T40116,DONE,DEFF"},
		2022:{"点击":"D2033"},
		2023:{"点击":"SB2036","回复":"1:F2007","成功":"R2016,D2037,DONE,DEFF,T40117"},
		2024:{"点击":"D2035"},
		2025:{"点击":"D2038,R2017,DONE,DEFF,T40118"},
		2026:{"点击":"D2039"},
		2027:{"点击":"D2040"},
		2028:{"点击":"D2041,R2018,DONE,DEFF,T40119"},
		2029:{"点击":"SB2045","回复":"1:F2008;2:D2046","成功":"R2019,D2047,DONE,DEFF,T49999"},
		2030:{"点击":"D2042"},
		2031:{"点击":"D2048,R2020,DONE,DEFF,T40001"},
	}

	rewardInfo = {
		1001:{"经验":lambda :53,"宠物经验":lambda :100,"银币":lambda :4000,"物品":[1001]},
		1002:{"经验":lambda :53,"宠物经验":lambda :100,"银币":lambda :5000,"物品":[1002]},
		1003:{"经验":lambda :135,"宠物经验":lambda :225,"银币":lambda :6000,"侠义值":2},
		1004:{"经验":lambda :135,"宠物经验":lambda :225,"银币":lambda :7000},
		1005:{"经验":lambda :323,"宠物经验":lambda :400,"银币":lambda :8000,"侠义值":2},
		1006:{"经验":lambda :323,"宠物经验":lambda :400,"银币":lambda :9000},
		1007:{"经验":lambda :660,"宠物经验":lambda :625,"银币":lambda :10000},
		1008:{"经验":lambda :660,"宠物经验":lambda :625,"银币":lambda :11000},
		1009:{"经验":lambda :1193,"宠物经验":lambda :900,"银币":lambda :12000},
		1010:{"经验":lambda :1193,"宠物经验":lambda :900,"银币":lambda :13000},
		1011:{"经验":lambda :1965,"宠物经验":lambda :1225,"银币":lambda :14000,"侠义值":2},
		1012:{"经验":lambda :1965,"宠物经验":lambda :1225,"银币":lambda :15000},
		1013:{"经验":lambda :3023,"宠物经验":lambda :1600,"银币":lambda :16000},
		1014:{"经验":lambda :3023,"宠物经验":lambda :1600,"银币":lambda :17000,"侠义值":2},
		1015:{"经验":lambda :4410,"宠物经验":lambda :2025,"银币":lambda :18000,"侠义值":2},
		1016:{"经验":lambda :4410,"宠物经验":lambda :2025,"银币":lambda :19000},
		1017:{"经验":lambda :6173,"宠物经验":lambda :2500,"银币":lambda :20000},
		1018:{"经验":lambda :6173,"宠物经验":lambda :2500,"银币":lambda :21000,"侠义值":2},
		1019:{"经验":lambda :8355,"宠物经验":lambda :3025,"银币":lambda :22000,"侠义值":2},
		1020:{"经验":lambda :8355,"宠物经验":lambda :3025,"银币":lambda :23000},
		1021:{"经验":lambda :135,"宠物经验":lambda :225,"银币":lambda :24000,"物品":[1003]},
		1022:{"经验":lambda :135,"宠物经验":lambda :225,"银币":lambda :25000,"物品":[1004]},
		2001:{"经验":lambda :11003,"宠物经验":lambda :3600,"银币":lambda :26000},
		2002:{"经验":lambda :11003,"宠物经验":lambda :3600,"银币":lambda :27000},
		2003:{"经验":lambda :14160,"宠物经验":lambda :4225,"银币":lambda :28000,"侠义值":2,"物品":[1005]},
		2004:{"经验":lambda :14160,"宠物经验":lambda :4225,"银币":lambda :29000,"侠义值":2},
		2005:{"经验":lambda :17873,"宠物经验":lambda :4900,"银币":lambda :30000,"侠义值":2,"物品":[1006]},
		2006:{"经验":lambda :17873,"宠物经验":lambda :4900,"银币":lambda :31000},
		2007:{"经验":lambda :22185,"宠物经验":lambda :5625,"银币":lambda :32000},
		2008:{"经验":lambda :22185,"宠物经验":lambda :5625,"银币":lambda :33000},
		2009:{"经验":lambda :27143,"宠物经验":lambda :6400,"银币":lambda :34000,"侠义值":2},
		2010:{"经验":lambda :27143,"宠物经验":lambda :6400,"银币":lambda :35000,"侠义值":2},
		2011:{"经验":lambda :32790,"宠物经验":lambda :7225,"银币":lambda :36000,"物品":[1007]},
		2012:{"经验":lambda :32790,"宠物经验":lambda :7225,"银币":lambda :37000,"侠义值":2},
		2013:{"经验":lambda :39173,"宠物经验":lambda :8100,"银币":lambda :38000},
		2014:{"经验":lambda :39173,"宠物经验":lambda :8100,"银币":lambda :39000},
		2015:{"经验":lambda :46335,"宠物经验":lambda :9025,"银币":lambda :40000},
		2016:{"经验":lambda :46335,"宠物经验":lambda :9025,"银币":lambda :41000,"侠义值":2},
		2017:{"经验":lambda :54323,"宠物经验":lambda :10000,"银币":lambda :42000},
		2018:{"经验":lambda :54323,"宠物经验":lambda :10000,"银币":lambda :43000},
		2019:{"经验":lambda :126360,"宠物经验":lambda :22050,"银币":lambda :44000,"侠义值":2},
		2020:{"经验":lambda :60,"宠物经验":lambda :60,"银币":lambda :3000},
	}

	rewardPropsInfo = {
		1001:(
			{"权重":100,"物品":"221102","数量":"1","绑定":0},
		),
		1002:(
			{"权重":50,"物品":"221401","数量":"1","绑定":0},
			{"权重":50,"物品":"221401","数量":"1","绑定":0},
		),
		1003:(
			{"权重":100,"物品":"221101","数量":"1","绑定":0},
		),
		1004:(
			{"权重":100,"物品":"221102","数量":"1","绑定":0},
		),
		1005:(
			{"权重":100,"物品":"101401","数量":"1","绑定":0},
		),
		1006:(
			{"权重":100,"物品":"101601","数量":"1","绑定":0},
		),
		1007:(
			{"权重":100,"物品":"101501","数量":"1","绑定":0},
		),
	}

	groupInfo = {
		9001:(1005,1007,1008,),
		9002:(1018,1019,1020,),
	}

	chatInfo = {
		1001:'''我？我乃蜀山掌门。唔……今天你有缘见我，且看你骨骼清奇，或许有缘随我上山修炼。	*A*nA**SS*$S2S$（仙缘难得，与其留在尘世中浑浑噩噩，倒不如上山一试！）\n师父在上，请受徒儿拜师礼。''',
		1002:'''这药草……好好，果然有我心……咳咳，但是有心是不够的，还要看你根基，那边有个无赖，除掉他吧。	这里有点药草，你先带在身上。''',
		1003:'''我要的物品……你还没带来吧。''',
		1004:'''啊啊，别打，我和你什么仇什么怨啊。''',
		1005:'''哟，这么菜比还主动挑衅我。''',
		1006:'''干得好，为师允许你进我蜀门，你路师兄刚好也来苏州了，先随他锻炼一下。\nQ还、还要打吗？\nQ好！''',
		1007:'''哈哈，你以为真的打赢了我吗？我才出了不到一成功力。好啦，随我回蜀山吧。''',
		1008:'''哟，刚入门能有这种程度不错咯。''',
		1009:'''我与路向东可是至交，他来苏州吃喝拉撒我全管了！''',
		1010:'''为师现在就传授你蜀山基本口诀，你留心听着\n#C09（传授口诀中……）#n''',
		1011:'''徒儿真有为师心，你也累了，四处走走吧。''',
		1012:'''你给为师这个干嘛呢？''',
		1013:'''你是$N？……其实……蜀山其实并没有那么……	*A*nA**SS*$S2S$二师兄我明白的！我会努力，不会丢蜀山的脸。''',
		1014:'''…………	*A*nA**SS*$S2S$请问前辈，这里是何处？\n这位前辈怎么腿好像有点不方便？	*A神秘人A**S1111S*$S1S$腿不方便？你没看到我的脚镣吗？……\n你是蜀山派的人？！''',
		1015:'''……快离开这里，这里是不祥之地！''',
		1016:'''小心，别犯错被赶走。''',
		1017:'''嗯，师父好像叫你着？''',
		1018:'''哦……我从来没去过。''',
		1019:'''直走在转弯。''',
		1020:'''不不，走错了，返回原处。''',
		1021:'''啧啧……又一个被骗的傻瓜，跟我一样。''',
		1022:'''快滚吧！留着你的小命！''',
		1023:'''现在所谓的蜀山，其实由一帮叛帮的人把持，他们反客为主，囚我在此已经多年。	然而那些叛徒正临百年一遇的天劫，若是能趁机干扰，或者……''',
		1024:'''然而那些叛徒正临百年一遇的天劫，若是能趁机干扰，或者……''',
		1025:'''一派胡言，你切勿听帮中叛徒在妖言惑众。好吧，你先帮为师清理一下门外的醉汉。''',
		1026:'''混账徒儿，胆敢欺负上门求助的老百姓！大逆不道！''',
		1027:'''胡说，为师怎么说过这番话，你看他们有喝醉酒的样子吗？！''',
		1028:'''哼！让三师姐收拾收拾你这孽徒！''',
		1029:'''哼！让二师兄收拾收拾你这孽徒！''',
		1030:'''……你走吧，不要再上山了，修仙……并没有你想象得那么美好纯净。''',
		1031:'''看什么看小子？！\nQ只打敌首\nQ一网打尽\nQ打声招呼''',
		1032:'''来吧，让师兄敲打敲打你的筋骨\nQ切磋一番\nQ再等一下''',
		1033:'''杀人啊！蜀山派杀人啊！''',
		1034:'''救、救命！''',
		1035:'''跟你很熟哈？！''',
		1036:'''进来蜀山门，哪能那么怕事！给你一丹药拿着！''',
		1037:'''嗯！果然有志气！''',
		1038:'''我就一围观群众，别打到我哟，要不我不客气。''',
		1039:'''你真的是蜀山派的人？！\nQ是、是啊\nQ不是不是''',
		1040:'''呃、呃……好酒！\nQ快点离开''',
		2001:'''啊！……不好意思、不好意思，\n我顾着走路看书，碰到你了，实在对不起。''',
		2002:'''诶，这位朋友，刚刚从你身上掉下了这卷锦书，幸好我发现了。	*A*nA**SS*$S2S$（锦书？我没有锦书啊……莫非是那位被囚禁的前辈偷偷塞给我的？）''',
		2003:'''走得那么快，怎么不跟大师兄我道个别呢？\nQ大师兄，得罪了！\nQ(沉默不语)''',
		2004:'''…………这、这就是与我一样，刚入门的人？''',
		2005:'''这么弱不禁风，你还是跟我回师门受罚吧。''',
		2006:'''哈哈哈哈，很好很好，只不过要战胜师尊还是欠点火候。	五月端午午时，便是师尊闭关之日，若此时你能道成归来，倒有成功的可能性。''',
		2007:'''不够不够……这里附近有只巨大的岩石怪，我要战胜它！''',
		2008:'''轰轰轰轰轰轰轰\nQ上吧\nQ再准备一下''',
		2009:'''打不赢它，还谈什么回蜀山？！''',
		2010:'''轰轰轰轰……\n（岩石妖缩成一团）	*A*nA**SS*$S2S$战胜了！但这段时间我必须不断训练！\n#C09——三个月后——#n''',
		2011:'''谢、谢谢……快到端午了，我、我给粽子你吃啊。	*A*nA**SS*$S2S$（对了，快到端午，正是师傅闭关之时！）''',
		2012:'''呜呜呜……好痛啊好痛啊。''',
		2013:'''呃，怎么啦？粽子……	*A*nA**SS*$S2S$（我真的要回蜀山吗？……嗯！那前辈被囚多年，正宗蜀山已经破落，我、我不能让他们继续作恶！）''',
		2014:'''真、真的要回蜀山，和师傅战斗吗？\nQ是的\nQ我……不是''',
		2015:'''……我、我也知道会是这个答案。我……会阻止你的，尽管现在蜀山不一定是正确的，	但并不代表以前的就一定好啊！你有了解过吗？！''',
		2016:'''呼……那实在太好了——你不是骗我的吧？''',
		2017:'''哼，虽然我不是蜀山中人，但关乎正道气运之事我不得不管！''',
		2018:'''天庭有路你不走，地狱没门闯进来，看招！\nQ……来吧！''',
		2019:'''咳咳咳……怎么，如此厉害。	*A富贵剑董威A**S4501S*$S2S$这厮实力不同寻常！今天蜀山师尊正要闭关，实力大减，你们快回去！这里有我挡着。''',
		2020:'''咳咳……我……呃……。	*A*nA**SS*$S2S$（糟糕，他伤重死了……怎么会……不行，我不能动摇，走吧！）''',
		2021:'''百年大劫，应在当时；\n不破不立，蜀山当兴。	……你去做你认为对的事吧。''',
		2022:'''………………\nQ进攻\nQ准备''',
		2023:'''孽畜！欺师灭祖，天诛地灭！''',
		2024:'''哼，第一次见面时，我就该下重手废了你！''',
		2025:'''如果可以和平相处……我是太天真了吧？''',
		2026:'''………………	*A*nA**SS*$S2S$师兄师姐已经败了，到你了，师父。你若不肯先出手，那徒儿就得罪了！''',
		2027:'''………………	*A*nA**SS*$S2S$师父，你怎么了……	*A大师兄姜朝南A**S4504S*$S1S$百晓她因为气急攻心，又急于出关，早就走火入魔，全身枯死，跟活死人没区别，动手吧。''',
		2028:'''……………………\nQ恶贯满盈，受死\nQ我、我下不了手''',
		2029:'''此时不下手，更待何时？''',
		2030:'''啊………………\n#C09（百晓仙姑被杀）#n	*A*nA**SS*$S2S$哼，一切都结束了。''',
		2031:'''啊………………\n#C09（百晓仙姑被杀）#n	*A*nA**SS*$S2S$大师兄你、你为什么要下手？''',
		2032:'''哈哈哈哈……百晓这叛徒已死，老夫终于重见天日了！\nQ你到底是谁？！''',
		2033:'''恭喜师尊，得以重掌蜀门！''',
		2034:'''老夫便是蜀山派开派祖师樗散子，你学了老夫心血所写的锦书，	也算是老夫亲传弟子，以后就和朝南侍奉老夫左右吧！''',
		2035:'''区区蝼蚁，不值老夫出手。''',
		2036:'''樗散子！你做了那么多伤天害理的事，不可以再让你为祸世间！\nQ三师姐，等等……''',
		2037:'''可恨当年恩师念你为蜀门开派人，没有杀了你，误了天下苍生……	*A樗散子A**S1111S*$S2S$废话真多。\n#C09（樗散子以剑气杀了林逐西）#n''',
		2038:'''樗祖师爷，我、我路向东乃是您徒孙，绝对不会向林逐西那般愚钝！	在樗祖师爷带领下，我们蜀山一定会千秋万载，一统三界！''',
		2039:'''蝼蚁与蝼蚁间的对话，老夫不管。''',
		2040:'''百晓真该死，胆敢囚禁祖师爷这么久，只可惜小的微末技艺，敢怒不敢言。''',
		2041:'''我虽入门不久，但也不会像四师兄你这样卖师求荣！	*A四师兄路向东A**S4502S*$S2S$别、别胡说，识时务者为俊杰啊！	*A樗散子A**S1111S*$S1S$聒耳得让人烦厌，人各有志，某徒孙你就杀了她吧。''',
		2042:'''哼！我将随师父与三师姐而去！''',
		2043:'''你内心感到一丝愧疚''',
		2044:'''你内心感到一丝愤怒''',
		2045:'''别怪我，是你不识时务而已！\nQ四师兄住手！\nQ就手旁观''',
		2046:'''（你内心谴责着你）''',
		2047:'''啊！你、你居然……\n#C09（路向东已死）#n	*A大师兄姜朝南A**S4504S*$S2S$啊哈哈哈，有出息，我早料到背叛师门这事会上瘾的了。''',
		2048:'''哈哈哈哈，那些所谓正道弟子，终于落入我的包围网中了，看我怎样对付他们！	*A*nA**SS*$S2S$（诶？好像有什么诡异的事情要发生了，跟过去看看吧。）''',
		2049:'''哈哈哈，犯了门规就想跑？\nQ得罪了\nQ准备一下''',
		2050:'''跟我回去或者还能活命？！\nQ抱歉了\nQ准备一下''',
		2051:'''哼，我死也不会后退\nQ没办法了\nQ准备一下''',
		8000:'''暂未开放，敬请期待''',
	}

	branchInfo = {
	}

	fightInfo = {
		1001:(
			{"类型":1,"名称":"地痞","造型":"4502(0,1,0,0,0)","能力编号":"1001","数量":"1","技能":(5420,)},
			{"类型":0,"名称":"村民","造型":"4504(0,1,0,0,0)","能力编号":"1002","数量":"1"},
		),
		1002:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1003","数量":"1","技能":(1111,1112,1113,),"站位":(1,)},
			{"类型":0,"名称":"御兽","造型":"3004(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(5401,5406,),"站位":(7,)},
			{"类型":0,"名称":"御兽","造型":"3001(0,1,0,0,0)","能力编号":"1002","数量":"1","技能":(5404,5409,),"站位":(8,)},
		),
		1003:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1004","数量":"1","技能":(1131,1132,1133,)},
		),
		1004:(
			{"类型":1,"名称":"醉汉甲","造型":"4001(0,1,0,0,0)","能力编号":"1005","数量":"1","技能":(1211,1212,1213,),"站位":(1,)},
			{"类型":0,"名称":"疑似醉汉","造型":"4502(0,1,0,0,0)","能力编号":"1006","数量":"2","技能":(5418,5417,),"站位":(7,8,)},
			{"类型":0,"名称":"野兽","造型":"3005(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(5402,5407,),"站位":(2,)},
			{"类型":0,"名称":"野兽","造型":"3004(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(5403,5408,),"站位":(3,)},
		),
		1005:(
			{"类型":1,"名称":"醉汉乙","造型":"4502(0,1,0,0,0)","能力编号":"1007","数量":"1","技能":(5415,5416,),"站位":(1,)},
			{"类型":0,"名称":"疑似醉汉","造型":"4502(0,1,0,0,0)","能力编号":"1008","数量":"2","技能":(5401,),"站位":(6,7,)},
			{"类型":0,"名称":"异兽","造型":"3004(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(5404,5409,),"站位":(8,)},
			{"类型":0,"名称":"异兽","造型":"3003(0,1,0,0,0)","能力编号":"1006","数量":"1","技能":(5401,5406,),"站位":(11,)},
		),
		1006:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1009","数量":"1","技能":(1111,1112,1113,),"站位":(1,)},
			{"类型":0,"名称":"富贵剑董威","造型":"4003(0,1,0,0,0)","能力编号":"1010","数量":"1","技能":(5419,),"站位":(2,)},
			{"类型":0,"名称":"御兽","造型":"3004(0,1,0,0,0)","能力编号":"1008","数量":"1","技能":(5405,5410,),"站位":(3,)},
			{"类型":0,"名称":"御兽","造型":"3001(0,1,0,0,0)","能力编号":"1008","数量":"2","技能":(5405,5410,),"站位":(6,7,)},
		),
		1007:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1011","数量":"1","技能":(1111,1121,1122,),"站位":(6,)},
			{"类型":0,"名称":"见习学徒","造型":"4508(0,1,0,0,0)","能力编号":"1012","数量":"2","技能":(1111,1112,),"站位":(7,8,)},
			{"类型":0,"名称":"见习学徒","造型":"4508(0,1,0,0,0)","能力编号":"1012","数量":"1","技能":(1111,1112,),"站位":(1,)},
			{"类型":0,"名称":"御兽","造型":"5001(0,1,0,0,0)","能力编号":"1012","数量":"1","技能":(5413,5418,),"站位":(11,)},
		),
		1008:(
			{"类型":1,"名称":"地痞","造型":"4502(0,1,0,0,0)","能力编号":"1001","数量":"1","技能":(5420,)},
			{"类型":0,"名称":"村民","造型":"4504(0,1,0,0,0)","能力编号":"1002","数量":"2"},
		),
		2001:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"2001","数量":"1","技能":(1131,1132,1133,),"站位":(6,)},
			{"类型":0,"名称":"师妹夜仲央","造型":"1121(1,1,1,1,1)","能力编号":"2002","数量":"1","技能":(1121,1122,1123,),"站位":(1,)},
			{"类型":0,"名称":"御兽","造型":"3007(0,1,0,0,0)","能力编号":"2003","数量":"2","技能":(1111,1112,1113,),"站位":(7,8,)},
			{"类型":0,"名称":"御兽","造型":"3003(0,1,0,0,0)","能力编号":"2003","数量":"2","技能":(1111,1112,1113,),"站位":(2,3,)},
		),
		2002:(
			{"类型":0,"名称":"野兽","造型":"3007(0,1,0,0,0)","能力编号":"2004","数量":"2","技能":(5403,5413,)},
			{"类型":0,"名称":"野兽","造型":"3004(0,1,0,0,0)","能力编号":"2004","数量":"3","技能":(5404,5414,)},
			{"类型":0,"名称":"野兽","造型":"3005(0,1,0,0,0)","能力编号":"2004","数量":"2","技能":(5405,5415,)},
		),
		2003:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"2005","数量":"1","技能":(5403,5413,5408,5418,),"站位":(1,)},
			{"类型":0,"名称":"野兽","造型":"3007(0,1,0,0,0)","能力编号":"2004","数量":"4","技能":(5414,),"站位":(4,5,7,8,)},
		),
		2004:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"2006","数量":"1","技能":(1111,1112,1113,1121,1122,1123,),"站位":(1,)},
			{"类型":0,"名称":"富贵剑董威","造型":"4003(0,1,0,0,0)","能力编号":"2006","数量":"1","技能":(1211,1212,1213,),"站位":(6,)},
			{"类型":0,"名称":"蜀山门人","造型":"4506(0,1,0,0,0)","能力编号":"2007","数量":"2","技能":(1111,1112,1113,),"站位":(2,3,)},
			{"类型":0,"名称":"蜀山门人","造型":"4506(0,1,0,0,0)","能力编号":"2007","数量":"2","技能":(1121,1122,1123,),"站位":(7,8,)},
		),
		2005:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"2008","数量":"1","技能":(1211,1212,1213,1221,1222,1223,1231,1232,1233,),"站位":(11,)},
			{"类型":0,"名称":"蜀山门人","造型":"4502(0,1,0,0,0)","能力编号":"2009","数量":"2","技能":(1111,1112,1113,),"站位":(14,12,)},
			{"类型":0,"名称":"蜀山门人","造型":"4502(0,1,0,0,0)","能力编号":"2009","数量":"2","技能":(1111,1112,1113,),"站位":(13,1,)},
		),
		2006:(
			{"类型":0,"名称":"三师姐林逐西","造型":"4506(0,1,0,0,0)","能力编号":"2010","数量":"1","技能":(1111,1112,1113,1121,1122,1123,),"站位":(1,)},
			{"类型":0,"名称":"四师兄路向东","造型":"4502(0,1,0,0,0)","能力编号":"2010","数量":"1","技能":(1111,1112,1113,1121,1122,1123,),"站位":(2,)},
			{"类型":0,"名称":"师妹夜仲央","造型":"1121(1,1,1,1,1)","能力编号":"2010","数量":"1","技能":(1111,1112,1113,1121,),"站位":(3,)},
			{"类型":0,"名称":"御兽","造型":"3005(0,1,0,0,0)","能力编号":"2011","数量":"3","技能":(5419,5420,),"站位":(7,6,8,)},
			{"类型":0,"名称":"御兽","造型":"3007(0,1,0,0,0)","能力编号":"2011","数量":"3","技能":(5419,5420,),"站位":(12,11,13,)},
		),
		2007:(
			{"类型":1,"名称":"三师姐林逐西","造型":"4506(0,1,0,0,0)","能力编号":"2012","数量":"1","技能":(1111,1112,1113,1121,1122,1123,),"站位":(1,)},
		),
		2008:(
			{"类型":1,"名称":"四师兄路向东","造型":"4502(0,1,0,0,0)","能力编号":"2013","数量":"1","技能":(1111,1112,1113,1121,1122,1123,),"站位":(1,)},
			{"类型":0,"名称":"蜀山门人","造型":"4506(0,1,0,0,0)","能力编号":"2014","数量":"2","技能":(1111,1112,1113,),"站位":(2,3,)},
			{"类型":0,"名称":"蜀山门人","造型":"4506(0,1,0,0,0)","能力编号":"2014","数量":"2","技能":(1131,1132,1133,),"站位":(7,8,)},
			{"类型":0,"名称":"蜀山门人","造型":"4502(0,1,0,0,0)","能力编号":"2014","数量":"2","技能":(1121,1122,1123,),"站位":(6,11,)},
			{"类型":0,"名称":"蜀山门人","造型":"4502(0,1,0,0,0)","能力编号":"2014","数量":"2","技能":(1111,1112,1113,),"站位":(9,10,)},
		),
	}

	ableInfo = {
		1001:{"等级":"2","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1002:{"等级":"1","生命":"B*1.0","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*1.1","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1003:{"等级":"3","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1004:{"等级":"5","生命":"B*1.5","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*1.0","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1005:{"等级":"8","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1006:{"等级":"7","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1007:{"等级":"9","生命":"B*1.0","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1008:{"等级":"8","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1009:{"等级":"9","生命":"B*1.0","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1010:{"等级":"8","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1011:{"等级":"10","生命":"B*1.0","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1012:{"等级":"9","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.7","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2001:{"等级":"13","生命":"B*1.2","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.5","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2002:{"等级":"12","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.5","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2003:{"等级":"11","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.5","法术伤害":"B*0.5","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2004:{"等级":"12","生命":"B*0.5","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2005:{"等级":"13","生命":"B*1.2","真气":"B*1","物理伤害":"B*0.7","法术伤害":"B*0.7","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2006:{"等级":"14","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2007:{"等级":"13","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.5","法术伤害":"B*0.5","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2008:{"等级":"15","生命":"B*1.0","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2009:{"等级":"14","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2010:{"等级":"16","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.4","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2011:{"等级":"15","生命":"B*0.6","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.5","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2012:{"等级":"18","生命":"B*2.3","真气":"B*1","物理伤害":"B*0.7","法术伤害":"B*0.7","物理防御":"B*0.3","法术防御":"B*0.3","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2013:{"等级":"19","生命":"B*1.5","真气":"B*1","物理伤害":"B*0.4","法术伤害":"B*0.4","物理防御":"B*0.3","法术防御":"B*0.4","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		2014:{"等级":"20","生命":"B*0.5","真气":"B*1","物理伤害":"B*0.3","法术伤害":"B*0.3","物理防御":"B*0.3","法术防御":"B*0.4","速度":"B*0.6","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
	}

	lineupInfo = {
	}

	configInfo = {
		"生成路径":"main",
	}
#导表结束

	def validDoEventScript(self, who, npcObj, key):
		needLevel = getattr(self,"needLevel",0)
		if who.level<needLevel:
			message.tips(who,"请先升到#C04{}级#n".format(needLevel))
			return 0
		return customTask.validDoEventScript(self, who, npcObj, key)

	def customEvent(self, who, npcObj, eventName, *args):
		m = re.match("next(\d+)", eventName)
		if m:
			nextTaskId = int(m.group(1))
			if task.hasTask(who,40001):
				return
			if who.level<nextTaskId%10000/10:
				nextTaskId = 40000

			task.newTask(who, npcObj, nextTaskId)
	
	def canAbort(self):
		return 0

	def rewardByType(self, who, val, _type):
		if _type == "侠义值":
			self.rewardHelpPoint(who, val, _type)
			return
		template.Template.rewardByType(self, who, val, _type)
		

	def rewardHelpPoint(self, who, val, _type):
		teamObj = who.getTeamObj()
		if not teamObj:
			return
		teamList = teamObj.getInTeamList()
		for pid in teamList:
			if pid == who.id:
				continue
			target = getRole(pid)
			if target:
				target.addHelpPoint(val, self.name)

		
from common import *
import task
import re
import launch
import message
import template