# -*- coding: utf-8 -*-
from task.defines import *
from task.object import Task as customTask

#导表开始
class Task(customTask):
	parentId = 50201
	targetType = TASK_TARGET_TYPE_NPC
	icon = 1
	title = '''秘册任务'''
	intro = '''$scene的$target藏有秘册，此物与你有缘，去夺回吧。'''
	detail = '''$scene的$target在不久前抢了一本秘册，此秘册与你有缘，快去抢回来吧。'''
	rewardDesc = ''''''
	goAheadScript = ''''''
	initScript = '''N9001,E(1,1001)'''

	npcInfo = {
		1001:{"名称":"张亮","造型":"4502(0,1,0,0,0)","位置":"$pos","称谓":"粉牡丹"},
		1002:{"名称":"秦朗","造型":"4502(0,1,0,0,0)","位置":"$pos","称谓":"飞天夜叉"},
		1003:{"名称":"金光鼎","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"飞天蜈蚣"},
		1004:{"名称":"马雄","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"独角蟒"},
		1005:{"名称":"陆虎","造型":"4502(0,1,0,0,0)","位置":"$pos","称谓":"分水犀牛"},
		1006:{"名称":"白绪","造型":"4502(0,1,0,0,0)","位置":"$pos","称谓":"闹海银龙"},
		1007:{"名称":"俞德","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"粉面佛"},
		1008:{"名称":"郑元规","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"长臂神魔"},
		1009:{"名称":"祝鹗","造型":"4502(0,1,0,0,0)","位置":"$pos","称谓":"铁掌仙"},
		1010:{"名称":"尉迟元","造型":"4502(0,1,0,0,0)","位置":"$pos","称谓":"霹雳手"},
		1011:{"名称":"林成祖","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"草上飞"},
		1012:{"名称":"狄银儿","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"披发狻猊"},
		1013:{"名称":"薛蟒","造型":"4502(0,1,0,0,0)","位置":"$pos","称谓":"三眼红蜺"},
		1014:{"名称":"柳宗潜","造型":"4502(0,1,0,0,0)","位置":"$pos","称谓":"小灵猴"},
		1015:{"名称":"徐岳","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"神手青雕"},
		1016:{"名称":"邱龄","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"八臂魔主"},
		1017:{"名称":"苏莲","造型":"4506(0,1,0,0,0)","位置":"$pos","称谓":"百花女"},
		1018:{"名称":"柳燕娘","造型":"4506(0,1,0,0,0)","位置":"$pos","称谓":"九尾天狐"},
		1019:{"名称":"司徒雷","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"阴阳叟"},
		1020:{"名称":"文宝熏","造型":"4504(0,1,0,0,0)","位置":"$pos","称谓":"双头鼠"},
		2001:{"名称":"连山大师","造型":"4502(0,1,0,0,0)","位置":"$mypos"},
	}

	eventInfo = {
		1001:{"点击":"F1001","成功":"D9004,R1001,DONE,DEFF","失败":"D1005"},
		2001:{"点击":"SB2001","回复":"1:R2001,DONE,DEFF;2:E(0,2002),F2001"},
		2002:{"点击":"F2001","成功":"E(0,2003),SB2002","失败":"D2007,E(0,2001)"},
		2003:{"点击":"SB2002","回复":"1:R2002,DONE,DEFF;2:E(0,2004),F2002"},
		2004:{"点击":"F2002","成功":"B(1001,lv)","失败":"D2008,E(0,2003)"},
		2005:{"点击":"SB2003","回复":"1:R2003,DONE;2:E(0,2006),F2003"},
		2006:{"点击":"F2003","成功":"R2004,D2005,DONE,DEFF","失败":"D2009,E(0,2005)"},
		3001:{"点击":"DONE,DEFF,R3001,LOOK"},
	}

	rewardInfo = {
		1001:{"物品":[1001]},
		1002:{"物品":[1002]},
		2001:{"经验":lambda LV:LV*100+8500,"宠物经验":lambda PLV:PLV*100+8500,"银币":lambda LV:LV*50+3000,"物品":[2001]},
		2002:{"经验":lambda LV:LV*200+17000,"宠物经验":lambda PLV:PLV*200+17000,"银币":lambda LV:LV*100+6000,"物品":[2002]},
		2003:{"经验":lambda LV:LV*500+42500,"宠物经验":lambda PLV:PLV*500+42500,"银币":lambda LV:LV*250+15000,"物品":[2003]},
		2004:{"经验":lambda LV:LV*1000+85000,"宠物经验":lambda PLV:PLV*1000+85000,"银币":lambda LV:LV*500+30000,"物品":[2004]},
		3001:{"经验":lambda :1000,"宠物经验":lambda :1200,"银币":lambda :10000},
	}

	rewardPropsInfo = {
		1001:(
			{"权重":10,"物品":"202006","数量":"1","绑定":0},
		),
		1002:(
			{"权重":12,"物品":"202008","数量":"1","绑定":0},
			{"权重":88,"物品":"0","数量":"0","绑定":0},
		),
		2001:(
			{"权重":200,"物品":"234901","数量":"1","绑定":0},
			{"权重":700,"物品":"0","数量":"0","绑定":0},
		),
		2002:(
			{"权重":600,"物品":"234901","数量":"1","绑定":0},
			{"权重":400,"物品":"0","数量":"0","绑定":0},
		),
		2003:(
			{"权重":700,"物品":"234901","数量":"1","绑定":0},
			{"权重":200,"物品":"234903","数量":"1","绑定":0,"传闻":"RSA8003"},
			{"权重":100,"物品":"0","数量":"0","绑定":0},
		),
		2004:(
			{"权重":650,"物品":"234901","数量":"1","绑定":0},
			{"权重":250,"物品":"234903","数量":"1","绑定":0,"传闻":"RSA8003"},
			{"权重":100,"物品":"234902","数量":"1","绑定":0,"传闻":"RSA8004"},
		),
	}

	groupInfo = {
		9001:(1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015,1016,1017,1018,1019,1020,),
		9002:(1040,1130,1060,1140,),
		9003:(1040,1130,1060,1140,),
		9004:(1006,1007,1008,1009,1010,),
	}

	chatInfo = {
		1001:'''今天的秘册任务已经全部完成''',
		1002:'''恭喜你！你获得了月儿岛秘径图，月儿岛现世时间有限，请尽快完成！''',
		1003:'''秘册任务不可组队战斗''',
		1004:'''这位仙友，我算出有秘册与你有缘，只是已落在他人手中''',
		1005:'''哼，这秘册还是与我比较有缘''',
		1006:'''*3*这秘册我好不容易才找到，可恶……''',
		1007:'''*3*你、你、你给我等着瞧！''',
		1008:'''*3*…………（阴森森地看着你）''',
		1009:'''*3*好、好，你们正道夺人财物的借口还真是一样的''',
		1010:'''*3*有什么是与你们没缘的吗？！''',
		2001:'''有缘人，我赠你月儿岛#C04珍宝#n一件，请有缘人切勿贪心，以免遭受不测\nQ#C04继续寻宝#n\nQ取宝就走''',
		2002:'''有缘人，你实力确实不错，然而我连山却也出身蜀山正宗这样吧，拿一件#C04稀宝#n便回去，如何？\nQ#C04继续寻宝#n\nQ取宝就走''',
		2003:'''我月儿岛#C04秘宝#n就赐予你吧，有缘人，切勿过于贪婪啊！\nQ#C04继续寻宝#n\nQ取宝就走''',
		2004:'''呵呵呵，果然是我月儿岛#C04秘宝#n有缘人，那就赐予你吧''',
		2005:'''唔，难道真是人定胜天？我连山的#C04镇山之宝#n，只能赐予你了''',
		2006:'''哼！月儿岛只容有缘人进去，你怎么能呼朋引伴而来？！\n#C04（该任务不得组队进行）#n''',
		2007:'''受到教训了吧？所以说切勿贪心，你还是选择拿#C04珍宝#n走吧''',
		2008:'''受到教训了吧？所以说切勿贪心，你还是选择拿#C04稀宝#n走吧''',
		2009:'''受到教训了吧？所以说切勿贪心，你还是选择拿#C04秘宝#n走吧''',
		8001:'''领到秘册任务，快去完成吧！''',
		8002:'''已领取月儿岛取宝任务！''',
		8003:'''#C01$roleName#n在探索月儿岛第二关时，幸运地获得了$lnkProps''',
		8004:'''#C01$roleName#n在探索月儿岛第三关时，幸运地获得了$lnkProps''',
		8005:'''秘册消息只与你有缘，请你勿把消息告诉给其他人。\n#C04（该任务不得组队进行）#n''',
	}

	branchInfo = {
		1001:(
			{"条件":0,"脚本":"R2003,D2004,DONE,DEFF"},
			{"条件":40,"脚本":"E(0,2005),SB2003"},
		),
	}

	fightInfo = {
		1001:(
			{"类型":1,"名称":"$npc","造型":"$npc","能力编号":"1001","数量":"1","技能":(1112,1212,1312,)},
			{"类型":0,"名称":"妖道","造型":"4001(0,1,0,0,0)","能力编号":"1002","数量":"2","技能":(5401,5406,)},
			{"类型":0,"名称":"妖兽","造型":"3004(0,1,0,0,0)","能力编号":"1003","数量":"2","技能":(5412,5417,)},
		),
		2001:(
			{"类型":1,"名称":"铜守卫","造型":"4001(0,1,0,0,0)","能力编号":"1004","数量":"1","技能":(1121,1221,1321,)},
			{"类型":0,"名称":"守卫喽啰","造型":"1211(1,1,1,1,1)","能力编号":"1005","数量":"1","技能":(1213,)},
			{"类型":0,"名称":"守卫喽啰","造型":"1111(1,1,1,1,1)","能力编号":"1006","数量":"1","技能":(1113,1313,)},
			{"类型":0,"名称":"守卫喽啰","造型":"4509(0,1,0,0,0)","能力编号":"1007","数量":"1","技能":(1421,)},
			{"类型":0,"名称":"守卫喽啰","造型":"4004(0,1,0,0,0)","能力编号":"1008","数量":"1","技能":(1611,1621,)},
		),
		2002:(
			{"类型":1,"名称":"银守卫","造型":"4001(0,1,0,0,0)","能力编号":"1009","数量":"1","技能":(1122,1222,1322,)},
			{"类型":0,"名称":"守卫喽啰","造型":"1211(1,1,1,1,1)","能力编号":"1010","数量":"1","技能":(1212,)},
			{"类型":0,"名称":"守卫喽啰","造型":"1121(1,1,1,1,1)","能力编号":"1011","数量":"1","技能":(1112,1312,)},
			{"类型":0,"名称":"守卫喽啰","造型":"4509(0,1,0,0,0)","能力编号":"1012","数量":"1","技能":(1421,1422,)},
			{"类型":0,"名称":"守卫喽啰","造型":"4004(0,1,0,0,0)","能力编号":"1013","数量":"1","技能":(1611,1621,1623,)},
		),
		2003:(
			{"类型":1,"名称":"金守卫","造型":"4001(0,1,0,0,0)","能力编号":"1014","数量":"1","技能":(1123,1212,1323,)},
			{"类型":0,"名称":"守卫喽啰","造型":"1221(1,1,1,1,1)","能力编号":"1015","数量":"1","技能":(1212,1231,1232,1233,)},
			{"类型":0,"名称":"守卫喽啰","造型":"1311(1,1,1,1,1)","能力编号":"1016","数量":"1","技能":(1333,1332,1132,1133,)},
			{"类型":0,"名称":"守卫喽啰","造型":"4509(0,1,0,0,0)","能力编号":"1017","数量":"1","技能":(1421,1422,1423,1431,)},
			{"类型":0,"名称":"守卫喽啰","造型":"1611(0,1,1,1,1)","能力编号":"1018","数量":"1","技能":(1611,1621,1623,1633,)},
		),
	}

	ableInfo = {
		1001:{"等级":"LV","生命":"B*1.13","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1002:{"等级":"LV","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.65","法术伤害":"B*0.45","物理防御":"B*0.56","法术防御":"B*0.39","速度":"B*0.72","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1003:{"等级":"LV","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.45","法术伤害":"B*0.65","物理防御":"B*0.39","法术防御":"B*0.56","速度":"B*0.72","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1004:{"等级":"LV","生命":"B*0.9","真气":"B*1","物理伤害":"B*0.97","法术伤害":"B*0.97","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1005:{"等级":"LV","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.81","物理防御":"B*0.49","法术防御":"B*0.7","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1006:{"等级":"LV","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.56","物理防御":"B*0.7","法术防御":"B*0.49","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1007:{"等级":"LV","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.81","法术伤害":"B*0.81","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*1.02","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1008:{"等级":"LV","生命":"B*0.75","真气":"B*1","物理伤害":"B*0.56","法术伤害":"B*0.56","物理防御":"B*0.6","法术防御":"B*0.6","速度":"B*0.8","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1009:{"等级":"LV+1","生命":"B*1.02","真气":"B*1","物理伤害":"B*1.1","法术伤害":"B*1.1","物理防御":"B*0.82","法术防御":"B*0.82","速度":"B*1.09","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1010:{"等级":"LV+1","生命":"B*1.02","真气":"B*1","物理伤害":"B*0.76","法术伤害":"B*1.1","物理防御":"B*0.59","法术防御":"B*0.84","速度":"B*0.96","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1011:{"等级":"LV+1","生命":"B*1.02","真气":"B*1","物理伤害":"B*1.1","法术伤害":"B*0.76","物理防御":"B*0.84","法术防御":"B*0.59","速度":"B*0.96","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1012:{"等级":"LV+1","生命":"B*1.02","真气":"B*1","物理伤害":"B*1.1","法术伤害":"B*1.1","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*1.16","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1013:{"等级":"LV+1","生命":"B*1.02","真气":"B*1","物理伤害":"B*0.76","法术伤害":"B*0.76","物理防御":"B*0.72","法术防御":"B*0.72","速度":"B*0.96","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1014:{"等级":"LV+2","生命":"B*1.17","真气":"B*1","物理伤害":"B*1.26","法术伤害":"B*1.26","物理防御":"B*0.94","法术防御":"B*0.94","速度":"B*1.25","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1015:{"等级":"LV+2","生命":"B*1.17","真气":"B*1","物理伤害":"B*0.87","法术伤害":"B*1.26","物理防御":"B*0.67","法术防御":"B*0.95","速度":"B*1.09","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1016:{"等级":"LV+2","生命":"B*1.17","真气":"B*1","物理伤害":"B*1.26","法术伤害":"B*0.87","物理防御":"B*0.95","法术防御":"B*0.67","速度":"B*1.09","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1017:{"等级":"LV+2","生命":"B*1.17","真气":"B*1","物理伤害":"B*1.26","法术伤害":"B*1.26","物理防御":"B*0.82","法术防御":"B*0.82","速度":"B*1.33","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
		1018:{"等级":"LV+2","生命":"B*1.17","真气":"B*1","物理伤害":"B*0.87","法术伤害":"B*0.87","物理防御":"B*0.82","法术防御":"B*0.82","速度":"B*1.09","物理抗性":0,"法术抗性":0,"攻击修炼":0,"物防修炼":0,"法防修炼":0},
	}

	lineupInfo = {
	}

	configInfo = {
		"生成路径":"map",
	}
#导表结束

	def onBorn(self, who, npcObj, **kwargs):
		if kwargs.get("npcIdx"):
			self.set("npcIdx", kwargs["npcIdx"])
		customTask.onBorn(self, who, npcObj, **kwargs)

	def transIdxByGroup(self, idx):
		if idx != 9001:
			return customTask.transIdxByGroup(self,idx)

		npcIdx = self.fetch("npcIdx",0)
		lst = list(self.getGroupInfo(idx))
		if npcIdx:
			lst.remove(npcIdx)
		return lst[rand(len(lst))]

	def transNpcInfo(self, npcIdx, info, who=None):
		if "$pos" in info["位置"]:
			info["位置"] = self.createRandPos(who)
		
		return customTask.transNpcInfo(self, npcIdx, info, who)
	
	def createRandPos(self, who):
		if self.id == task.map.TASK_MAP_PARENT_ID:
			#随机场景，去除上一任务的场景
			lastScene = who.day.fetch("mapts", 0)
			lst = list(self.getGroupInfo(9002))
			if lastScene and lastScene in lst:
				lst.remove(lastScene)
			sceneId = lst[rand(len(lst))]
			who.day.set("mapts", sceneId)
			x, y = scene.randSpace(sceneId)
			return "%d,%d,%d,0" % (sceneId, x, y)
		else:
			sceneId = self.transIdxByGroup(9002)
			x, y = scene.randSpace(sceneId)
			return "%d,%d,%d,0" % (sceneId, x, y)
	
	def onMissionDone(self, who, npcObj):
		if self.id == task.map.TASK_MAP_PARENT_ID:
			ring = who.day.add("mapRing", 1)
			perPoint = activity.center.getPerActPoint(3)
			who.addActPoint(perPoint)
			if ring < 10:  # 自动给下一环
				taskObj = task.newTask(who, npcObj, self.id ,npcIdx=npcObj.idx)
				gevent.spawn(task.goAhead,who.id,taskObj.id)
			else:
				self.doScript(who, npcObj, "R1002")
				if hasattr(self, "extraReward"):
					self.doScript(who, None, "DL1002")
				else:
					self.doScript(who, npcObj, "DL1001")
				
	def customRewardProps(self, who, propsNo, amount, binded, *args, **kwargs):
		if propsNo == "202008": # 特殊道具
			self.extraReward = True
		return 0
	
	def validDoEventScript(self, who, npcObj, key):
		if key in ("点击", "回复"):
			if not who.isSingle():
				if self.parentId == task.map.TASK_MAP_PARENT_ID:
					self.doScript(who, npcObj, "D1003")
				else:
					self.doScript(who, npcObj, "D2006")
				return 0
		return customTask.validDoEventScript(self, who, npcObj, key)

	def getValueByVarName(self, varName, who):
		if varName == "R":
			return who.day.fetch("mapRing")+1
		return customTask.getValueByVarName(self, varName, who)

from common import *
import scene
import task
import task.service
import task.map
import activity.center
import gevent