序号	名称	伙伴_T	1级羁绊	2级羁绊	3级羁绊	4级羁绊	5级羁绊	描述
1	势不两立	1001,1002	生命上限:141	生命上限:216	生命上限:291	生命上限:366	生命上限:441	羁绊1
2	前辈高人	4001,2002	物理伤害:31	物理伤害:62	物理伤害:94	物理伤害:125	物理伤害:156	羁绊2
3	青梅竹马	4002,3001	生命上限:97	生命上限:194	生命上限:291	生命上限:388	生命上限:485	羁绊3
4	仙姿玉色	2001,5001	速度:30	速度:41	速度:52	速度:63	速度:74	羁绊4
5	嫉恶如仇	1002,4002,5002	抵抗封印:17	抵抗封印:39	抵抗封印:60	抵抗封印:82	抵抗封印:104	羁绊5
6	后起之秀	3001,3002,5002	物理防御:23|法术防御:23	物理防御:52|法术防御:52	物理防御:82|法术防御:82	物理防御:111|法术防御:111	物理防御:141|法术防御:141	羁绊6
7	恶贯满盈	2001,1001,2002	抵抗封印:24	抵抗封印:43	抵抗封印:61	抵抗封印:80	抵抗封印:99	羁绊7
