道具编号	名称	绑定	出售价格	回收价格	炼化灵气	叠加上限	效果	服务端描述	使用1	使用2
220001	乌麻饼	0	0	0	0	1	生命:2000		1	
220002	罗汉上素	0	0	0	10	1	生命:PL*60+2000	[功效]生命恢复=$hp	1	
220003	黄精炖蛋	0	0	0	10	1	真气:PL*60+2000	[功效]真气回复=$mp	1	
220004	冰糖仙莲	0	0	0	10	1	寿命:PL*0.5+10	[功效]增加异兽寿命=$life	1	
220005	枸杞巴戟酒	0	0	0	10	1	愤怒1:PL*0.4+10,愤怒2:PL*0.6+10	[功效]战斗内愤怒恢复=$sp1，战斗外愤怒恢复=$sp2	1	1
220006	八珍玉食	0	0	0	10	1	生命:PL*0.4+10,真气:PL*32+1000	[功效]生命恢复=$hp，真气恢复$mp	1	
220007	牛奶茯苓霜 	0	0	0	10	1	寿命:PL*2+50	[功效]增加异兽寿命=$life	1	
220008	玉液琼浆	0	0	0	10	1	愤怒1:PL*1	[功效]战斗内恢复愤怒=$sp1，并降低3-4回合物法防御力		1
220009	帝王浆	0	0	0	10	1	符能:PL*0.6+10	[功效]战斗内符能恢复=$fn		1
