编号	名称	类型	法术_T	评分	五行	作用目标	作用人数_E	最大作用人数	持续回合_E	最大持续回合	准备回合	冷却回合	伤害_E	威力	真气消耗_E	愤怒消耗_E	符能消耗_E	符能回复_E	buff	命中率_E	技能效果_S	法术效果_S	配置数据_S
5101	锋锐	无	5101	90																	phyCrit:10
5102	灵犀	无	5102	90																	magCrit:10
5103	悍勇	无	5103	60																	phyDam:LV*0.6
5104	天机	无	5104	60																	magDam:LV*0.6
5105	重甲	无	5105	60																	phyDef:LV*0.8
5106	灵护	无	5106	60																	magDef:LV*0.8
5107	蹈风	无	5107	60																	spe:LV*0.6
5108	增寿	无	5108	60																	hpMax:LV*2.5+30
5109	无定	无	5109	90
5110	无界	无	5110	90
5111	封盾	无	5111	60
5112	叠刃	无	5112	90																			概率:30|伤害:40
5113	连珠	无	5113	90
5114	不意	无	5114	90																			概率:40|伤害:30
5115	镜反	无	5115	90																			概率:30|伤害:25
5116	杀戮	无	5116	90																			伤害:70
5117	连斩	无	5117	90																			概率:40|伤害结果:-15%
5118	反击	无	5118	90																			概率:30
5119	吸血	无	5119	60																			生命:20
5120	刺甲	无	5120	60																			反弹概率:50|伤害率:20
5121	无畏	无	5121	30																		免疫反弹	物理伤害结果:5%
5122	披靡	无	5122	60					3										220
5123	迅捷	无	5123	60					3										221
5124	护佑	无	5124	60					3										222
5125	坚韧	无	5125	30																		免疫暴击	概率:6
5126	化生	无	5126	30																			生命:12|上限:LV*6
5127	唤灵	无	5127	30																			符能:15
5128	隐匿	无	5128	60					3										223
5129	逆境	无	5129	90																			伤害:3%|次数限制:3
5130	复生	无	5130	90																			概率:0.6*LV/con|生命:60|限制:(10,20)
5131	禁神	无	5131	60																		破神	伤害结果:25%
5132	破封	无	5132	60																			概率:60
5133	慧眼	无	5133	60																		破隐	概率:30
5134	震慑	无	5134	90					2										224				概率:(mag-10)/(LV+1)
5135	眩晕	无	5135	90					1										225				概率:(str-10)/(LV+1)
5136	清心	无	5136	90																			概率:7-(con-10)/(LV+1)
5137	大义	无	5137	60																		禁止逃跑	概率:6
5138	不死	无	5138	90																			概率:25
5139	回生	无	5139	60																			生命:15
5140	益气	无	5140	60																			真气:15
5141	妙法	无	5141	60																			概率:10|符能:5
5142	乘胜	无	5142	60																			伤害率:70
5143	怒火	无	5143	30																			愤怒:15
5144	汇灵	无	5144	60																			符能:20
5145	甲木	无	5145	30																			概率:20
5146	丙火	无	5146	30																			概率:20
5147	戊土	无	5147	30																			概率:20
5148	辛金	无	5148	30																			概率:20
5149	壬水	无	5149	30																			概率:20
5150	缠身	无	5150	60																	speRatio:-20
5151	冥思	无	5151	30
5152	续断	无	5152	30
5153	舍身	无	5153	60																			伤害:LV*3+10
5201	高级锋锐	无	5201	150																	phyCrit:20
5202	高级灵犀	无	5202	150																	magCrit:20
5203	高级悍勇	无	5203	120																	phyDam:LV
5204	高级天机	无	5204	120																	magDam:LV
5205	高级重甲	无	5205	120																	phyDef:LV*1.2
5206	高级灵护	无	5206	120																	magDef:LV*1.2
5207	高级蹈风	无	5207	120																	spe:LV
5208	高级增寿	无	5208	120																	hpMax:LV*5+60
5209	高级无定	无	5209	150
5210	高级无界	无	5210	150
5211	高级封盾	无	5211	120
5212	高级叠刃	无	5212	150																			概率:30|伤害:50
5213	高级连珠	无	5213	150
5214	高级不意	无	5214	150																			概率:50|伤害:30
5215	高级镜反	无	5215	150																			概率:40|伤害:25
5216	高级杀戮	无	5216	150																			伤害:80
5217	高级连斩	无	5217	150																			概率:40|伤害结果:-15%
5218	高级反击	无	5218	150																			概率:40
5219	高级吸血	无	5219	120																			生命:30
5220	高级刺甲	无	5220	120																			反弹概率:50|伤害率:30
5221	高级无畏	无	5221	90																		免疫反弹	物理伤害结果:10%
5222	高级披靡	无	5222	120					3										240
5223	高级迅捷	无	5223	120					3										241
5224	高级护佑	无	5224	120					3										242
5225	高级坚韧	无	5225	90																		免疫暴击	概率:10
5226	高级化生	无	5226	90																			生命:20|上限:LV*6
5227	高级唤灵	无	5227	90																			符能:25
5228	高级隐匿	无	5228	120					RND(3,5)										243
5229	高级逆境	无	5229	150																			伤害:5%|次数限制:3
5230	高级复生	无	5230	150																			概率:0.6*LV/con|生命:100|限制:(10,20)
5231	高级禁神	无	5231	120																		破神	伤害结果:35%
5232	高级破封	无	5232	120																			概率:100
5233	高级慧眼	无	5233	120																		破隐	概率:50
5234	高级震慑	无	5234	150					2										244				概率:(mag-10)/(LV+1)*2
5235	高级眩晕	无	5235	150					1										245				概率:(str-10)/(LV+1)*2
5236	高级清心	无	5236	150																			概率:10-(con-10)/(LV+1)
5237	高级大义	无	5237	120																		禁止逃跑	概率:10
5238	高级不死	无	5238	150																			概率:40
5239	高级回生	无	5239	120																			生命:25
5240	高级益气	无	5240	120																			真气:25
5241	高级妙法	无	5241	120																			概率:10|符能:15
5242	高级乘胜	无	5242	120																			伤害率:100
5243	高级怒火	无	5243	90																			愤怒:25
5244	高级汇灵	无	5244	120																			符能:30
5245	高级甲木	无	5245	90																			概率:30
5246	高级丙火	无	5246	90																			概率:30
5247	高级戊土	无	5247	90																			概率:30
5248	高级辛金	无	5248	90																			概率:30
5249	高级壬水	无	5249	90																			概率:30
5250	高级缠身	无	5250	120																	speRatio:-30
5251	高级冥思	无	5251	90
5252	高级续断	无	5252	90
5253	高级舍身	无	5253	120																			伤害:LV*5+10
5301	灵草冥毒	无	5301	0					2										401		phyDamRatio:10	
5302	龟甲秘术	无	5302	0																	magDamRatio:10
5304	无冬之眠	无	5304	0																			回合:3|生命值:20
5305	振翅扶摇	无	5305	0																			增加目标数:1
5306	龙卷蛇盘	无	5306	0																			反击概率:50
5307	怒打乾坤	无	5307	0
5309	凤舞回元	无	5309	0																	speRatio:15		转化伤害:10
5312	天狐媚术	无	5312	0					2												lifeRatio:10
5313	散魂蝎毒	无	5313	0					2										406				概率:20
5318	百花庇护	无	5318	0																		免疫暴击
5319	忠诚之心	无	5319	0					99										405
5401	玄冰咒	魔法攻击	5401	30	水	敌方	1						LV*2+20	100	30
5402	地火咒	魔法攻击	5402	30	火	敌方	1						LV*2+20	100	30
5403	崩岩咒	魔法攻击	5403	30	土	敌方	1						LV*2+20	100	30
5404	飘风咒	魔法攻击	5404	30	木	敌方	1						LV*2+20	100	30
5405	天雷咒	魔法攻击	5405	30	金	敌方	1						LV*2+20	100	30
5406	冰天雪窑	魔法攻击	5406	60	水	敌方	LV/60+2						LV*2+20	100	50
5407	炼狱火海	魔法攻击	5407	60	火	敌方	LV/60+2						LV*2+20	100	50
5408	地裂天崩	魔法攻击	5408	60	土	敌方	LV/60+2						LV*2+20	100	50
5409	风卷残云	魔法攻击	5409	60	木	敌方	LV/60+2						LV*2+20	100	50
5410	雷惊电绕	魔法攻击	5410	60	金	敌方	LV/60+2						LV*2+20	100	50
5411	冰刺	物理近攻	5411	30	水	敌方	1						LV*2+20	100	30
5412	流火	物理近攻	5412	30	火	敌方	1						LV*2+20	100	30
5413	裂地	物理近攻	5413	30	土	敌方	1						LV*2+20	100	30
5414	风刃	物理近攻	5414	30	木	敌方	1						LV*2+20	100	30
5415	震雷	物理近攻	5415	30	金	敌方	1						LV*2+20	100	30
5416	寒雪崩	物理远攻	5416	60	水	敌方	LV/60+2						LV*2+20	100	50
5417	燎原火	物理远攻	5417	60	火	敌方	LV/60+2						LV*2+20	100	50
5418	千岩戮	物理远攻	5418	60	土	敌方	LV/60+2						LV*2+20	100	50
5419	烈风斩	物理远攻	5419	60	木	敌方	LV/60+2						LV*2+20	100	50
5420	怒雷摧	物理远攻	5420	60	金	敌方	LV/60+2						LV*2+20	100	50
5501	死不瞑目	无	5501	0
5502	免疫封印	无	5502	0															501
5601	锄强扶弱	无	5601	60																		最高防御
5602	武林弟子	无	5602	60																		无视物理防御:10%
5603	守正僻邪	无	5603	60					2										301				概率:60|生命:3|生命上限:LV*5
5604	刚正不阿	无	5604	60
5605	天道莫名	无	5605	60
5606	酒剑双绝	无	5606	60
5607	明睛慧目	无	5607	60
5608	七矮之首	无	5608	60
5609	白骨锁魂	无	5609	60																			回复生命:10
5610	艳尸娘子	无	5610	60
5611	化血宝刀	无	5611	60																			生命值限制:50
5612	万蚕金钵	无	5612	60																			双倍概率:70|回复概率:30|生命:60
5613	金蚕蛊虫	无	5613	60
5614	不死元神	无	5614	60
5615	天魔噬焰	无	5615	60
5616	赤身教徒	无	5616	60
5617	缘起缘灭	无	5617	60																			生命:15|次数上限:3
5618	道法相济	无	5618	60																			概率:20|生命:50
5619	隐形剑诀	无	5619	60																			治疗结果:10%
5620	苦僧之徒	无	5620	60																			次数:1
5621	先圣之灵	无	5621	60																			回复生命:10
5622	佛门庇护	无	5622	60																			概率:50
5623	叛出峨眉	无	5623	60
5624	终成正果	无	5624	60
5625	正邪难辨	无	5625	60
5626	魔道乾坤	无	5626	60
5627	乾坤正气	无	5627	60
5628	正道领袖	无	5628	60
5629	唐门暗器	无	5629	60					2										301				概率:60|生命:3|生命上限:LV*5
5630	独门手法	无	5630	60																			概率:30
5631	明睛慧目	无	5631	60
5632	七矮之首	无	5632	60																			回合:3
5633	天魔噬焰	无	5633	60																			封印命中:20-HPR/5
5634	赤身教徒	无	5634	60																			概率:10
5635	幻波仙池	无	5635	60																		破隐	伤害:40%
5636	嫉恶如仇	无	5636	60																		速度:100%
5637	碧目天罗	无	5637	60
5638	索影晶盘	无	5638	60
5639	白骨锁魂	无	5639	60
5640	艳尸娘子	无	5640	60
5701	破命	魔法攻击	5701	0		敌方	3				2	3											伤害:(hpMaxV-210)*200/((21*VLV)+1)|伤害上限:VLV*10+10
5702	破力	魔法攻击	5702	0		敌方	3				2	3											伤害:(phyDamV-60)*200/((7.5*VLV)+1)|伤害上限:VLV*10+10
5703	破术	魔法攻击	5703	0		敌方	3				2	3											伤害:(magDamV-60)*200/((7.5*VLV)+1)|伤害上限:VLV*10+10
5704	破气	魔法攻击	5704	0		敌方	3				2	3											伤害:(phyDefV-40)*200/((4.5*VLV)+1)|伤害上限:VLV*10+10
5705	破魔	魔法攻击	5705	0		敌方	3				2	3											伤害:(magDefV-40)*200/((4.5*VLV)+1)|伤害上限:VLV*10+10
5706	破敏	魔法攻击	5706	0		敌方	3				2	3											伤害:(speV-40)*200/((3.5*VLV)+1)|伤害上限:VLV*10+10
5707	无敌	增益	5707	0		己方	99		1		2	4							901
5708	反伤	增益	5708	0		己方	99		1		2	4							902				反弹比例:50|反弹上限:VLV*30
5709	魅惑	减益	5709	0		敌方	2		1		2	4							903
5710	命疗	治疗	5710	0		己方	3				3	3											治疗:(hpMaxV-210)*200/((21*VLV)+1)|治疗上限:VLV*10+10
5711	力疗	治疗	5711	0		己方	3				3	3											治疗:(phyDamV-60)*200/((7.5*VLV)+1)|治疗上限:VLV*10+10
5712	术疗	治疗	5712	0		己方	3				3	3											治疗:(magDamV-60)*200/((7.5*VLV)+1)|治疗上限:VLV*10+10
5713	气疗	治疗	5713	0		己方	3				3	3											治疗:(phyDefV-40)*200/((4.5*VLV)+1)|治疗上限:VLV*10+10
5714	魔疗	治疗	5714	0		己方	3				3	3											治疗:(magDefV-40)*200/((4.5*VLV)+1)|治疗上限:VLV*10+10
5715	敏疗	治疗	5715	0		己方	3				3	3											治疗:(speV-40)*200/((3.5*VLV)+1)|治疗上限:VLV*10+10
5716	混乱	减益	5716	0		敌方	3		1		2	4							904
5717	强攻	增益	5717	0		己方	99		2		2	4							905
5718	混沌	魔法攻击	5718	0		敌方	3				2	3											玩家伤害:-50|非玩家伤害:50|伤害:hpBaseV*0.1
5719	阴阳	减益	5719	0		敌方	99		2		2	4							906				伤害:10
5720	加速	增益	5720	0		己方	99		3		1	4							907
5801	攻法修炼+1	无		0
5802	物防修炼+1	无		0
5803	法防修炼+1	无		0
5804	抗封修炼+1	无		0
5805	指挥攻法修炼+1	无		0
5806	指挥物防修炼+1	无		0
5807	指挥法防修炼+1	无		0
5808	指挥抗封修炼+1	无		0
5809	急速	无	5809	0																		速度:5%
5810	加速	无	5810	0																			速度:3%
5811	强力	无	5811	0																			物理伤害结果:3%|法术伤害结果:3%
5812	防护	无	5812	0																			被物理伤害结果:-3%|被法术伤害结果:-3%
5813	减伤	无	5813	0																			被物理伤害结果:-20|被法术伤害结果:-20
5814	指挥加速	无	5814	0																			速度:3%
5815	指挥强力	无	5815	0																			物理伤害结果:3%|法术伤害结果:3%
5816	指挥防护	无	5816	0																			被物理伤害结果:-3%|被法术伤害结果:-3%
5817	指挥减伤	无	5817	0																			被物理伤害结果:-20|被法术伤害结果:-20
5818	历练	无		0
5819	指挥历练	无		0
5820	封印	无	5820	0																			封印命中:3
5821	抗封	无	5821	0																			抵抗封印:3
5822	指挥生命	无		0
5823	真气	无		0
5824	治疗	无		0
5825	再生	无		0
5841	攻法修炼+2	无		0
5842	物防修炼+2	无		0
5843	法防修炼+2	无		0
5844	抗封修炼+2	无		0
5845	指挥攻法修炼+2	无		0
5846	指挥物防修炼+2	无		0
5847	指挥法防修炼+2	无		0
5848	指挥抗封修炼+2	无		0
5849	高级急速	无	5849	0																		速度:10%
5850	高级加速	无	5850	0																			速度:5%
5851	高级强力	无	5851	0																			物理伤害结果:5%|法术伤害结果:5%
5852	高级防护	无	5852	0																			被物理伤害结果:-5%|被法术伤害结果:-5%
5853	高级减伤	无	5853	0																			被物理伤害结果:-40|被法术伤害结果:-40
5854	高级指挥加速	无	5854	0																			速度:5%
5855	高级指挥强力	无	5855	0																			物理伤害结果:5%|法术伤害结果:5%
5856	高级指挥防护	无	5856	0																			被物理伤害结果:-5%|被法术伤害结果:-5%
5857	高级指挥减伤	无	5857	0																			被物理伤害结果:-40|被法术伤害结果:-40
5858	高级历练	无		0
5859	高级指挥历练	无		0
5860	高级封印	无	5860	0																			封印命中:5
5861	高级抗封	无	5861	0																			抵抗封印:5
5862	高级指挥生命	无		0
5863	高级真气	无		0
5864	高级治疗	无		0
5865	高级再生	无		0
5881	驯兽师	无	5881	0																			次数:1
5882	药王	无	5882	0																			次数:1
5883	阵法大师	无		0
5884	符师	无	5884	0																			符能:5
5885	暴击	无	5885	0																			法术暴击:5|物理暴击:5
5886	疾风	无	5886	0																			速度:5%
5887	冲击	无	5887	0																			物理伤害结果:5%|法术伤害结果:5%
5888	盾甲	无	5888	0																			被物理伤害结果:-5%|被法术伤害结果:-5%
5889	抵抗	无	5889	0																			被物理伤害结果:-40|被法术伤害结果:-40
5890	修行	无		0
5891	克制	无		0
6201	风雷弹	魔法攻击	6201	0		敌方	1						SLV*2+20	100									治疗:SLV*2+150|治疗威力:100|目标数:5
6202	万雷咒	魔法攻击	6202	0		敌方	5						SLV*2+20	100
6203	护卫何在	增益	6203	0		己方																	战斗编号:2001
6204	护卫何在	增益	6204	0		己方																	战斗编号:2002
6205	迷魂咒	封印	6205	0		敌方	1		2										109	100
6206	祸水滔天	魔法攻击	6206	0		敌方	5		1				SLV*2+20	100					109				目标生命比:50|概率:10+((100-HPRV)/8)
6207	小怪自爆	魔法攻击	6207	0		敌方	20																伤害率:20%
6208	斩仙御剑术	魔法攻击	6208	0		敌方	3						hpMaxV*0.3	100					921
6401	物理减伤	无	6401	0															506			被物理伤害结果:-50%
6402	法术减伤	无	6402	0															507			被法术伤害结果:-50%
6403	吸血	无	6403	0																			生命:40
6404	降治疗	无	6404	0					2										514
6405	碧目天罗	无	6405	0					2										109				概率:10
6406	金臂行者	无	6406	0															915				特殊状态:908
6407	桑木仙姥	无	6407	0																			特殊状态:909
6408	沧浪羽士	无	6408	0																			特殊状态:910|回复:50%
6409	赤霞神君	无	6409	0		己方		1											916				特殊状态:911
6410	戊土道人	无	6410	0		敌方		1											917				特殊状态:912
6411	天罗子	无	6411	0															923				特殊状态:913
6412	沧浪羽士	无	6412	0																			特殊状态:914|回复:30%
6413	百分比扣血	无	6413	0																			伤害率:5%
6414	百分比扣蓝	无	6414	0																			伤害率:3%
6415	物免回血	无	6415	0																			回血率:60%
6416	魔免回血	无	6416	0																			回血率:60%
6417	恒山君分身	无	6417	0
6418	分身强制扣1血	无	6418	0																			伤害:1
6419	治疗仙术	无	6419	0															918				生命:10
6420	百毒真经	无	6420	0															919				生命:10
6421	妖莲幻术	无	6421	0					2										920				目标buff:922