编号	行动目标	一键喊话频道_T	目标类型（0:单选 1:等级）	活动等级	活动时间类型	活动开始时间	活动结束时间	可选目标	可选范围1	可选范围2	默认选择范围
1	降魔任务	31	1	15	$NONE$	$NONE$	$NONE$	1	20	29	20,29
								2	30	39	30,39
								3	40	49	40,49
								4	50	59	50,59
								5	60	69	60,69
2	主线剧情	31	0	0	$NONE$	$NONE$	$NONE$	1	第一章	$NONE$	0,10
								2	第二章	$NONE$	11,20
5	封妖任务	31	0	15	$NONE$	$NONE$	$NONE$	1	峨嵋山封妖	$NONE$	15,30
								2	青螺竹林封妖	$NONE$	25,40
								3	锁妖塔外封妖	$NONE$	35,50
								4	莽苍山封妖	$NONE$	45,60
								5	凌云大佛封妖	$NONE$	60,70
6	门派试炼	31	1	40	2	1,3	$NONE$	1	40	49	40,49
								2	50	59	50,59
								3	60	69	60,69
								4	70	79	70,79
								5	80	89	80,89
								6	90	99	90,99
7	魔教入侵	4	0	30	$NONE$	$NONE$	$NONE$	1	魔教入侵	$NONE$	30,99
8	每周活动	31	0	99	2	1,3,5	$NONE$	1	每周1 3 5活动	$NONE$	0,60
9	具体日子	31	0	99	3	2016,6,1,0,0	2016,6,1,24,0	1	六一儿童节	$NONE$	0,60
10	隔星期活动	31	0	99	4	1	$NONE$	1	单周1 3 5	$NONE$	0,60
								2	单周1 3 5	$NONE$	61,70
11	隔星期活动	31	0	99	4	2	$NONE$	1	双周2 4 6	$NONE$	0,60
								2	双周2 4 6	$NONE$	61,70
12	每月活动	31	0	99	5	1	$NONE$	1	每月第一天活动	$NONE$	0,60
13	邪道煞星	31	1	30	1	10,00	24,00	1	30	59	30,59
								2	60	79	60,79
14	入世修行	31	0	50	$NONE$	$NONE$	$NONE$	1	入世修行	$NONE$	0,79
101	竹林除妖	31	1	45	$NONE$	$NONE$	$NONE$	1	45	49	45,49
								2	50	59	50,59
								3	60	69	60,69
102	幻波池	31	1	55	$NONE$	$NONE$	$NONE$	1	55	59	55,59
								2	60	69	60,69
								3	70	79	70,79