活动ID	活动名称	经验公式_E	每轮次数	轮数	次数	转化率
1	降魔任务	LV*2*R+LV*10+1100	10	8		0.4
2	师门任务	(LV*32+40)*R+LV*400+1000	10	2		0.4
4	封妖	LV*300+1500			10	0.4
5	单人竞技场	LV*360+700			5	0.4
11	每日答题	LV*38+8000			10	0.4
16	竹林除妖	LV*1850+20000			1	0.4
17	天问初试	3500+(10+N*5)*LV	20	1		0.4
21	仙盟大战	LV*625+6250			1	0.4
22	幻波池	LV*2400+30000			1	0.4
23	邪道煞星	LV*1000+20000			3	0.4
24	组队竞技场	LV*600+60000			1	0.4
26	北斗七星	LV*272+24000			7	0.4
27	五岳帝君	LV*500+25000			5	0.4
102	魔教入侵	LV*85+900			10	0.4
25	门派试炼	LV*2037+52500			1	0.4
28	仙盟迷宫	LV*500+45000			1	0.4
