编号	条件	物品	效果
101	1111	100001	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,力量:8,打造:1
	1121	100051	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,力量:8,打造:1
	1211	100101	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,法力:8,打造:1
	1221	100151	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,法力:8,打造:1
	1311	100201	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,力量:8,打造:1
	1321	100251	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,力量:8,打造:1
	1411	100301	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,法力:8,打造:1
	1421	100351	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,法力:8,打造:1
	1511	100401	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,法力:8,打造:1
	1521	100451	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,法力:8,打造:1
	1611	100501	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,法力:8,打造:1
	1621	100551	物理伤害:94,法术伤害:94,治疗强度:47,封印命中:120,法力:8,打造:1
102	1	101001	抵抗封印:60,物理防御:10,真气上限:55,打造:1
	2	101101	抵抗封印:60,物理防御:10,真气上限:55,打造:1
103	1	101201	物理防御:10,生命上限:64,体质:8,打造:1
	2	101301	物理防御:10,生命上限:64,体质:8,打造:1
201	1111	100002	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,力量:11,打造:1
	1121	100052	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,力量:11,打造:1
	1211	100102	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,法力:11,打造:1
	1221	100152	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,法力:11,打造:1
	1311	100202	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,力量:11,打造:1
	1321	100252	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,力量:11,打造:1
	1411	100302	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,法力:11,打造:1
	1421	100352	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,法力:11,打造:1
	1511	100402	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,法力:11,打造:1
	1521	100452	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,法力:11,打造:1
	1611	100502	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,法力:11,打造:1
	1621	100552	物理伤害:158,法术伤害:158,治疗强度:79,封印命中:180,法力:11,打造:1
202	1	101002	抵抗封印:90,物理防御:16,真气上限:95,打造:1
	2	101102	抵抗封印:90,物理防御:16,真气上限:95,打造:1
203	1	101202	物理防御:16,生命上限:96,体质:11,打造:1
	2	101302	物理防御:16,生命上限:96,体质:11,打造:1
301	1111	100003	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,力量:14,打造:1
	1121	100053	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,力量:14,打造:1
	1211	100103	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,法力:14,打造:1
	1221	100153	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,法力:14,打造:1
	1311	100203	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,力量:14,打造:1
	1321	100253	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,力量:14,打造:1
	1411	100303	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,法力:14,打造:1
	1421	100353	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,法力:14,打造:1
	1511	100403	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,法力:14,打造:1
	1521	100453	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,法力:14,打造:1
	1611	100503	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,法力:14,打造:1
	1621	100553	物理伤害:222,法术伤害:222,治疗强度:111,封印命中:240,法力:14,打造:1
302	1	101003	抵抗封印:120,物理防御:23,真气上限:135,打造:1
	2	101103	抵抗封印:120,物理防御:23,真气上限:135,打造:1
303	1	101203	物理防御:23,生命上限:128,体质:14,打造:1
	2	101303	物理防御:23,生命上限:128,体质:14,打造:1
401	1111	100004	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,力量:17,打造:1
	1121	100054	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,力量:17,打造:1
	1211	100104	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,法力:17,打造:1
	1221	100154	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,法力:17,打造:1
	1311	100204	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,力量:17,打造:1
	1321	100254	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,力量:17,打造:1
	1411	100304	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,法力:17,打造:1
	1421	100354	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,法力:17,打造:1
	1511	100404	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,法力:17,打造:1
	1521	100454	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,法力:17,打造:1
	1611	100504	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,法力:17,打造:1
	1621	100554	物理伤害:286,法术伤害:286,治疗强度:143,封印命中:300,法力:17,打造:1
402	1	101004	抵抗封印:150,物理防御:29,真气上限:175,打造:1
	2	101104	抵抗封印:150,物理防御:29,真气上限:175,打造:1
403	1	101204	物理防御:29,生命上限:160,体质:17,打造:1
	2	101304	物理防御:29,生命上限:160,体质:17,打造:1
501	1111	100005	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,力量:20,打造:1
	1121	100055	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,力量:20,打造:1
	1211	100105	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,法力:20,打造:1
	1221	100155	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,法力:20,打造:1
	1311	100205	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,力量:20,打造:1
	1321	100255	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,力量:20,打造:1
	1411	100305	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,法力:20,打造:1
	1421	100355	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,法力:20,打造:1
	1511	100405	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,法力:20,打造:1
	1521	100455	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,法力:20,打造:1
	1611	100505	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,法力:20,打造:1
	1621	100555	物理伤害:350,法术伤害:350,治疗强度:175,封印命中:360,法力:20,打造:1
502	1	101005	抵抗封印:180,物理防御:36,真气上限:215,打造:1
	2	101105	抵抗封印:180,物理防御:36,真气上限:215,打造:1
503	1	101205	物理防御:36,生命上限:192,体质:20,打造:1
	2	101305	物理防御:36,生命上限:192,体质:20,打造:1
601	1111	241406	
	1121	241456	
	1211	241506	
	1221	241556	
	1311	241606	
	1321	241656	
	1411	241706	
	1421	241756	
	1511	241806	
	1521	241856	
	1611	241906	
	1621	241956	
