编号	内容_S
1001	身体已无恙？唔，不愧是福缘深厚之人。只可惜另一人被灭尘子捞走，始终追不回。
	怎么回事
1002	身体回复了？唔，我们唐家医术可以信赖。只可惜另一人被邪魔捞走，始终追不回。
	怎么回事
1003	哈哈，醒了么？唔，不愧是福缘深厚的人。只可惜另一人被邪魔捞走，始终追不回。
	怎么回事
1004	嘿！身体无恙了？不愧是福缘深厚之人啊。只可惜另一人被邪魔捞走，始终追不回，你也不要伤心了。
	怎么回事
1005	好了么。唔，得本尊救治，你怎么也死不去的。不过另一人被那老小子捞走，追不回咯。
	怎么回事
1006	阿弥陀佛，施主醒过来了？感觉诸天保佑福。只可惜另一人被我们佛门不肖门徒捞走，始终追不回。
	怎么回事
1007	#C01$N#n慢着，你的武器我帮你捡回来了，接着你想怎么办？
	纠缠拜师
	保护难民
1013	你还是先缓缓吧，我一不肖师弟，作出了欺师灭祖的事，伤透了师傅的心，他不会再收徒弟了，你还是赶快去找那些难民吧。
1014	嗯，只能这样。因为我一不肖师弟，作出了欺师灭祖的事，伤透了师傅的心，他不会再收徒弟的了。
1015	啊、啊，小绿很温顺的，它不会伤害我的。
	何事？
1016	小袁不要担心，这异兽是恩公的，我又怎么会伤害它，只是……
1017	咻……咻咻……
1018	#C01$N#n$SEX3，我们暂时在这个村子里落脚呢……
	前方有事
1019	那就好那就好，啊啊，我、我不是讨厌恩公的异兽。
1020	啊哈！#C01$N#n$SEX1，我们这群人真的承你恩惠了！这些是老朽昔日收藏起来的#C04装备#n，就赠你吧！对了，大伙集中在村中央，有请你和你的同伴过去呢！
1021	……盖均无贫，和无寡，安无倾。夫如是……
1022	张夫子的意思是说很欢迎$SEX1你留下。
1023	#C01$N#n$SEX1，不知你意下如何？
	留下
	拒绝
1024	当真？！#C01$N#n$SEX1，这样一来……\t怎么这么吵闹……啊！村口有事情发生！
1025	你感受到村民们的热情
1026	这样吗？#C01$N#n$SEX1你再考虑一下吧？\t怎么这么吵闹……啊！村口有事情发生！
1027	你感受到村民们的失望
1028	嘶嘶呀呀！（妖物往着村子冲来）
	奋力抵抗
1029	嘶嘶！
1030	咧啊！
1031	师兄这般说法……看来蔽派与你有缘，为师就正式收你为徒吧！
	拜见师父
1032	嗯，本派以道家心法为主，但不拒儒释两家，汝要好好修炼，他日光大蜀山。
1033	唔，醉先生这番话有理……你不是我们唐门血脉，所以为师就先收你为记名弟子，你愿意吗？
	弟子愿意
1034	好好，你虽为记名弟子，但天资不错，他日定有超登堂甚至入室弟子的机会，好好把握吧。
1035	醉师傅教训得是……这样吧，武林盟是众多门派结盟而成，为师只能以师门林家堡收你为徒，如何？
	仅听吩咐
1036	我们武林盟行事光明磊落，路有不平就要一声吼，记牢了。
1037	醉道人这话也对。你虽是外族，但我们苗疆从不吝啬，但你必须对万物与女娲娘娘起誓，从此不得做出有害于苗疆的事！
	愿意起誓
1038	好，那等会我们先参拜女娲娘娘，汉人那一套繁琐的拜师手续可以不理。
1039	哼，多管闲事的醉老头，不休他说，我尸毗又岂是因咽废食之人！来我麾下吧！
	遵命师父
1040	哼，你虽入本尊门下，但若有什么不合本尊心意的，本尊随时可以赶你出师门。
1041	阿弥陀佛，醉道友既然如此说，那么施主确与佛有缘，老衲无德，只暂且作你授业之师吧。
	多谢师父
1042	善哉善哉，一身入佛门，五蕴皆成空，阿弥陀佛。
1043	你已经正式加入$SH
1044	徒儿，不知不觉你已在为师门下修炼三月，你天资横溢，甚得本门剑法精粹，寻常妖人已不是你对手，可让为师放心你出门修行。\t*A*nA**SS*$S2S$出门修行？师父！你这意思是……\t*A齐漱溟A**S1111S*$S1S$二百年前万佛顶一战后，正邪气运逆转。神尼优昙大师算出一年后众生恐遭浩劫，为此正道各门尽出门人打探情由，你也必须为苍生出一份力。\t*A*nA**SS*$S2S$（啊，沈胜男他们出门修行，好像也是这个原因！）\n弟子遵命！弟子定当全力以赴，不负蜀山之名！
1045	#C01$N#n，虽然你只是唐门记名弟子，但这三个月来你勤练不倦，再加上天资出众，已得本门精粹，行走江湖也不失本唐门威名。\t*A*nA**SS*$S2S$行走江湖？师父！你这意思是……\t*A唐缺A**S1111S*$S1S$二百年前万佛顶一战后，正邪气运逆转。优昙大师算出一年后众生恐遭浩劫，为此正道各门尽出门人打探情由，我们唐门乃一隅大派，自然也要出一份力，不堕本门之名。\t*A*nA**SS*$S2S$（啊，沈胜男他们出门修行，好像也是这个原因！）\n弟子遵命！弟子定当全力以赴，不堕唐门之名！
1046	#C01$N#n，这三个月来你四处修行，辅助官军剿匪，实战中已得本门精粹，行走江湖也有自保之力。\t*A*nA**SS*$S2S$行走江湖？师父！你这意思是……\t*A林燕南A**S1111S*$S1S$二百年前万佛顶一战后，正邪气运逆转。神尼优昙算出一年后众生恐遭浩劫，为此正道各门尽出门人打探情由，我们武林盟人数众多，自然更加要负起责任四处打探。\t*A*nA**SS*$S2S$（啊，沈胜男他们出门修行，好像也是这个原因！）\n弟子遵命！弟子定当全力以赴！
1047	小徒儿，这三个月你潜心学习本苗族各种秘方，已能灵活运用，这样为师也放心你出寨修行。\t*A*nA**SS*$S2S$出寨修行？师父！你这意思是……\t*A鸠盘婆A**S1111S*$S1S$二百年前万佛顶一战后，正邪气运逆转。优昙老师太算出一年后众生恐遭浩劫，为此正道各门尽出门人打探情由，我们苗疆虽然地处一隅，但也必须肩负责任，保护族人，所以必须遣人外出打探。\t*A*nA**SS*$S2S$（啊，沈胜男他们出门修行，好像也是这个原因！）\n弟子听命！弟子定当全力以赴！
1048	#C01$N#n吾徒，三个月内掌握我魔宫秘法，总算有点天资，这样在外行走才不会落了本尊的脸。\t*A*nA**SS*$S2S$在外行走？师父！你这意思是……\t*A尸毗老人A**S1111S*$S1S$二百年前万佛顶一战后，正邪气运逆转。优昙算出一年后众生恐遭浩劫，为此各派尽出门人打探情由，我魔宫也凑个热闹吧，免得那些人还以为我们魔宫无能人出行。\t*A*nA**SS*$S2S$（啊，沈胜男他们出门修行，好像也是这个原因！）\n弟子听命！弟子定当全力以赴！不堕师父威名。
1049	#C01$N#n徒儿，你在三个月内已悟上乘佛法，在外行走时也可与众人参佛研法，有福于众人。\t*A*nA**SS*$S2S$在外行走？师父！你这意思是……\t*A白眉和尚A**S1111S*$S1S$二百年前万佛顶一战后，正邪气运逆转。优昙师太算出一年后众生恐遭浩劫，为此正道各派尽出门人打探情由，我佛门不落人后，自当全力避免这灾祸到来。\t*A*nA**SS*$S2S$（啊，沈胜男他们出门修行，好像也是这个原因！）\n弟子听命！弟子定当全力以赴！以卫苍生！
1050	#C01$N#n$SEX1，我曾经尾随一头妖物来到这里附近，我猜它们的老巢应该就在附近了
	我搜查一下
1051	………………\n（小人惊恐着）
	向前扑去
1052	#C01$N#n$SEX3，守着那边，别让它逃了！
1053	怎、怎么会这样……\t*A*nA**SS*$S2S$金蝉！发生什么事了？啊，这小人儿怎么好像受伤了，是你做的吗？\t*A齐金蝉A**S4001S*$S1S$怎么可能，但好像有魔物逮住小人儿……先不说了，#C01$N#n$SEX3，能拜托你找点药过来吗？小人儿还有气息！
1054	呀……#F<15>呀……#n#F<10>呀……#n
1055	哎呀……二姐很唠叨的，整天儿说道理，像个卫学老夫子一样。
1056	#F<10>呀……#n#F<15>呀……#n
1057	你问我为何上山？在下听闻蜀山一带多剑仙，正想上山求道问学，他日能造福苍生。\t*A*nA**SS*$S2S$这……最近这里有蛇妖作怪，你此时上山恐怕不是好时机。\t*A余英男A**S4504S*$S1S$我余英男岂是会被区区困难而吓倒之人，修道者便该是明知山有虎，偏向虎山行！\t*A*nA**SS*$S2S$冒昧问一句，兄台可是端午日午时出世之人？\t*A余英男A**S4504S*$S1S$嗯？正是，$SEX2可是在下旧识之人？\t*A*nA**SS*$S2S$蜀山长眉师祖果然神机妙算！事情是这样的……
1058	什么？！#C01$N#n$SEX2，你已经找到了端午之人？\t*A余英男A**S4504S*$S2S$正是在下，这位小姐放心，为了天下苍生，我余英男不惜赴汤蹈火，在所不辞！\t*A朱文A**S4001S*$S1S$太好了灵云姐！那现在就只等我布好九十九诛邪刀阵，再让这位余公子用如意神矛刺向妖蛇蛇头，那便大功告成了！\t*A齐灵云A**S4506S*$S2S$朱文妹子，万不能掉以轻心——$N$SEX2，还劳烦你走一趟，蛇窟里毒瘴甚重，余公子与你非我等久修炼之辈，还需要些药草防瘴。
1059	那位小姐，真、真是神仙中人。
1060	朱文妹子你来啦！太、太好了！
1061	餐霞师父让我带诛邪刀、如意神矛过来相助……唉，金蝉哥哥，你注意点，这么多人在。
1062	很好，就是这个，你和余……余大哥快点服下吧，我们去看看朱文妹子布置得如何。
1063	哎呀，不是这样啊，这套诛邪刀应该循北斗七星势，而不是紫薇势啊。
1064	嘶嘶……天下蚁民负奴，奴定以滔天洪水相报！
	向前迎击
1065	嘶嘶！可、可恶，奴被、被压千年，还未恢复过来，你们这群黄毛小儿，等着奴！\n#C09（美人蛇翻身逃跑）#n\t*A*nA**SS*$S2S$咦！余大哥怎么没用如意神矛刺蛇头，现、现在怎么办！\t*A朱文A**S4001S*$S1S$不必担心，餐霞师父的九九诛邪刀阵可没那么容易放它走，我们跟上去吧。
1066	#C01$N#n$SEX2！这、这怎么办好？
	赶去救人
	原地坚守
1067	金蝉等人觉得你天性善良
1068	金蝉等人觉得你道心坚定
1069	嘶嘶！可恶的臭家伙，胆敢侮辱奴！奴可是女娲之后，尊贵无比啊！
	向前斩杀
1070	喂，叫#C01$N#n的，你的武器我帮你捡回来了，接着你想怎么办？
	纠缠拜师
	保护难民
1071	哼，算你识货，知道唐门厉害，但你还是走吧。我大哥有一不肖徒弟，作出了欺师灭祖的事，伤透大哥的心，他不会再收徒弟了，你还是赶快去找那些难民吧。
1072	只能这样啦。因为我大哥一不肖徒弟，作出了欺师灭祖的事，伤透大哥的心，他不会再收徒弟了。
1073	慢着，#C01$N#n，你的武器老子帮你捡回来了，接着你想怎么办？
	纠缠拜师
	保护难民
1074	要加入武林盟不难，但要成为林老头的徒弟——还是走吧。林老头有一不肖徒弟，作出了欺师灭祖的事，伤透他的心，他不会再收徒弟了，你还是赶快去找那些难民吧。
1075	只能这样。因为林老头有一不肖徒弟，作出了欺师灭祖的事，伤透他的心，他不会再收徒弟了。
1076	过来，#C01$N#n，你的武器本姑娘帮你捡回来了，接着你想怎么办？
	纠缠拜师
	保护难民
1077	我们苗疆说要来就来啊？况且师父有一不肖徒弟，作出了欺师灭祖的事，伤透她的心，她不会再收徒弟了，你还是赶快去找那些难民吧。
1078	只能这样啦。因为师父有一不肖徒弟，作出了欺师灭祖的事，伤透她的心，她不会再收徒弟了。
1079	叫#C01$N#n的，先别走，你的武器我帮你捡回来了，接着你想怎么办？
	纠缠拜师
	保护难民
1080	大胆！魔宫岂是你这种凡人能耍赖的地方！其实嘛，师父有一不肖徒弟，作出了欺师灭祖的事，伤透他的心，他不会再收徒弟了，你还是赶快去找那些难民吧。
1081	只能这样啦。因为师父有一不肖徒弟，作出了欺师灭祖的事，伤透他的心，他不会再收徒弟了。
1082	阿弥陀佛，#C01$N#n施主，先别走，你的武器小僧帮你捡回来了，接着你想怎么办？
	纠缠拜师
	保护难民
1083	阿弥陀佛，本来无一物，何必惹尘埃，你还是回去吧。而且师父有一不肖徒弟，作出了欺师灭祖的事，伤透师父的心，师父不会再收徒弟了，你还是赶快去找那些难民。
1084	阿弥陀佛，只能如此。因为师父有一不肖徒弟，作出了欺师灭祖的事，伤透他的心，他不会再收徒弟了。
1501	为师找你回来正是有急事，近日为师接到本门五老之一#C09丁引#n师叔的飞剑传书，他说有一伙邪魔外道于天墉外#C09慈云寺#n聚集，似乎不怀好意。\t为师恐此事与一年后大灾难有关，特意令本门盟友三仙二老之一，#C09追云叟白谷逸#n召集正道门派于天墉#C09碧筠庵#n，共商大事。\t你代为师去一趟，匡扶正道，为师现赐你本门剑法，留意了！
1502	唔，回来得正好。本门近日接到蜀山五老之一#C09丁引#n剑侠的飞剑传书，他说有一伙邪魔外道于天墉外#C09慈云寺#n聚集，似乎不怀好意。\t蜀山已经派出三仙二老之一，#C09追云叟白谷逸#n召集正道门派于天墉#C09碧筠庵#n，共商大事。你虽为唐门记名弟子，但我亦视你如登堂、入室系弟子。\t现传你几手唐门秘术，到碧筠庵后助正道除魔，切勿堕了本门派名声。
1503	回来得很快嘛！正好为师有事要交待你。那个本盟近日接到蜀山五老之一#C09丁引#n大侠的飞剑传书，他说有一伙邪魔外道于天墉外#C09慈云寺#n聚集，似乎不怀好意。\t蜀山派出三仙二老之一，#C09追云叟白谷逸#n召集正道门派于天墉#C09碧筠庵#n，共商大事。我们武林盟当仁不让，理当遣人参与。\t为师现在传你几手武林盟各门派成名绝技，让你斩妖除魔更有优势。
1504	小徒儿，你回来正好，很可惜为师不能与你好好聚一下。为师近日接到蜀山五老之一#C09丁引#n侠士的飞剑传书，他说有一伙邪魔外道于天墉外#C09慈云寺#n聚集，似乎不怀好意。\t蜀山派出三仙二老之一，#C09追云叟白谷逸#n召集正道门派于天墉#C09碧筠庵#n，共商大事。我们苗疆虽然不常被中原人士所重视，但除魔之事不能不理。\t所以为师现在传你苗疆独门秘术，助你在天墉就算杀妖不成，至少也能保命回来。
1505	哼，正好有人来为本尊跑腿。本尊近日接到蜀山五老之一#C09丁引#n小子的飞剑传书，他说有一伙邪魔外道于天墉外#C09慈云寺#n聚集，似乎不怀好意。\t蜀山派出三仙二老之一，#C09追云叟白谷逸#n小老头召集正道门派于天墉#C09碧筠庵#n，共商大事。我们魔宫本不需理会此等闲事，但本尊觉得徒儿你见识多点大场面还是有益的。\t所以本尊现传你魔宫天魔秘法，你学成后自行下山，若做了丢了本尊面子的事，你便不需回来了。
1506	阿弥陀佛，徒儿回来正好。本门近日接到蜀山五老之一#C09丁引#n师父的飞剑传书，他说有一伙邪魔外道于天墉外#C09慈云寺#n聚集，似乎不怀好意。\t蜀山派出三仙二老之一，#C09追云叟白谷逸#n师父召集正道门派于天墉#C09碧筠庵#n，共商大事。我们佛门亦不必顾忌杀孽，要以雷霆手段，方显菩萨心肠。\t所以为师现传你大乘佛法，助你在天墉杀妖除魔，但也切记不可多作杀孽。
1507	是#C01$N#n$SEX3？！你们果然也来天墉了啦？！是与慈云寺有关吗？\t*A*nA**SS*$S2S$嗯，我这正在去碧筠庵路上——诶？！这、这不是那只小人儿？\t*A齐金蝉A**S4001S*$S1S$啊，你说芝仙啊？他虽然被妖蛇吸了不少精血，但多亏母亲以灵气灌溉，修为反而不降又涨呢！二姐说他与我有缘，让我带着他，也算是保护着他呢。\t*A芝仙A**S3006S*$S2S$呀呀！呀呀呀……呀呀。\n（芝仙兴奋地不知所云）\t*A齐金蝉A**S4001S*$S1S$诶诶！那边似乎有事情闹起来了，会不会是慈云寺的妖人出来害人？让小爷我去教训一下他们！
1508	呀呀？……呀呀。
1509	真是好胆！
	发生何事
1510	啊！是、是什么人？
1511	这王癞子为非作歹许多，很多人都很讨厌他了。
1512	光天化日，王癞子越来越大胆了。
1513	感谢各位前来碧筠庵听老头子说话，但还有几大门派的人尚未到齐，这会，先让我白老头讲述一下情况吧。昔日#C09血神子#n趁我蜀山峨嵋四九重劫大举入侵，被#C09长眉真人#n击杀后，\t他麾下#C09血神教#n就土崩瓦解，余孽逃去无踪，想不到多年后居然在#C09慈云寺#n再次聚集。\t我们这次目的就是要斩草除根，但慈云寺毕竟是佛门之地，此时还是先与佛门方丈#C09白眉禅师#n商量一下好，我们来讨论一下谁是通知的最好人选……
1514	哼！血神教余孽死心不足，某定不放过他们！
1515	一把火烧了慈云寺好了，不放过一个妖人！
1516	唔……$SEX1来老衲处所谓何事，老衲也猜到一二。
	这样做可否
	这样做对错
1517	哼，大胆妖人，只可惜小僧有法宝要炼，要不定出关杀他两个，死那一双。
1518	阿弥陀佛，我佛慈悲。慈云寺乃藏污纳垢之地，我佛门亦深感厌恶，只不过慈云寺附近多有该寺佃农，还望众剑仙出手时不要伤及无辜。
1519	白眉禅师感到一丝不安
1520	阿弥陀佛，我佛慈悲。$SEX1果有慈悲心肠及聪敏天资。六祖有云‘本来无一物，何处染尘埃’，心有魔，所以见魔。\t以怨报怨，怨不可止，还望$SEX1以大智慧，解干戈，救天地众生。
1521	白眉禅师感到一丝安慰
1522	啊，白老头太啰嗦了，还加上二姐在旁唠叨，碧筠庵比慈云寺更加不是人待的！
	金蝉？
1523	呀呀？嘿嘿嘿……呀呀。
1524	#C01$N#n$SEX3！太、太好了，我们去玩吧……快快，不要犹豫不决了，二姐在四处寻我，被她逮住了我耳朵可要遭罪！
1525	阿弥陀佛，可不能放过这些家伙！
	笑和尚？
1526	阿弥陀佛，别被给他们这些小慈悲欺骗到了，杀了他们是为了大义！
	杀
	不杀
1527	哼，小僧可没有你们这么优柔寡断，小僧自己去！
	追上去
1528	笑和尚很赞同你的做法
1529	笑和尚不认同你的做法
1530	唔，寺中香客确实麻烦，不过成大事不拘小节，必要时牺牲掉他们也可以……\n【会议还在继续】\t*A齐金蝉A**S4001S*$S2S$（怎么还在喋喋不休，师叔伯们太小心了，不就是一伙妖人余孽嘛！）\t*A笑和尚A**S4004S*$S2S$（金蝉说得对，我们蜀山岂会因为血神教那些旁门左道而踌躇不前——有了，我们仨闯慈云寺一趟如何？！）
1531	此时需周全为上，何不让武林盟下的高山舵、大江舵封锁慈云寺周边，以免有凡人误入？
1532	其他门派都是一伙俗人，不必他们，我们蜀山就足够动手！
1533	余公子不知道……诶！金蝉呢？这顽皮的家伙去哪儿了。
1534	至尊行踪神出鬼没，但估计这次定会前来助我们一臂之力，那些自诩正道的家伙，下场必定很惨，哈哈哈哈，善哉善哉！
1535	这次，怎么都该到我们修罗宫扬名立万了！
1536	最近蜀山、唐门等门派大肆派门人下山，不知所为何事，但必定没什么好事！哼，我们就送他们去西方一趟，挫一下那群不知天高地厚的家伙锐气！
	偷偷接近
1537	这一带燃烧了起来
1538	唉，若是老父回来，这片药圃或者能抢救得及……
	告之真相
	不告诉他
1539	按往日来算，老父应该回来多时了，怎么今日……\t*A*nA**SS*$S2S$其实，你父亲已经……\t*A齐金蝉A**S4001S*$S1S$【空中传音】#C01$N#n$SEX3！速来大殿！\t*A李英琼A**S1111S*$S2S$啊？这位$SEX4说什么？\t*A*nA**SS*$S1S$在下有急事告辞，他日再详谈！此处乃是非之地，你父亲已经不会回来，请兄弟你速速离开！
1540	按往日来算，老父应该回来多时了，怎么今日……\t*A*nA**SS*$S2S$或许你父亲遇上什么老熟人，暂时离开吧……\t*A齐金蝉A**S4001S*$S1S$【空中传音】#C01$N#n$SEX3！速来大殿！\t*A李英琼A**S1111S*$S2S$……老夫没多少朋友，会遇上谁呢……\t*A*nA**SS*$S1S$在下有急事告辞，他日再详谈！此处乃是非之地，你父亲已经不会回来，请兄弟你速速离开！
1541	支援？我是叫$SEX3你来看看这群脓包而已，玩腻了我们准备走吧？
	嗯，走吧
1542	可、可恶，这小鬼头那里来的！
1543	咳咳……看来庙里失火定是他干的好事！
1544	阿弥陀佛，老衲要他死无全尸！
1545	金蝉！你、你竟然和#C01$N#n一伙去慈云寺闹事？！你、你可知道那里聚集了很多妖人？\t*A齐金蝉A**S4001S*$S2S$是聚集了很多，不过大部分都是草包——啊，吴师伯你就别说我了，这一次笑和尚师兄也有去呀……诶，笑师兄呢？\t*A*nA**SS*$S1S$糟糕！刚刚开始就看不见笑和尚，难道他被困在了慈云寺？！\t*A白谷逸A**S4001S*$S2S$不需担心，笑和尚师承苦行头陀上仙，一式隐形剑诀就算不能全清妖氛，也能全身而退，或许有什么因缘留下了他而已。
1546	金蝉实在太、太……唔，齐道统的儿子，顽皮一点也是允许。
1547	金蝉！这种时刻怎么能任意离开？！
1548	那还唧唧歪歪怎么着，既然已经打草惊蛇了，那我们马上动身杀上慈云寺吧！
	所言甚是
	先不着急
1549	只是为何其他门派的人还未到齐。
1550	唔，不知道丁引师叔会否助我们一臂之力，他来去无踪，不喜欢听从师门号令。
1551	呼呼……六大门派果、果然人多势众，我明修罗就、就算受了重伤，也不会退一步！
	趁机突袭
1552	至、至尊……万……
1553	呼，混迹江湖始终太危险了，我想过了，打完这仗我就会乡下与表妹成亲。
	恭喜
	不能说这话
1554	你奉上了由衷的祝福
1555	为什么不能说？对啦，明天是我妹妹的生辰呢，我准备先去跟她庆祝。
	恭喜
	不能说这话
1556	你这人真奇怪。对了，老家寄来了我表妹的画卷，你要看一下吗？她很可爱的。
	不了
1557	你为他祈祷了冥福
1558	嘶呜……#F<25>呜#n
1559	这、这血兽好可怜，瑟瑟发抖的，但奴家又不能离开，怕它伤害别人或被别人伤害，如何是好……
1560	【这人已经没气了】
1561	【这兽已经没气了】
1562	你、你不要动他，要不我就砍你！
1563	不、不要动我，要不我兄弟就砍你！
1564	你们也、也一样，敢动我兄弟一根汗毛，我、我就劈你！
1565	我、我不动了，大伙坚持一会都散吧？都站了快一个时辰了……\t*A*nA**SS*$S2S$喂喂……
1566	明、明修罗……太、太可怕了……
1567	怎、怎么可能抵住了我、我们六大门派十、十几高手的围攻……
1568	我、我还能救……【吐血】
1569	#C01$N#n！事态紧急！之前小僧在寺庙里追踪一个形迹可疑的香客，但他非常机警，竟发现小僧的隐形，\t引着小僧远离慈云寺，就当小僧欲捉拿他之时他竟然不见了，只留下了一封信，信中说慈云寺之战是血神教的一个陷阱！\t*A*nA**SS*$S2S$陷阱？！难道说他们还有援军正要攻来？\t*A笑和尚A**S4004S*$S1S$非也，慈云寺乃血神教声东击西之计，他们真正目的是#C04碧筠庵#n！
1570	哈哈……咳咳，今天连战丁引等三个蜀山老小子，本尊是有点疲惫了，然而还不怕你们这些乳臭未干的家伙！
	攻过去
1571	【风火道人吴元智已经被杀】
1572	咳咳……咳咳，可、可恶的妖人，痛、痛杀老身啊！
1573	痛、痛……快！看到一本用古隶写的经书#C04血神经#n吗？！
	没看见
	我丢了
1574	怎么会？！是了，那血神老鬼来时还带了几个门人，定是那些门人趁乱把血神经偷走了！咳咳咳……可、可恶！
1575	你怎、怎么能丢？！万、万一被血神教的人捡了——不不，一定被他们捡走了，这……咳咳咳，可、可恶！
1576	可惜可惜，我与二仙在北海炼宝，\n心中有警时，到来已经迟了。\t*A白谷逸A**S4004S*$S2S$蜀山掌门，乾坤正气妙一真人齐漱溟，白谷逸有礼了。\t*A齐漱溟A**S4004S*$S1S$唔……我已算出血神经确实已重回血神教手中，血神老人虽死，但他的爪牙五宫宫主仍在，恐怕天下仍未能平。\t*A白谷逸A**S4004S*$S2S$神尼优昙大师所算这事必定与此有关。\t*A齐漱溟A**S4004S*$S1S$笑和尚这次遇敌中有奇遇，得其通风报信，看来血神魔教中仍有正义之人，事情未必没有转机。
1577	齐师弟来了？！快来救老身，痛！
1578	诸位，我们有外围唐门弟子发现一伙从碧筠庵匆匆逃跑的血神教门人，他们正逃亡莽苍山方向。\t*A齐漱溟A**S4004S*$S2S$定是偷走血神经的妖人，#C01$N#n，当下各派均要返回居第照顾伤者，处理死者后事，无暇出手，你就跟过去一趟，随机应变吧。\t*A*nA**SS*$S1S$……明白了。
1579	吴元智师弟惨遭兵解，顽石师姐亦中毒很深，还有朱文师侄也受伤了，其他门派门人更多有死伤，血神教大势虽已去，但还是不能不防。
1590	干燥的草堆在熊熊燃烧起来。
2001	哇哇哇，救、救命啊！
	发生何事
2002	吼吼吼吼！
	进攻吧
2003	吼吼！哇啊！
2004	呜呜……
2005	啊……呜\n【僵尸被真气焚毁了】\t*A*nA**SS*$S1S$呼，终于清理完了，这下子可以安心了。\t*A李英琼A**S1111S*$S2S$也对……嗯？但是……
2006	总觉得好像有点问题，心中很不安。
	怎么了？
2007	之前我暂时寄居在附近的黑河村，后来我从#C04村西#n出来，办了点事后转去#C04北方#n，此时看到了僵尸从我#C04左手#n方向来……僵尸是从哪个方向来的？
	南方
	西方
2008	嗯？不是吧……我感觉方向是跟我出村子时一样都是#C04西方#n啊。然后我就往#C04东北方#n逃跑，那些僵尸一路追着，但途中我回头看了一眼，发现有不少僵尸突然往我的#C04右后方#n转过去，那是什么方向？
	东南方
	西北方
2009	哦哦，果然是#C04西方#n啊！然后我就往#C04东北方#n逃跑，那些僵尸一路追着，但途中我回头看了一眼，发现有不少僵尸突然往我的#C04右后方#n转过去，那是什么方向？
	东南方
	西北方
2010	对、对……糟糕了！#C04东南方#n不正是返回黑河村的大路吗？！糟、糟糕了，村子有危险！\t*A*nA**SS*$S2S$我们赶快回去看看！
2011	不是吧，我算算……感觉是东南方啊……糟糕了！东南方不正是返回黑河村的大路吗？！村子有危险！\t*A*nA**SS*$S2S$我们赶快回去看看！
2012	李英琼感受到你的睿智
2013	李英琼觉得你方向感有点弱
2014	吼吼吼吼！
	攻击僵尸
2015	呜呜……血……嘶……
2016	嘶嘶……呜吼吼！
2017	呼呼……
2018	呜吼吼！\n【僵尸前赴后继】\t*A*nA**SS*$S2S$全村的人都变成了僵尸，杀之不尽，我们快跑！
2019	#C01$N#n！真是你啊！还记得我吗？——为什么我在这里？一言难尽，我本想上蜀山学艺……\t*A李英琼A**S1111S*$S2S$哟？这等富家子弟也想去蜀山学艺？修仙很辛苦的哟。\t*A余英男A**S1111S*$S1S$你这意思是你也要上蜀山学艺？哼哼，你懂字么？贫穷可不是值得自豪的修仙资本啊！\t*A*nA**SS*$S2S$两位稍安勿躁，大家或许以后都是同门师弟，勿伤了和气。\t*A余英男A**S1111S*$S1S$唉，本公子不计较，其实我们也成不了师兄弟——别动怒，又不是说你，我只是说自己的不幸，我上山途中被一散修相中，强收我为徒，好不容易才逃了出来。
2020	唔？那边有个锦衣纨绔公子喊你？
2021	哼，孽徒，胆敢背叛师门出走？快跟我回去！
	交出英男
	阻止对方
2022	哇……御剑飞行啊，他日我也能吗？
2023	师、师父，怎、怎么会跟过来了，啊！
2024	怎么样？名门正派又如何，还能掳人弟子不放吗？\t*A*nA**SS*$S2S$……英男，论道理上确实如此，我也……\t*A余英男A**S1111S*$S1S$#C01$N#n，我不想让你为难了，或许天意如此，让我成为不了蜀山弟子……\t#F<15>唉，再也看不见灵云姑娘了。#n
2025	怎么样？名门正派又如何，还能掳人弟子不放吗？\t*A*nA**SS*$S2S$无论如何我们都不会让英男再跟你回山了！\t*A余英男A**S1111S*$S1S$#C01$N#n！不要动手，师、师父她非常厉害，你斗不赢她的……事到如今，我余英男只能认命了，或许天意如此，让我成为不了蜀山弟子……\t#F<15>唉，再也看不见灵云姑娘了。#n
2026	余英男离开了，他感到一丝失望
2027	余英男离开了，但他对你抱有感激
2028	这、这要让我进去？
	靠近观察
2029	快点进去，为师算过时辰，这时候是寒气最弱之时，快进去！
2030	吼吼呀呀咿呀！！
	前去保护
2031	吃！呀呀咿呀！
2032	咿呀！！！！\n【野兽已经气绝】\t*A*nA**SS*$S2S$我们快点过去看看英男怎样。
2033	【余英男被冻僵在地上】
2034	【余英男被冻僵在地上】
	触摸一下
2035	【山魈对你们的接近怒目而对】
	进攻
2036	……………………\t……咳咳，呼……冷、冷……\t*A*nA**SS*$S2S$英男总算回过气来了，但神志还不清晰。\t*A李英琼A**S1111S*$S1S$#C01$N#n不过莽苍山如此之大，而且万年温玉又失落了近百年，我们如何去找？\t*A*nA**SS*$S2S$神尼既然说温玉即将出世，那么莽苍山附件肯定会有奇异事情发生。\t*A*nA**SS*$S2S$刚才我看见武林盟的一些兄弟在附近驻扎，让我们去拜托他们一下吧，武林盟人多势众，或许能找到什么蛛丝马迹。
2037	哼，我们灭了那条村子，其他村子的人应该会识相了。
	过去看看
2038	哈哈哈，那些凡人，一点贡品都吝啬，真不知死活。
2039	啊啊，不、不要杀我们，我、我们虽然灭了一条村子，但只是放火而已，并、并没伤及性命！
2040	这些旁门！我、我后来找到老父的尸体，他、他是死在术法之下，肯定就是这种旁门所干，我、我要为父报仇！
	反对
	赞成
2041	啊啊啊，上、上仙饶命……
2042	我、我们预先把村民都赶走，才、才烧了他们村子，我、我们会回去帮他们重建的啊。
2043	#C01$N#n，你答应我，一定要帮我#C04把凶手绳之于法#n！
	答应
	拒绝
2044	太好了，果然是我的好朋友！\t*A*nA**SS*$S2S$英琼，我也请你勿意气用事，冷静思考。
2045	你感觉到李英琼的信赖
2046	什么？！算了，毕竟这是自家事情，不应该麻烦他人。\t*A*nA**SS*$S2S$我只是觉得冤冤相报何时了，英琼，你好好冷静一下吧。
2047	你感觉到李英琼的失望
2048	啊！找到你们了！\t*A*nA**SS*$S2S$什么？！山贼吗？好胆，英琼我们上！\t*A武林盟众A**S5002S*$S1S$千万别、别，俺虽然生得一副粗眉大眼，但俺不是山贼，俺是武林盟高山舵的人，俺是来通知你们，俺们发现在山阴那边有两个奇怪的矮人在驱赶山猿，这算是异常吗？\t*A*nA**SS*$S2S$唔……眼下再无其他异况，我们先去看一下，多谢啦山贼兄。\t*A武林盟众A**S5002S*$S1S$俺不是山贼，俺名字是……喂喂，别走，听我说……
2049	唉唉……这些臭熏熏的猿猴，快走快走。
	过去瞧瞧
2050	想不到我们会沦落到这种地步。
2051	哎，落魄凤凰不如鸡。
	旁门左道受死
2052	嘘，别太大声了，那妖尸神通大得很。
2053	【石床上躺着一具冰冷的尸体，被连着镇妖兽像的火云链束缚着】
	翻它宝袋
2054	妖尸回死时虽然什么都不知道，然而接近他还是会感到心惊肉跳。
2055	这妖尸似乎被困这里多年，也不知道生前是什么人。
2056	【火红色锁链从这头镇妖兽像连到另一头上】
2057	#C01$N#n你说！是朋友就不要骗我，我父亲究竟是怎样死的？！
	是我误杀的
	笑和尚做的
2058	你、你、你……你、你居然瞒了我这么久，亏你还自诩名门正道，你们这些人视其他人都如草芥！
2059	我不管！他也是你们一伙的，你居然瞒着我这么久，你们这些自诩名门正道的，视其他人都如草芥！
2060	【石床上躺着一具冰冷的尸体，被连着镇妖兽像的火云链束缚着】
2061	那、那人如何进来的！？
2062	莫非、莫非就是昨晚妖尸赶我们出洞的缘故，失策了！
2063	血神老人一死，老夫也觉得血神教没什么前途了，倒不如前来投靠妖尸。
2064	【妖尸尸身沉重异常，翻动不了】\t*A司徒雷A**S4007S*$S2S$哈哈哈哈哈，不是说父仇不共戴天吗？李英琼你怎么这么没孝心啊？\t*A*nA**SS*$S1S$有人？！你、你不就是慈云寺走脱的余孽？！\t*A李英琼A**S1111S*$S2S$司、司徒雷？！你刚才那番话什么意思？！说明白点！\t*A司徒雷A**S4007S*$S1S$真可怜，你不知道么？问问慈云村的村民就知道，当日就是你眼前这家伙，还有两个小子一同把你父亲及左清虚、吕元子杀死，你怎么如此愚笨！
2065	桀桀桀桀，本尊早知道有人要来偷宝，所以一直在假装回死，你们这些小子不知死活，成为本尊的养分吧！
	抵抗妖尸
2066	桀桀桀桀，感谢你们啊！长眉老鬼的火云链终于被同道所破了！那么……你们受死吧！\t*A丁引A**S1111S*$S2S$哼！果然是师兄的链子断了，你们快走，这妖尸谷辰厉害非常，我来断后！\t*A李英琼A**S1111S*$S1S$我不走！你们这些口口声声的正人君子，背后一堆道德败坏，我情愿留在这里拜谷天师为师！\t*A妖尸A**S1511S*$S2S$桀桀桀桀，本尊就收了你为徒吧！其余余孽，你们受死！
2067	【他惊恐得说不出话来】
2068	怎、怎、怎、怎……么会……
2069	哟，老夫昨晚可算出你们会到来，所以告诉了谷辰大人，你们可真不幸啊，哈哈哈哈。
2070	唔，你就是#C04$SH#n的#C01$N#n吧，我是周轻云，与白谷逸前辈来此，助你们对抗妖尸谷辰。
	多谢姑娘
2071	唔唔唔，这里妖气冲天，估计妖尸谷辰已经出山了吧，不过放心，有我追云叟在，它干不出什么事儿。
2072	唔，我们必须加快行动，各路妖物知道谷辰已经出世，必定会前来投靠它。
2073	诶诶，终于找到你们啦，这可跑得俺一个累啊！
	山贼？！
2074	别一上来就动刀动剑的，俺都说了，俺是武林盟高山舵的兄弟，上次未来得及自我介绍，俺叫#C04山则#n，你们记好了哟。\t*A*nA**SS*$S2S$啊，不还是山贼嘛……那个，找我们什么事呢？我们已经得知万年温玉就在妖尸谷辰手中。\t*A山则A**S5002S*$S1S$俺们发现北方有两只很厉害的妖物正往这边来，不知道是否与你们有关，俺们武林盟人数虽多，但这次来的都不是精英兄弟，恐怕拦不住他们。\t*A周轻云A**S1121S*$S2S$妖孽们果然来了，妖尸目前还在火云洞，我们先去除掉这些妖孽。
2075	哞哞哞，老子可是巨熊仙，你胆敢站在老子跟前？……嘿！别傻乎乎地跟老子背上的玩偶说话，老子在下面！
	进攻吧
2076	嘿嘿嘿，小可乃是牛童仙，你胆敢站在小可跟前？……嘿！别冲着小可的熊玩偶说话，小可在上面呢！
2077	哞哞……可、可恶，要、要不是谷辰答应送万、#C04万年温玉#n给我们，我们才、才不会来，\t很痛啊……温、温玉已经到乱葬岗，老子就、就……哞……差一点……\t*A*nA**SS*$S2S$什么？！温玉在乱葬岗，难、难道妖尸谷辰已经离开火云洞了？不能让它逃脱，要不再要找出它就难于登天了！
2078	救、救命快来！\t*A*nA**SS*$S2S$怎么了山贼兄？\t*A山则A**S5002S*$S1S$是山则！不、不说这个了，刚、刚才妖尸谷辰突然杀入了我们武林盟营地，我们抵挡不住，你、你们快去帮忙啊！\t*A*nA**SS*$S2S$什么，谷辰出现在武林盟营地那边……也就是说携带温玉的并不是谷辰，这却是个夺取温玉的大好时机！\t*A山则A**S5002S*$S1S$说什么话呢！武林盟兄弟们的性命不是更重要吗？
2079	【巨熊仙已经死亡，背上的玩偶失去神采】
2080	【牛童仙已经死亡，骑着的玩偶失去神采】
2081	咳咳咳咳……可、可恶，那该死的妖……咳咳。
	白前辈！
2082	那该死的妖尸突然突袭这里，把不少武林盟人士变作了僵尸，老夫虽然仙法精妙，但赶过来时还是寡不敌众，好不容易才惊走了妖尸。\t*A周轻云A**S1121S*$S2S$白前辈受伤不浅，那妖尸居然有如此能力——恐怕我们需马上行动！\t*A*nA**SS*$S1S$对，万一被妖尸弄出了大量僵尸，那么只会更加难敌，但是以我们实力……\t*A白谷逸A**S4001S*$S2S$不需担心，齐道统早算到这番，这里有#C04先天玄雷符#n一张，是齐道统让我转交给你们的，尽管去会一会那妖尸。
2083	怎、怎么会这样，颜智脸色突然发黑，然、然后居然扑向我，想咬我……
2084	【这名武林盟弟子已成了发黑的尸体】
2085	哼，虚伪小人，还敢送上门来！这一剑，我是为老父刺的！
	马上迎击
	放弃抵抗
2086	可、可恶！明明杀父仇人就在眼前！\t*A司徒雷A**S4007S*$S2S$英琼！好汉不吃眼前亏，对面特别是那个蜀山小妞，太厉害了，我们先退入洞，让天师对付他们！\t*A李英琼A**S1111S*$S1S$可恨！你们等着瞧！\t*A*nA**SS*$S2S$这句话说得可真没气势啊……
2087	啧哈哈哈，还敢来，你们那白老头在我们天师面前，就像个小孩子般无力。
2088	【火红色锁链已经断开，一头连在这镇妖兽像上】
2089	啧，那长眉死鬼，用火云链困了本尊一百年，看本尊把你们蜀山杀得鸡犬不留！
	看招！
2090	咳咳，果然被困了百年，真气略有不足，不过本尊炼就一身铜头铁骨，你们甭想动本尊一毫！\t*A周轻云A**S1121S*$S2S$铜头铁骨还是怕天雷吧？！#C01$N#n，把齐道统的#C04先天玄雷符#n祭出来！
2091	什么！？难道是齐老狗的先天玄雷符？你、你们不可能有的啊！
	祭天雷
2092	怎、怎么真的是……不妙，幸亏本尊刚刚破了温玉禁符！司徒雷，取温玉来！\t*A*nA**SS*$S2S$先天玄雷符！\t*A谷辰A**S1511S*$S1S$司徒雷！快给本尊拿温玉出来！司徒……哇啊啊啊！\t*A周轻云A**S1121S*$S2S$什么？！糟糕，谷辰的元神带着一紫气缠绕的宝物逃走了！快追！\t*A白谷逸A**S4004S*$S1S$且慢，妖尸命中注定此战只毁了肉身，日后若要消灭妖尸元神，需要紫青合璧。\t*A*nA**SS*$S2S$紫青合璧？\t*A白谷逸A**S4004S*$S1S$日后你们便知。\t*A*nA**SS*$S2S$只是温玉已失，如何是好。
2093	#C01$N#n，慢着。
	想怎么样
2094	拿去救余英男吧。\t*A*nA**SS*$S2S$这……这是#C04万年温玉#n？！不是被那阴阳叟司徒雷盗走了吗？\t*A李英琼A**S1111S*$S1S$盗也是盗，只是给我盗了，司徒雷被偷了温玉，又怕妖尸责怪，所以才逃跑。\t*A*nA**SS*$S2S$英男有救了！我们赶快过去！
2095	………………\n【余英男气色开始红润起来】\t*A*nA**SS*$S2S$看来起效了，感谢你英琼，我早知道你没有真心拜那妖尸为师！
2096	切，土包子一个，就算肯来蜀山，我们师傅也未必看得上他。
2097	哼，我只是为了救那纨绔，你们别自作多情了
	上蜀山吗？
2098	不，我已经受够了你们这些……\t*A周轻云A**S1121S*$S2S$算了吧，蜀道之难，难于上青天，就凭你这个身体健硕一点的土包子，又怎么能去到蜀山。\t*A李英琼A**S1111S*$S1S$你这丫头要不是早入蜀山，哪能这么神气活现，我是不想去，非不能去。\t*A周轻云A**S1121S*$S2S$喔唷~\t*A李英琼A**S1111S*$S1S$好，我就上蜀山一趟，在你们大门撒泡尿才走，哼！
7001	蜀山长眉所青睐的三英二云，就让本尊领教一下吧！
7002	啊哈哈哈，你们得再用心一点进攻。
7003	热身够了，大伙们，让各大门派，好好看看我们血神教的实力！
7004	哇嗷嗷！
7005	哇呼呼！哇啊！
7006	什么人？！胆敢偷袭我们莽苍双煞！
8000	暂未开放，敬请期待