编号	等级_S	生命_S	真气_S	物理伤害_S	法术伤害_S	物理防御_S	法术防御_S	速度_S	物理抗性	法术抗性	攻击修炼	物防修炼	法防修炼	物理暴击	物理抗暴	法术暴击	法术抗暴	愤怒初始值	符能初始值
1001	ALV	B*2	B*1	B*1	B*1	B*1	B*1	B*1.5	0	0	0	0	0						
1002	ALV	B*0.8	B*1	B*0.6	B*0.6	B*0.6	B*0.6	B*0.6											
1003	ALV	B*0.8	B*1	B*0.4	B*0.4	B*1	B*1	B*1											
1004	ALV	B*0.8	B*1	B*0.6	B*0.6	B*0.6	B*0.6	B*0.6											
1005	ALV	B*0.8	B*1	B*0.4	B*0.4	B*1	B*1	B*1											
1006	ALV	B*0.8	B*1	B*0.6	B*0.6	B*0.6	B*0.6	B*0.6											
1007	ALV	B*0.8	B*1	B*0.4	B*0.4	B*1	B*1	B*1											
