#-*-coding:utf-8-*-
#作者:叶伟龙@龙川县赤光镇

def getScore(iLevel,sWearPos):
	if iLevel not in gdData:
		return 0
	return gdData[iLevel][sWearPos]


#导表开始
gdData={
	40:{"帽子":59,"项链":59,"武器":304,"衣服":87,"腰带":53,"鞋子":36},
	50:{"帽子":72,"项链":72,"武器":371,"衣服":105,"腰带":63,"鞋子":44},
	60:{"帽子":84,"项链":84,"武器":438,"衣服":122,"腰带":74,"鞋子":51},
	70:{"帽子":97,"项链":97,"武器":505,"衣服":139,"腰带":84,"鞋子":59},
	80:{"帽子":109,"项链":109,"武器":572,"衣服":157,"腰带":95,"鞋子":67},
	90:{"帽子":122,"项链":122,"武器":639,"衣服":174,"腰带":105,"鞋子":74},
	100:{"帽子":134,"项链":134,"武器":707,"衣服":191,"腰带":116,"鞋子":82},
}
#导表结束