编号	等级_E	生命_S	真气_S	物理伤害_S	法术伤害_S	物理防御_S	法术防御_S	速度_S	治疗_S	封印_S	抗封_S	物理抗性	法术抗性	攻击修炼	物防修炼	法防修炼	物理暴击	物理抗暴	法术暴击	法术抗暴	愤怒初始值	符能初始值
1001	ALV-2	B*2.3	B*1	B*1	B*1	B*1	B*1	B*1.5	B*0.82	B*0	B*0.8											
1002	ALV-2	B*1.3	B*1	B*0.6	B*1.2	B*0.6	B*0.6	B*0.8	B*1	B*0	B*0.3											
1003	ALV-2	B*1	B*1	B*0.6	B*0.7	B*0.6	B*0.6	B*1	B*0.82	B*0	B*0.3											
1004	ALV-2	B*0.9	B*1	B*0.8	B*0.6	B*0.6	B*0.6	B*0.7	B*0.82	B*0	B*0.3											
2001	ALV-1	B*2	B*1	B*1	B*1	B*1	B*1	B*1.5	B*0.82	B*0	B*0.8											
2002	ALV-1	B*1.3	B*1	B*0.4	B*1.2	B*0.8	B*0.8	B*1	B*1	B*0	B*0.3											
2003	ALV-1	B*1	B*1	B*0.8	B*0.6	B*0.6	B*0.6	B*0.7	B*0.82	B*0	B*0.3											
2004	ALV-1	B*0.9	B*1	B*0.6	B*0.8	B*0.6	B*0.6	B*0.7	B*0.82	B*0	B*0.3											
3001	ALV+1	B*2.5	B*1	B*1	B*1	B*1	B*1	B*1.5	B*0.82	B*0	B*0.8											
3002	ALV+1	B*2	B*1	B*0.7	B*0.4	B*0.6	B*0.6	B*0.7	B*0.82	B*0	B*0.3											
4001	ALV+2	B*2	B*1	B*1	B*1	B*1	B*1	B*1.5	B*0.82	B*0	B*0.8											
4002	ALV+2	B*2	B*1	B*1	B*1	B*1	B*1	B*1.5	B*0.82	B*0	B*0.8											
5001	ALV+3	B*3	B*1	B*1	B*1	B*1	B*1	B*0.7	B*0.82	B*0	B*0.8											
5002	ALV+3	2	B*1	B*0.5	B*0.6	B*1	B*1	B*1	B*0.82	B*0	B*0.3											
