#-*-coding:utf-8-*-
#作者:叶伟龙@龙川县赤光镇
def getConfig(iNo,sKey,uDefault=0):
	if iNo not in gdData:
		raise PlannerError,'没有编号为{}的等级药'.format(iNo)
	return gdData[iNo].get(sKey,uDefault)

#导表开始
gdData={
	221101:{"名称":"止血草","绑定":0,"等级":1,"出售价格":1500,"回收价格":1200,"炼化灵气":0,"叠加上限":99,"效果":{"生命":150,}},
	221102:{"名称":"佛手","绑定":0,"等级":1,"出售价格":2000,"回收价格":1600,"炼化灵气":0,"叠加上限":99,"效果":{"真气":300,}},
	221103:{"名称":"当归","绑定":0,"等级":1,"出售价格":1500,"回收价格":1200,"炼化灵气":0,"叠加上限":99,"效果":{"生命":200,}},
	221104:{"名称":"杜仲","绑定":0,"等级":1,"出售价格":2000,"回收价格":1600,"炼化灵气":0,"叠加上限":99,"效果":{"真气":150,}},
	221201:{"名称":"龙涎草","绑定":0,"等级":2,"出售价格":1500,"回收价格":1200,"炼化灵气":0,"叠加上限":99,"效果":{"生命":200,}},
	221202:{"名称":"蜂皇浆","绑定":0,"等级":2,"出售价格":2000,"回收价格":1600,"炼化灵气":0,"叠加上限":99,"效果":{"真气":150,}},
	221203:{"名称":"玉璃膏","绑定":0,"等级":2,"出售价格":1500,"回收价格":1200,"炼化灵气":0,"叠加上限":99,"效果":{"生命":250,}},
	221204:{"名称":"碧水清茗","绑定":0,"等级":2,"出售价格":2000,"回收价格":1600,"炼化灵气":0,"叠加上限":99,"效果":{"真气":200,}},
	221301:{"名称":"蓝田玉露","绑定":0,"等级":3,"出售价格":0,"回收价格":0,"炼化灵气":50,"叠加上限":1,"效果":{"生命":"PL*5+100",},"服务端描述":"[功效]复活并恢复生命=$hp"},
	221302:{"名称":"度厄金丹","绑定":0,"等级":3,"出售价格":0,"回收价格":0,"炼化灵气":50,"叠加上限":1,"效果":{"生命":"PL*3",},"服务端描述":"[功效]解除封印类异常状态，并恢复生命=$hp"},
	221303:{"名称":"石乳空青","绑定":0,"等级":3,"出售价格":0,"回收价格":0,"炼化灵气":50,"叠加上限":1,"效果":{"真气":"PL*5+50",},"服务端描述":"[功效]恢复真气(或真气储备)=$mp"},
	221304:{"名称":"龙虎血气丹","绑定":0,"等级":3,"出售价格":0,"回收价格":0,"炼化灵气":50,"叠加上限":1,"效果":{"生命":"PL*12+150",},"服务端描述":"[功效]恢复生命(生命储备)=$hp"},
}
#导表结束


def afterHotUpdate():
	props.load.initModule()#重新建立编号与模块的映射关系

import props.load