编号	内容_S
1001	我？我乃蜀山掌门。唔……今天你有缘见我，且看你骨骼清奇，或许有缘随我上山修炼。\t*A*nA**SS*$S2S$（仙缘难得，与其留在尘世中浑浑噩噩，倒不如上山一试！）\n师父在上，请受徒儿拜师礼。
1002	这药草……好好，果然有我心……咳咳，但是有心是不够的，还要看你根基，那边有个无赖，除掉他吧。\t这里有点药草，你先带在身上。
1003	我要的物品……你还没带来吧。
1004	啊啊，别打，我和你什么仇什么怨啊。
1005	哟，这么菜比还主动挑衅我。
1006	干得好，为师允许你进我蜀门，你路师兄刚好也来苏州了，先随他锻炼一下。
	还、还要打吗？
	好！
1007	哈哈，你以为真的打赢了我吗？我才出了不到一成功力。好啦，随我回蜀山吧。
1008	哟，刚入门能有这种程度不错咯。
1009	我与路向东可是至交，他来苏州吃喝拉撒我全管了！
1010	为师现在就传授你蜀山基本口诀，你留心听着\n#C09（传授口诀中……）#n
1011	徒儿真有为师心，你也累了，四处走走吧。
1012	你给为师这个干嘛呢？
1013	你是$N？……其实……蜀山其实并没有那么……\t*A*nA**SS*$S2S$二师兄我明白的！我会努力，不会丢蜀山的脸。
1014	…………\t*A*nA**SS*$S2S$请问前辈，这里是何处？\n这位前辈怎么腿好像有点不方便？\t*A神秘人A**S1111S*$S1S$腿不方便？你没看到我的脚镣吗？……\n你是蜀山派的人？！
1015	……快离开这里，这里是不祥之地！
1016	小心，别犯错被赶走。
1017	嗯，师父好像叫你着？
1018	哦……我从来没去过。
1019	直走在转弯。
1020	不不，走错了，返回原处。
1021	啧啧……又一个被骗的傻瓜，跟我一样。
1022	快滚吧！留着你的小命！
1023	现在所谓的蜀山，其实由一帮叛帮的人把持，他们反客为主，囚我在此已经多年。\t然而那些叛徒正临百年一遇的天劫，若是能趁机干扰，或者……
1024	然而那些叛徒正临百年一遇的天劫，若是能趁机干扰，或者……
1025	一派胡言，你切勿听帮中叛徒在妖言惑众。好吧，你先帮为师清理一下门外的醉汉。
1026	混账徒儿，胆敢欺负上门求助的老百姓！大逆不道！
1027	胡说，为师怎么说过这番话，你看他们有喝醉酒的样子吗？！
1028	哼！让三师姐收拾收拾你这孽徒！
1029	哼！让二师兄收拾收拾你这孽徒！
1030	……你走吧，不要再上山了，修仙……并没有你想象得那么美好纯净。
1031	看什么看小子？！
	只打敌首
	一网打尽
	打声招呼
1032	来吧，让师兄敲打敲打你的筋骨
	切磋一番
	再等一下
1033	杀人啊！蜀山派杀人啊！
1034	救、救命！
1035	跟你很熟哈？！
1036	进来蜀山门，哪能那么怕事！给你一丹药拿着！
1037	嗯！果然有志气！
1038	我就一围观群众，别打到我哟，要不我不客气。
1039	你真的是蜀山派的人？！
	是、是啊
	不是不是
1040	呃、呃……好酒！
	快点离开
2001	啊！……不好意思、不好意思，\n我顾着走路看书，碰到你了，实在对不起。
2002	诶，这位朋友，刚刚从你身上掉下了这卷锦书，幸好我发现了。\t*A*nA**SS*$S2S$（锦书？我没有锦书啊……莫非是那位被囚禁的前辈偷偷塞给我的？）
2003	走得那么快，怎么不跟大师兄我道个别呢？
	大师兄，得罪了！
	(沉默不语)
2004	…………这、这就是与我一样，刚入门的人？
2005	这么弱不禁风，你还是跟我回师门受罚吧。
2006	哈哈哈哈，很好很好，只不过要战胜师尊还是欠点火候。\t五月端午午时，便是师尊闭关之日，若此时你能道成归来，倒有成功的可能性。
2007	不够不够……这里附近有只巨大的岩石怪，我要战胜它！
2008	轰轰轰轰轰轰轰
	上吧
	再准备一下
2009	打不赢它，还谈什么回蜀山？！
2010	轰轰轰轰……\n（岩石妖缩成一团）\t*A*nA**SS*$S2S$战胜了！但这段时间我必须不断训练！\n#C09——三个月后——#n
2011	谢、谢谢……快到端午了，我、我给粽子你吃啊。\t*A*nA**SS*$S2S$（对了，快到端午，正是师傅闭关之时！）
2012	呜呜呜……好痛啊好痛啊。
2013	呃，怎么啦？粽子……\t*A*nA**SS*$S2S$（我真的要回蜀山吗？……嗯！那前辈被囚多年，正宗蜀山已经破落，我、我不能让他们继续作恶！）
2014	真、真的要回蜀山，和师傅战斗吗？
	是的
	我……不是
2015	……我、我也知道会是这个答案。我……会阻止你的，尽管现在蜀山不一定是正确的，\t但并不代表以前的就一定好啊！你有了解过吗？！
2016	呼……那实在太好了——你不是骗我的吧？
2017	哼，虽然我不是蜀山中人，但关乎正道气运之事我不得不管！
2018	天庭有路你不走，地狱没门闯进来，看招！
	……来吧！
2019	咳咳咳……怎么，如此厉害。\t*A富贵剑董威A**S4501S*$S2S$这厮实力不同寻常！今天蜀山师尊正要闭关，实力大减，你们快回去！这里有我挡着。
2020	咳咳……我……呃……。\t*A*nA**SS*$S2S$（糟糕，他伤重死了……怎么会……不行，我不能动摇，走吧！）
2021	百年大劫，应在当时；\n不破不立，蜀山当兴。\t……你去做你认为对的事吧。
2022	………………
	进攻
	准备
2023	孽畜！欺师灭祖，天诛地灭！
2024	哼，第一次见面时，我就该下重手废了你！
2025	如果可以和平相处……我是太天真了吧？
2026	………………\t*A*nA**SS*$S2S$师兄师姐已经败了，到你了，师父。你若不肯先出手，那徒儿就得罪了！
2027	………………\t*A*nA**SS*$S2S$师父，你怎么了……\t*A大师兄姜朝南A**S4504S*$S1S$百晓她因为气急攻心，又急于出关，早就走火入魔，全身枯死，跟活死人没区别，动手吧。
2028	……………………
	恶贯满盈，受死
	我、我下不了手
2029	此时不下手，更待何时？
2030	啊………………\n#C09（百晓仙姑被杀）#n\t*A*nA**SS*$S2S$哼，一切都结束了。
2031	啊………………\n#C09（百晓仙姑被杀）#n\t*A*nA**SS*$S2S$大师兄你、你为什么要下手？
2032	哈哈哈哈……百晓这叛徒已死，老夫终于重见天日了！
	你到底是谁？！
2033	恭喜师尊，得以重掌蜀门！
2034	老夫便是蜀山派开派祖师樗散子，你学了老夫心血所写的锦书，\t也算是老夫亲传弟子，以后就和朝南侍奉老夫左右吧！
2035	区区蝼蚁，不值老夫出手。
2036	樗散子！你做了那么多伤天害理的事，不可以再让你为祸世间！
	三师姐，等等……
2037	可恨当年恩师念你为蜀门开派人，没有杀了你，误了天下苍生……\t*A樗散子A**S1111S*$S2S$废话真多。\n#C09（樗散子以剑气杀了林逐西）#n
2038	樗祖师爷，我、我路向东乃是您徒孙，绝对不会向林逐西那般愚钝！\t在樗祖师爷带领下，我们蜀山一定会千秋万载，一统三界！
2039	蝼蚁与蝼蚁间的对话，老夫不管。
2040	百晓真该死，胆敢囚禁祖师爷这么久，只可惜小的微末技艺，敢怒不敢言。
2041	我虽入门不久，但也不会像四师兄你这样卖师求荣！\t*A四师兄路向东A**S4502S*$S2S$别、别胡说，识时务者为俊杰啊！\t*A樗散子A**S1111S*$S1S$聒耳得让人烦厌，人各有志，某徒孙你就杀了她吧。
2042	哼！我将随师父与三师姐而去！
2043	你内心感到一丝愧疚
2044	你内心感到一丝愤怒
2045	别怪我，是你不识时务而已！
	四师兄住手！
	就手旁观
2046	（你内心谴责着你）
2047	啊！你、你居然……\n#C09（路向东已死）#n\t*A大师兄姜朝南A**S4504S*$S2S$啊哈哈哈，有出息，我早料到背叛师门这事会上瘾的了。
2048	哈哈哈哈，那些所谓正道弟子，终于落入我的包围网中了，看我怎样对付他们！\t*A*nA**SS*$S2S$（诶？好像有什么诡异的事情要发生了，跟过去看看吧。）
2049	哈哈哈，犯了门规就想跑？
	得罪了
	准备一下
2050	跟我回去或者还能活命？！
	抱歉了
	准备一下
2051	哼，我死也不会后退
	没办法了
	准备一下
8000	暂未开放，敬请期待