编号	内容_S
1001	六大门派弟子广布天下，其中不乏武力高强深藏不露者。你们要去和他们切磋下吗？
	以武会友
	快捷组队
	规则说明
1002	对方人多势众，活动需要#C04队伍人数≥3#n
1003	请先召回暂离队员
1004	刀剑无眼，不要带上小朋友。玩家#C04等级需≥40级#n
1005	你已经有任务，快去完成吧
1006	#C03$map#n的#C02$target#n集合了一群众门派弟子在等待你们去挑战，快去证明自己吧！
1007	少侠们好武功，青出于蓝而胜于蓝。你们的成绩是#C02$time#n
1008	你们一共闯过了#C02$number#n关，功力还是稍欠火候，准备一下再来继续挑战吧。
1009	蜀山弟子
1010	唐门弟子
1011	武林盟弟子
1012	魔宫弟子
1013	苗疆弟子
1014	佛门弟子
1015	该我出手了，你们注意啦
1016	1.玩家等级≥#C0240级#n，队伍人数≥#C023#n\n2.试炼战斗为各大门派弟子#C02车轮战#n，通过每轮战斗恢复一定的#C02生命和真气#n\n3.每人只能获取#C021次#n通关奖励，可通过继续挑战改变自己的#C02成绩#n\n4.成绩最好的#C02前3名#n队伍可获得#C02特殊称谓#n
6001	$rolename在#L1<14,25>*[门派试炼]*02#n中表现出色，获得了$lnkProps
6002	#L1<14,25>*[门派试炼]*02#n将在#C0220:00#n准时开始，请各位仙友做好准备，前往等待活动开始
6003	#L1<14,25>*[门派试炼]*02#n已经开始，已经准备好的仙友快前往领取任务，挑战诸大门派
6004	本次#L1<14,25>*[门派试炼]*02#n已经结束，表现最好的队伍为：#C01$team1#n（#C02$time1#n）获得第一名
6005	本次#L1<14,25>*[门派试炼]*02#n已经结束，表现最好的队伍为：#C01$team1#n（#C02$time1#n）获得第一名;#C01$team2#n（#C02$time2#n）获得第二名
6006	本次#L1<14,25>*[门派试炼]*02#n已经结束，表现最好的队伍为：#C01$team1#n（#C02$time1#n）获得第一名;#C01$team2#n（#C02$time2#n）获得第二名;#C01$team3#n（#C02$time3#n）获得第三名
