编号	名称	类型	职业	开启等级	法术_T	五行	作用目标	作用人数_E	最大作用人数	持续回合_E	最大持续回合	伤害_E	威力	真气消耗_E	愤怒消耗_E	符能消耗_E	符能回复_E	buff	速率	命中率_E	技能效果_S	法术效果_S	配置数据_S
1111	御剑术	物理近攻	11	0	1111		敌方	1				SLV*2+20	120	SLV*1+20			20		100				
1112	百剑绕指	物理远攻	11	15	1112		敌方	SLV/35+3	5			SLV*2+20	120	SLV*1.2+20			5		100				
1113	万剑归一	物理远攻	11	30	1113		敌方	SLV/35+3	5			SLV*2+20	120	SLV*1.2+40		40			100				
1121	神通符法	物理近攻	11	5	1121		敌方	1				SLV*2+20	120	SLV*1.2+20		10			100				概率:50
1122	五雷符法	物理远攻	11	20	1122		敌方	LV/35+3	5	(SLV-VLV+2)/10+5	5	SLV*2+20	100	SLV*1.2+30		30		122	100				
1123	天师符法	物理远攻	11	35	1123		敌方	LV/35+3	5			SLV*2+20	120	SLV*1.2+40		40			100				
1131	纯阳无极诀	增益	11	10	1131		己方	5		(SLV-VLV+2)/10+5	5			SLV*1+20			10	101	100				
1132	混元一气诀	物理远攻	11	25	1132		敌方	5				SLV*2+20	120	SLV*1+30		30			100				
1133	先天正气诀	物理近攻	11	40	1133		敌方	1	5			SLV*2+20	120	SLV*1+40		50			100				
1191	身剑合一	物理远攻	11	80	1191		敌方	5				SLV*2+20	120		120				100				
1211	风雷弹	魔法攻击	12	0	1211		敌方	1				SLV*2+20	60	SLV*1.2+20			10		100				治疗:SLV*2+20|治疗威力:50|目标数:5
1212	风神枪	魔法攻击	12	15	1212		敌方	SLV/35+3	5			SLV*2+20	60	SLV*1.2+20			5		100				
1213	风龙炮	魔法攻击	12	30	1213		敌方	1				SLV*2+20	60	SLV*1.2+20		15			100				
1221	花醉针	魔法攻击	12	5	1221		敌方	1		2		SLV*2+20	60	SLV*1.2+20			15	102	100				
1222	花毒箭	魔法攻击	12	20	1222		敌方	1		2		SLV*2+20	60	SLV*1.2+20		5		103	100				
1223	花葬镖	魔法攻击	12	35	1223		敌方	1		2		SLV*2+20	60	SLV*1.2+20		15		104	100				
1231	雪映晴	增益	12	10	1231		己方	5		(SLV-VLV+2)/10+5	5			SLV*1.2+20				105	100				
1232	雪飘尘	解封	12	25	1232		己方	1		2				SLV*1.2+20		10		106	100				
1233	雪满山	增益	12	40	1233		己方	SLV/35+3	5	(SLV-VLV+2)/10+2	2			SLV*1.2+20		40		107	100				
1291	月下独酌	魔法攻击	12	80	1291		敌方	5				SLV*2+20	60		120		5		100				
1311	落星式	物理近攻	13	0	1311		敌方	1				SLV*2+20	120	SLV*1+20			20		100				
1312	断月式	物理近攻	13	15	1312		敌方	SLV/60+3	4			SLV*2+20	120	SLV*1.2+20			5		100				
1313	分阳式	物理近攻	13	30	1313		敌方	1		1		SLV*2+20	100	SLV*1.2+30		40		108	100				
1321	势如破竹	物理近攻	13	5	1321		敌方	1		2		SLV*2+20	120	SLV*1.2+40			20	123	100				
1322	乘胜追击	物理近攻	13	20	1322		敌方	1	3			SLV*2+20	120	SLV*1.2+40		20			100				
1323	横扫千军	物理近攻	13	35	1323		敌方	1		2		SLV*2+20	50	SLV*1.2+50		50		123	100				
1331	流星	物理近攻	13	10	1331		敌方	1				SLV*2+20	120	SLV*1.2+20		10			100				
1332	燕返	物理近攻	13	25	1332		敌方	1				SLV*2+20	120	SLV*1.2+20		10			100				
1333	无畏	物理近攻	13	40	1333		敌方	1				SLV*2+20	120	SLV*1.2+40		40			100				
1411	御蜂术	魔法攻击	14	0	1411		敌方	1				SLV*2+20	60	SLV*1+20			20		100				
1412	驱蛛术	魔法攻击	14	15	1412		敌方	SLV/35+3	5			SLV*2+20	60	SLV*1.2+20			5		100				
1413	逐蝎术	魔法攻击	14	30	1413		敌方	1		1		SLV*2+20	60	SLV*1.2+20		20		124	100				
1421	迷魂咒	封印	14	5	1421		敌方	1		(SLV-VLV+2)/10+4	4			SLV*1.2+20			10	109	100	(SLV-VLV)*2+70			
1422	破血咒	封印	14	20	1422		敌方	1		(SLV-VLV+2)/10+4	4			SLV*1.2+30		10		110	100	(SLV-VLV)*2+70			
1423	禁绝咒	封印	14	35	1423		敌方	1		(SLV-VLV+2)/10+4	4			SLV*1.2+40		30		111	100	(SLV-VLV)*2+70			
1431	百足蛊	增益	14	10	1431		己方	SLV/35+3	5	(SLV-VLV+2)/10+5	5			SLV*1.2+20			10	112	100				
1432	金蚕蛊	增益	14	25	1432		己方	SLV/35+3	4	(SLV-VLV+2)/10+5	5			SLV*1.2+30		20		113	100				
1433	隐身蛊	增益	14	40	1433		自己	1		(SLV-VLV+2)/10+5	5			SLV*1.2+40		40		114	100				
1511	血魔焰	魔法攻击	15	0	1511		敌方	1				SLV*2+20	120	SLV*1+20			20		100				
1512	噬骨魔火	魔法攻击	15	15	1512		敌方	1				SLV*2+20	120	SLV*1.2+20		10			101				伤害率:{0:55,1:60}|生命值限制:70
1513	烛天魔焰	魔法攻击	15	30	1513		敌方	1				SLV*2+20	120	SLV*1.2+30		15			102				目标符能:-20
1521	九幽阴风	增益	15	5	1521		己方	SLV/30+2	4	(SLV-LV+2)/10+5	5			SLV*1.2+20			10	115	103				
1522	通幽续命	治疗	15	20	1522		自己	1				SLV*2+20	100	SLV*1+20		20			104				恢复真气:200
1523	呼幽唤灵	增益	15	35	1523		己方	1		(SLV-LV+2)/10+6	6			SLV*1.2+50		40			105				名称:幽灵|造型:4006(0,1,0,0,0)|染色:(0,0,0,0,0)|技能:(1511,)
1531	血雨腥风	魔法攻击	15	10	1531		敌方	SLV/25+3	6			SLV*2+20	120	SLV*1.2+20			10		106				
1532	祸水滔天	魔法攻击	15	25	1532		敌方	SLV/35+3	5	(SLV-LV+2)/10+4	4	SLV*2+20	120	SLV*1.2+30		25		116	107				伤害率:(30,25)
1533	翻江倒海	魔法攻击	15	40	1533		敌方	99				SLV*2+20	25	SLV*1.2+30		50			108				
1611	狮吼功	魔法攻击	16	0	1611		敌方	1				SLV*2+20	60	SLV*1+20			20		100				
1612	金刚禅唱	魔法攻击	16	15	1612		敌方	SLV/35+3	5			SLV*2+20	60	SLV*1.2+20			5		100				
1613	索命梵音	魔法攻击	16	30	1613		敌方	1				SLV*2+20	60	SLV*1.2+30		20			60				
1621	立地生佛	治疗	16	5	1621		己方	2		(SLV-VLV+2)/10+5	5	SLV*2+20	80	SLV*1.2+20			10	117	100				
1622	枯树生花	复活	16	20	1622		己方	1		1		SLV*2+20	100	SLV*1.2+50		20			100				
1623	步步生莲	增益	16	35	1623		己方	1		(SLV-VLV+2)/10+5	5	SLV*2+20	100	SLV*1.2+40		30		118	100				次数:5
1631	金刚不坏	增益	16	10	1631		己方	LV/50+2	3	(SLV-VLV+2)/10+4	4	SLV*2+20	60	SLV*1.2+20			10	119	120				
1632	龙象般若	增益	16	25	1632		己方	1		(SLV-VLV+2)/10+3	3					15		120	100				
1633	洗髓易筋	增益	16	40	1633		己方	1		(SLV-VLV+2)/10+3	3	SLV*2+20	120	SLV*1.2+40		40		121	150				
1691	金刚伏魔	魔法攻击	16	80	1691		敌方	5				SLV*2+20	120		120				100				
