道具编号	名称	绑定	等级	出售价格	回收价格	炼化灵气	叠加上限	效果	服务端描述
221101	止血草	0	1	1500	1200	0	99	生命:150	
221102	佛手	0	1	2000	1600	0	99	真气:300	
221103	当归	0	1	1500	1200	0	99	生命:200	
221104	杜仲	0	1	2000	1600	0	99	真气:150	
221201	龙涎草	0	2	1500	1200	0	99	生命:200	
221202	蜂皇浆	0	2	2000	1600	0	99	真气:150	
221203	玉璃膏	0	2	1500	1200	0	99	生命:250	
221204	碧水清茗	0	2	2000	1600	0	99	真气:200	
221301	蓝田玉露	0	3	0	0	50	1	生命:PL*5+100	[功效]复活并恢复生命=$hp
221302	度厄金丹	0	3	0	0	50	1	生命:PL*3	[功效]解除封印类异常状态，并恢复生命=$hp
221303	石乳空青	0	3	0	0	50	1	真气:PL*5+50	[功效]恢复真气(或真气储备)=$mp
221304	龙虎血气丹	0	3	0	0	50	1	生命:PL*12+150	[功效]恢复生命(生命储备)=$hp
