# -*- coding: utf-8 -*-

def getDamageRatio(fiveElAttack, fiveElDefend):
	if fiveElAttack == 0 or fiveElDefend == 0:
		return 0
	return kezhi[fiveElAttack][fiveElDefend]["伤害加成"]


#导表开始
kezhi={
	6:{
		6:{"伤害加成":10},
		1:{"伤害加成":0},
		2:{"伤害加成":0},
		3:{"伤害加成":0},
		4:{"伤害加成":0},
		5:{"伤害加成":0},
	},
	1:{
		6:{"伤害加成":0},
		1:{"伤害加成":0},
		2:{"伤害加成":5},
		3:{"伤害加成":0},
		4:{"伤害加成":-5},
		5:{"伤害加成":0},
	},
	2:{
		6:{"伤害加成":0},
		1:{"伤害加成":-5},
		2:{"伤害加成":0},
		3:{"伤害加成":0},
		4:{"伤害加成":0},
		5:{"伤害加成":5},
	},
	3:{
		6:{"伤害加成":0},
		1:{"伤害加成":0},
		2:{"伤害加成":0},
		3:{"伤害加成":0},
		4:{"伤害加成":5},
		5:{"伤害加成":-5},
	},
	4:{
		6:{"伤害加成":0},
		1:{"伤害加成":5},
		2:{"伤害加成":0},
		3:{"伤害加成":-5},
		4:{"伤害加成":0},
		5:{"伤害加成":0},
	},
	5:{
		6:{"伤害加成":0},
		1:{"伤害加成":0},
		2:{"伤害加成":-5},
		3:{"伤害加成":5},
		4:{"伤害加成":0},
		5:{"伤害加成":0},
	},
}
#导表结束